import type { OptionsItem } from '@/components/AddressPicker/AddressPicker'

export const AddressJson: OptionsItem[] = [
  {
    id: '330000',
    label: '浙江省',
    parentId: '0',
    children: [
      {
        id: '330400',

        label: '嘉兴市',
        parentId: '330000',

        children: [
          {
            id: '330402',

            label: '南湖区',
            parentId: '330400',

            children: [
              {
                id: '330402012',

                label: '七星街道',
                parentId: '330402',

                children: null,

                code: '330402012',
                name: '浙江省/嘉兴市/南湖区/七星街道',
                treePath: '330000/330400/330402/330402012',

                level: 5,
              },
              {
                id: '330402013',

                label: '东栅街道',
                parentId: '330402',

                children: null,

                code: '330402013',
                name: '浙江省/嘉兴市/南湖区/东栅街道',
                treePath: '330000/330400/330402/330402013',

                level: 5,
              },
              {
                id: '330402101',

                label: '余新镇',
                parentId: '330402',

                children: null,

                code: '330402101',
                name: '浙江省/嘉兴市/南湖区/余新镇',
                treePath: '330000/330400/330402/330402101',

                level: 5,
              },
              {
                id: '330402100',

                label: '凤桥镇',
                parentId: '330402',

                children: null,

                code: '330402100',
                name: '浙江省/嘉兴市/南湖区/凤桥镇',
                treePath: '330000/330400/330402/330402100',

                level: 5,
              },
              {
                id: '330402010',

                label: '南湖街道',
                parentId: '330402',

                children: null,

                code: '330402010',
                name: '浙江省/嘉兴市/南湖区/南湖街道',
                treePath: '330000/330400/330402/330402010',

                level: 5,
              },
              {
                id: '330402014',

                label: '城南街道',
                parentId: '330402',

                children: null,

                code: '330402014',
                name: '浙江省/嘉兴市/南湖区/城南街道',
                treePath: '330000/330400/330402/330402014',

                level: 5,
              },
              {
                id: '330402105',

                label: '大桥镇',
                parentId: '330402',

                children: null,

                code: '330402105',
                name: '浙江省/嘉兴市/南湖区/大桥镇',
                treePath: '330000/330400/330402/330402105',

                level: 5,
              },
              {
                id: '330402007',

                label: '建设街道',
                parentId: '330402',

                children: null,

                code: '330402007',
                name: '浙江省/嘉兴市/南湖区/建设街道',
                treePath: '330000/330400/330402/330402007',

                level: 5,
              },
              {
                id: '330402103',

                label: '新丰镇',
                parentId: '330402',

                children: null,

                code: '330402103',
                name: '浙江省/嘉兴市/南湖区/新丰镇',
                treePath: '330000/330400/330402/330402103',

                level: 5,
              },
              {
                id: '330402011',

                label: '新兴街道',
                parentId: '330402',

                children: null,

                code: '330402011',
                name: '浙江省/嘉兴市/南湖区/新兴街道',
                treePath: '330000/330400/330402/330402011',

                level: 5,
              },
              {
                id: '330402009',

                label: '新嘉街道',
                parentId: '330402',

                children: null,

                code: '330402009',
                name: '浙江省/嘉兴市/南湖区/新嘉街道',
                treePath: '330000/330400/330402/330402009',

                level: 5,
              },
              {
                id: '330402008',

                label: '解放街道',
                parentId: '330402',

                children: null,

                code: '330402008',
                name: '浙江省/嘉兴市/南湖区/解放街道',
                treePath: '330000/330400/330402/330402008',

                level: 5,
              },
              {
                id: '330402015',

                label: '长水街道',
                parentId: '330402',

                children: null,

                code: '330402015',
                name: '浙江省/嘉兴市/南湖区/长水街道',
                treePath: '330000/330400/330402/330402015',

                level: 5,
              },
            ],

            code: '330402',
            name: '浙江省/嘉兴市/南湖区',
            treePath: '330000/330400/330402',

            level: 4,
          },
          {
            id: '330421',

            label: '嘉善县',
            parentId: '330400',

            children: [
              {
                id: '330421102',

                label: '大云镇',
                parentId: '330421',

                children: [
                  {
                    id: '330421102003',
                    createTime: '2022-04-26 20:20:49',

                    updateTime: '2022-04-26 20:20:49',

                    label: '东云村',
                    parentId: '330421102',

                    children: null,

                    code: '330421102003',
                    name: '浙江省/嘉兴市/嘉善县/大云镇/东云村',
                    treePath: '330000/330400/330421/330421102/330421102003',

                    level: 6,
                  },
                  {
                    id: '330421102005',
                    createTime: '2022-04-26 20:20:45',

                    updateTime: '2022-04-26 20:20:45',

                    label: '大云村',
                    parentId: '330421102',

                    children: null,

                    code: '330421102005',
                    name: '浙江省/嘉兴市/嘉善县/大云镇/大云村',
                    treePath: '330000/330400/330421/330421102/330421102005',

                    level: 6,
                  },
                  {
                    id: '330421102007',
                    createTime: '2022-04-26 20:20:46',

                    updateTime: '2022-04-26 20:20:46',

                    label: '大云社区',
                    parentId: '330421102',

                    children: null,

                    code: '330421102007',
                    name: '浙江省/嘉兴市/嘉善县/大云镇/大云社区',
                    treePath: '330000/330400/330421/330421102/330421102007',
                    longitude: '120.93493101713975',
                    latitude: '30.775439062649493',
                    level: 6,
                  },
                  {
                    id: '330421102002',
                    createTime: '2022-04-26 20:20:48',

                    updateTime: '2022-04-26 20:20:48',

                    label: '曹家村',
                    parentId: '330421102',

                    children: null,

                    code: '330421102002',
                    name: '浙江省/嘉兴市/嘉善县/大云镇/曹家村',
                    treePath: '330000/330400/330421/330421102/330421102002',

                    level: 6,
                  },
                  {
                    id: '330421102001',
                    createTime: '2022-04-26 20:20:47',

                    updateTime: '2022-04-26 20:20:47',

                    label: '江家村',
                    parentId: '330421102',

                    children: null,

                    code: '330421102001',
                    name: '浙江省/嘉兴市/嘉善县/大云镇/江家村',
                    treePath: '330000/330400/330421/330421102/330421102001',

                    level: 6,
                  },
                  {
                    id: '330421102006',
                    createTime: '2022-04-26 20:20:46',

                    updateTime: '2022-04-26 20:20:46',

                    label: '洋桥村',
                    parentId: '330421102',

                    children: null,

                    code: '330421102006',
                    name: '浙江省/嘉兴市/嘉善县/大云镇/洋桥村',
                    treePath: '330000/330400/330421/330421102/330421102006',

                    level: 6,
                  },
                  {
                    id: '330421102004',
                    createTime: '2022-04-26 20:20:44',

                    updateTime: '2022-04-26 20:20:44',

                    label: '缪家村',
                    parentId: '330421102',

                    children: null,

                    code: '330421102004',
                    name: '浙江省/嘉兴市/嘉善县/大云镇/缪家村',
                    treePath: '330000/330400/330421/330421102/330421102004',

                    level: 6,
                  },
                ],

                code: '330421102',
                name: '浙江省/嘉兴市/嘉善县/大云镇',
                treePath: '330000/330400/330421/330421102',

                level: 5,
              },
              {
                id: '330421111',

                label: '天凝镇',
                parentId: '330421',

                children: [
                  {
                    id: '330421111011',
                    createTime: '2022-04-26 20:20:08',

                    updateTime: '2022-04-26 20:20:08',

                    label: '三发村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111011',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/三发村',
                    treePath: '330000/330400/330421/330421111/330421111011',

                    level: 6,
                  },
                  {
                    id: '330421111005',
                    createTime: '2022-04-26 20:19:46',

                    updateTime: '2022-04-26 20:19:46',

                    label: '三店村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111005',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/三店村',
                    treePath: '330000/330400/330421/330421111/330421111005',

                    level: 6,
                  },
                  {
                    id: '330421111002',
                    createTime: '2022-04-26 20:19:46',

                    updateTime: '2022-04-26 20:19:46',

                    label: '东方红村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111002',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/东方红村',
                    treePath: '330000/330400/330421/330421111/330421111002',

                    level: 6,
                  },
                  {
                    id: '330421111006',
                    createTime: '2022-04-26 20:19:47',

                    updateTime: '2022-04-26 20:19:47',

                    label: '东顺村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111006',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/东顺村',
                    treePath: '330000/330400/330421/330421111/330421111006',

                    level: 6,
                  },
                  {
                    id: '330421111008',
                    createTime: '2022-04-26 20:19:54',
                    updateTime: '2022-04-26 20:19:54',
                    label: '光明村',
                    parentId: '330421111',
                    children: null,
                    code: '330421111008',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/光明村',
                    treePath: '330000/330400/330421/330421111/330421111008',
                    level: 6,
                  },
                  {
                    id: '330421111012',
                    createTime: '2022-04-26 20:20:06',
                    updateTime: '2022-04-26 20:20:06',
                    label: '凝北村',
                    parentId: '330421111',
                    children: null,
                    code: '330421111012',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/凝北村',
                    treePath: '330000/330400/330421/330421111/330421111012',
                    level: 6,
                  },
                  {
                    id: '330421111016',
                    createTime: '2022-04-26 20:20:09',

                    updateTime: '2022-04-26 20:20:09',

                    label: '凝南村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111016',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/凝南村',
                    treePath: '330000/330400/330421/330421111/330421111016',

                    level: 6,
                  },
                  {
                    id: '330421111009',
                    createTime: '2022-04-26 20:19:51',

                    updateTime: '2022-04-26 20:19:51',

                    label: '南星村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111009',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/南星村',
                    treePath: '330000/330400/330421/330421111/330421111009',

                    level: 6,
                  },
                  {
                    id: '330421111014',
                    createTime: '2022-04-26 20:20:11',

                    updateTime: '2022-04-26 20:20:11',

                    label: '天凝村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111014',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/天凝村',
                    treePath: '330000/330400/330421/330421111/330421111014',

                    level: 6,
                  },
                  {
                    id: '330421111020',
                    createTime: '2022-04-26 20:20:05',

                    updateTime: '2022-04-26 20:20:05',

                    label: '天凝社区',
                    parentId: '330421111',

                    children: null,

                    code: '330421111020',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/天凝社区',
                    treePath: '330000/330400/330421/330421111/330421111020',
                    longitude: '120.78970750672067',
                    latitude: '30.890543547102105',
                    level: 6,
                  },
                  {
                    id: '330421111004',
                    createTime: '2022-04-26 20:19:49',

                    updateTime: '2022-04-26 20:19:49',

                    label: '宏杨村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111004',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/宏杨村',
                    treePath: '330000/330400/330421/330421111/330421111004',

                    level: 6,
                  },
                  {
                    id: '330421111001',
                    createTime: '2022-04-26 20:19:45',

                    updateTime: '2022-04-26 20:19:45',

                    label: '戴西港村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111001',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/戴西港村',
                    treePath: '330000/330400/330421/330421111/330421111001',

                    level: 6,
                  },
                  {
                    id: '330421111025',
                    createTime: '2022-04-26 20:20:25',

                    updateTime: '2022-04-26 20:20:25',

                    label: '新联村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111025',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/新联村',
                    treePath: '330000/330400/330421/330421111/330421111025',

                    level: 6,
                  },
                  {
                    id: '330421111024',
                    createTime: '2022-04-26 20:20:23',

                    updateTime: '2022-04-26 20:20:23',

                    label: '杨庙社区',
                    parentId: '330421111',

                    children: null,

                    code: '330421111024',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/杨庙社区',
                    treePath: '330000/330400/330421/330421111/330421111024',
                    longitude: '120.81534496195482',
                    latitude: '30.844352437600158',
                    level: 6,
                  },
                  {
                    id: '330421111023',
                    createTime: '2022-04-26 20:20:22',

                    updateTime: '2022-04-26 20:20:22',

                    label: '欣杨村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111023',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/欣杨村',
                    treePath: '330000/330400/330421/330421111/330421111023',

                    level: 6,
                  },
                  {
                    id: '330421111015',
                    createTime: '2022-04-26 20:20:12',

                    updateTime: '2022-04-26 20:20:12',

                    label: '洪南村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111015',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/洪南村',
                    treePath: '330000/330400/330421/330421111/330421111015',

                    level: 6,
                  },
                  {
                    id: '330421111003',
                    createTime: '2022-04-26 20:19:48',

                    updateTime: '2022-04-26 20:19:48',

                    label: '洪溪村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111003',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/洪溪村',
                    treePath: '330000/330400/330421/330421111/330421111003',

                    level: 6,
                  },
                  {
                    id: '330421111010',
                    createTime: '2022-04-26 20:20:07',

                    updateTime: '2022-04-26 20:20:07',

                    label: '洪溪社区',
                    parentId: '330421111',

                    children: null,

                    code: '330421111010',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/洪溪社区',
                    treePath: '330000/330400/330421/330421111/330421111010',
                    longitude: '120.82725036225439',
                    latitude: '30.905528428177934',
                    level: 6,
                  },
                  {
                    id: '330421111019',
                    createTime: '2022-04-26 20:20:13',

                    updateTime: '2022-04-26 20:20:13',

                    label: '洪福村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111019',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/洪福村',
                    treePath: '330000/330400/330421/330421111/330421111019',

                    level: 6,
                  },
                  {
                    id: '330421111021',
                    createTime: '2022-04-26 20:20:24',

                    updateTime: '2022-04-26 20:20:24',

                    label: '翁村村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111021',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/翁村村',
                    treePath: '330000/330400/330421/330421111/330421111021',

                    level: 6,
                  },
                  {
                    id: '330421111018',
                    createTime: '2022-04-26 20:20:13',

                    updateTime: '2022-04-26 20:20:13',

                    label: '联谊村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111018',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/联谊村',
                    treePath: '330000/330400/330421/330421111/330421111018',

                    level: 6,
                  },
                  {
                    id: '330421111017',
                    createTime: '2022-04-26 20:20:10',

                    updateTime: '2022-04-26 20:20:10',

                    label: '蒋村村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111017',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/蒋村村',
                    treePath: '330000/330400/330421/330421111/330421111017',

                    level: 6,
                  },
                  {
                    id: '330421111022',
                    createTime: '2022-04-26 20:20:24',

                    updateTime: '2022-04-26 20:20:24',

                    label: '镇东村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111022',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/镇东村',
                    treePath: '330000/330400/330421/330421111/330421111022',

                    level: 6,
                  },
                  {
                    id: '330421111007',
                    createTime: '2022-04-26 20:19:52',

                    updateTime: '2022-04-26 20:19:52',

                    label: '马塔塘村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111007',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/马塔塘村',
                    treePath: '330000/330400/330421/330421111/330421111007',

                    level: 6,
                  },
                  {
                    id: '330421111013',
                    createTime: '2022-04-26 20:20:07',

                    updateTime: '2022-04-26 20:20:07',

                    label: '麟溪村',
                    parentId: '330421111',

                    children: null,

                    code: '330421111013',
                    name: '浙江省/嘉兴市/嘉善县/天凝镇/麟溪村',
                    treePath: '330000/330400/330421/330421111/330421111013',

                    level: 6,
                  },
                ],

                code: '330421111',
                name: '浙江省/嘉兴市/嘉善县/天凝镇',
                treePath: '330000/330400/330421/330421111',

                level: 5,
              },
              {
                id: '330421112',

                label: '姚庄镇',
                parentId: '330421',

                children: [
                  {
                    id: '330421112008',
                    createTime: '2022-04-26 20:21:17',

                    updateTime: '2022-04-26 20:21:17',

                    label: '丁栅村',
                    parentId: '330421112',

                    children: null,

                    code: '330421112008',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/丁栅村',
                    treePath: '330000/330400/330421/330421112/330421112008',

                    level: 6,
                  },
                  {
                    id: '330421112011',
                    createTime: '2022-04-26 20:19:05',

                    updateTime: '2022-04-26 20:19:05',

                    label: '丁栅社区',
                    parentId: '330421112',

                    children: null,

                    code: '330421112011',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/丁栅社区',
                    treePath: '330000/330400/330421/330421112/330421112011',
                    longitude: '120.93416939601052',
                    latitude: '30.991367685210005',
                    level: 6,
                  },
                  {
                    id: '330421112021',
                    createTime: '2022-04-26 20:19:29',

                    updateTime: '2022-04-26 20:19:29',

                    label: '中联村',
                    parentId: '330421112',

                    children: null,

                    code: '330421112021',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/中联村',
                    treePath: '330000/330400/330421/330421112/330421112021',

                    level: 6,
                  },
                  {
                    id: '330421112015',
                    createTime: '2022-04-26 20:19:08',

                    updateTime: '2022-04-26 20:19:08',

                    label: '俞北村',
                    parentId: '330421112',

                    children: null,

                    code: '330421112015',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/俞北村',
                    treePath: '330000/330400/330421/330421112/330421112015',

                    level: 6,
                  },
                  {
                    id: '330421112016',
                    createTime: '2022-04-26 20:19:09',

                    updateTime: '2022-04-26 20:19:09',

                    label: '俞汇村',
                    parentId: '330421112',

                    children: null,

                    code: '330421112016',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/俞汇村',
                    treePath: '330000/330400/330421/330421112/330421112016',

                    level: 6,
                  },
                  {
                    id: '330421112020',
                    createTime: '2022-04-26 20:19:28',

                    updateTime: '2022-04-26 20:19:28',

                    label: '俞汇社区',
                    parentId: '330421112',

                    children: null,

                    code: '330421112020',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/俞汇社区',
                    treePath: '330000/330400/330421/330421112/330421112020',
                    longitude: '120.96206047066423',
                    latitude: '30.97504497285104',
                    level: 6,
                  },
                  {
                    id: '330421112001',
                    createTime: '2022-04-26 20:21:08',

                    updateTime: '2022-04-26 20:21:08',

                    label: '北港村',
                    parentId: '330421112',

                    children: null,

                    code: '330421112001',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/北港村',
                    treePath: '330000/330400/330421/330421112/330421112001',

                    level: 6,
                  },
                  {
                    id: '330421112012',
                    createTime: '2022-04-26 20:19:06',

                    updateTime: '2022-04-26 20:19:06',

                    label: '北鹤村',
                    parentId: '330421112',

                    children: null,

                    code: '330421112012',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/北鹤村',
                    treePath: '330000/330400/330421/330421112/330421112012',

                    level: 6,
                  },
                  {
                    id: '330421112006',
                    createTime: '2022-04-26 20:21:19',

                    updateTime: '2022-04-26 20:21:19',

                    label: '南鹿村',
                    parentId: '330421112',

                    children: null,

                    code: '330421112006',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/南鹿村',
                    treePath: '330000/330400/330421/330421112/330421112006',

                    level: 6,
                  },
                  {
                    id: '330421112009',
                    createTime: '2022-04-26 20:21:17',

                    updateTime: '2022-04-26 20:21:17',

                    label: '姚庄村',
                    parentId: '330421112',

                    children: null,

                    code: '330421112009',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/姚庄村',
                    treePath: '330000/330400/330421/330421112/330421112009',

                    level: 6,
                  },
                  {
                    id: '330421112013',
                    createTime: '2022-04-26 20:19:09',

                    updateTime: '2022-04-26 20:19:09',

                    label: '姚庄社区',
                    parentId: '330421112',

                    children: null,

                    code: '330421112013',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/姚庄社区',
                    treePath: '330000/330400/330421/330421112/330421112013',
                    longitude: '120.94415958695872',
                    latitude: '30.91244196628559',
                    level: 6,
                  },
                  {
                    id: '330421112017',
                    createTime: '2022-04-26 20:19:12',

                    updateTime: '2022-04-26 20:19:12',

                    label: '展丰村',
                    parentId: '330421112',

                    children: null,

                    code: '330421112017',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/展丰村',
                    treePath: '330000/330400/330421/330421112/330421112017',

                    level: 6,
                  },
                  {
                    id: '330421112018',
                    createTime: '2022-04-26 20:19:13',

                    updateTime: '2022-04-26 20:19:13',

                    label: '展幸村',
                    parentId: '330421112',

                    children: null,

                    code: '330421112018',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/展幸村',
                    treePath: '330000/330400/330421/330421112/330421112018',

                    level: 6,
                  },
                  {
                    id: '330421112022',
                    createTime: '2022-04-26 20:19:27',

                    updateTime: '2022-04-26 20:19:27',

                    label: '桃源新邨',
                    parentId: '330421112',

                    children: null,

                    code: '330421112022',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/桃源新邨',
                    treePath: '330000/330400/330421/330421112/330421112022',

                    level: 6,
                  },
                  {
                    id: '330421112010',
                    createTime: '2022-04-26 20:19:07',

                    updateTime: '2022-04-26 20:19:07',

                    label: '横港村',
                    parentId: '330421112',

                    children: null,

                    code: '330421112010',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/横港村',
                    treePath: '330000/330400/330421/330421112/330421112010',

                    level: 6,
                  },
                  {
                    id: '330421112004',
                    createTime: '2022-04-26 20:21:11',

                    updateTime: '2022-04-26 20:21:11',

                    label: '武长村',
                    parentId: '330421112',

                    children: null,

                    code: '330421112004',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/武长村',
                    treePath: '330000/330400/330421/330421112/330421112004',

                    level: 6,
                  },
                  {
                    id: '330421112007',
                    createTime: '2022-04-26 20:21:21',

                    updateTime: '2022-04-26 20:21:21',

                    label: '沉香村',
                    parentId: '330421112',

                    children: null,

                    code: '330421112007',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/沉香村',
                    treePath: '330000/330400/330421/330421112/330421112007',

                    level: 6,
                  },
                  {
                    id: '330421112002',
                    createTime: '2022-04-26 20:21:14',

                    updateTime: '2022-04-26 20:21:14',

                    label: '清凉村',
                    parentId: '330421112',

                    children: null,

                    code: '330421112002',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/清凉村',
                    treePath: '330000/330400/330421/330421112/330421112002',

                    level: 6,
                  },
                  {
                    id: '330421112019',
                    createTime: '2022-04-26 20:19:11',

                    updateTime: '2022-04-26 20:19:11',

                    label: '渔民村',
                    parentId: '330421112',

                    children: null,

                    code: '330421112019',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/渔民村',
                    treePath: '330000/330400/330421/330421112/330421112019',

                    level: 6,
                  },
                  {
                    id: '330421112005',
                    createTime: '2022-04-26 20:21:13',

                    updateTime: '2022-04-26 20:21:13',

                    label: '界泾港村',
                    parentId: '330421112',

                    children: null,

                    code: '330421112005',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/界泾港村',
                    treePath: '330000/330400/330421/330421112/330421112005',

                    level: 6,
                  },
                  {
                    id: '330421112003',
                    createTime: '2022-04-26 20:21:15',

                    updateTime: '2022-04-26 20:21:15',

                    label: '金星村',
                    parentId: '330421112',

                    children: null,

                    code: '330421112003',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/金星村',
                    treePath: '330000/330400/330421/330421112/330421112003',

                    level: 6,
                  },
                  {
                    id: '330421112014',
                    createTime: '2022-04-26 20:19:10',

                    updateTime: '2022-04-26 20:19:10',

                    label: '银水庙村',
                    parentId: '330421112',

                    children: null,

                    code: '330421112014',
                    name: '浙江省/嘉兴市/嘉善县/姚庄镇/银水庙村',
                    treePath: '330000/330400/330421/330421112/330421112014',

                    level: 6,
                  },
                ],

                code: '330421112',
                name: '浙江省/嘉兴市/嘉善县/姚庄镇',
                treePath: '330000/330400/330421/330421112',

                level: 5,
              },
              {
                id: '330421105',

                label: '干窑镇',
                parentId: '330421',

                children: [
                  {
                    id: '330421105001',
                    createTime: '2022-04-26 20:20:57',

                    updateTime: '2022-04-26 20:20:57',

                    label: '南宙村',
                    parentId: '330421105',

                    children: null,

                    code: '330421105001',
                    name: '浙江省/嘉兴市/嘉善县/干窑镇/南宙村',
                    treePath: '330000/330400/330421/330421105/330421105001',

                    level: 6,
                  },
                  {
                    id: '330421105010',
                    createTime: '2022-04-26 20:21:18',

                    updateTime: '2022-04-26 20:21:18',

                    label: '干窑村',
                    parentId: '330421105',

                    children: null,

                    code: '330421105010',
                    name: '浙江省/嘉兴市/嘉善县/干窑镇/干窑村',
                    treePath: '330000/330400/330421/330421105/330421105010',

                    level: 6,
                  },
                  {
                    id: '330421105004',
                    createTime: '2022-04-26 20:21:05',

                    updateTime: '2022-04-26 20:21:05',

                    label: '干窑社区',
                    parentId: '330421105',

                    children: null,

                    code: '330421105004',
                    name: '浙江省/嘉兴市/嘉善县/干窑镇/干窑社区',
                    treePath: '330000/330400/330421/330421105/330421105004',
                    longitude: '120.87769098081581',
                    latitude: '30.88408268439974',
                    level: 6,
                  },
                  {
                    id: '330421105008',
                    createTime: '2022-04-26 20:21:02',

                    updateTime: '2022-04-26 20:21:02',

                    label: '幸福社区',
                    parentId: '330421105',

                    children: null,

                    code: '330421105008',
                    name: '浙江省/嘉兴市/嘉善县/干窑镇/幸福社区',
                    treePath: '330000/330400/330421/330421105/330421105008',

                    level: 6,
                  },
                  {
                    id: '330421105011',
                    createTime: '2022-04-26 20:21:20',

                    updateTime: '2022-04-26 20:21:20',

                    label: '新星村',
                    parentId: '330421105',

                    children: null,

                    code: '330421105011',
                    name: '浙江省/嘉兴市/嘉善县/干窑镇/新星村',
                    treePath: '330000/330400/330421/330421105/330421105011',

                    level: 6,
                  },
                  {
                    id: '330421105006',
                    createTime: '2022-04-26 20:21:03',

                    updateTime: '2022-04-26 20:21:03',

                    label: '月半湾社区',
                    parentId: '330421105',

                    children: null,

                    code: '330421105006',
                    name: '浙江省/嘉兴市/嘉善县/干窑镇/月半湾社区',
                    treePath: '330000/330400/330421/330421105/330421105006',
                    longitude: '120.8675778308278',
                    latitude: '30.87845173657004',
                    level: 6,
                  },
                  {
                    id: '330421105002',
                    createTime: '2022-04-26 20:20:59',

                    updateTime: '2022-04-26 20:20:59',

                    label: '胡家埭村',
                    parentId: '330421105',

                    children: null,

                    code: '330421105002',
                    name: '浙江省/嘉兴市/嘉善县/干窑镇/胡家埭村',
                    treePath: '330000/330400/330421/330421105/330421105002',

                    level: 6,
                  },
                  {
                    id: '330421105005',
                    createTime: '2022-04-26 20:21:03',

                    updateTime: '2022-04-26 20:21:03',

                    label: '范东村',
                    parentId: '330421105',

                    children: null,

                    code: '330421105005',
                    name: '浙江省/嘉兴市/嘉善县/干窑镇/范东村',
                    treePath: '330000/330400/330421/330421105/330421105005',

                    level: 6,
                  },
                  {
                    id: '330421105012',
                    createTime: '2022-04-26 20:21:16',

                    updateTime: '2022-04-26 20:21:16',

                    label: '范泾村',
                    parentId: '330421105',

                    children: null,

                    code: '330421105012',
                    name: '浙江省/嘉兴市/嘉善县/干窑镇/范泾村',
                    treePath: '330000/330400/330421/330421105/330421105012',

                    level: 6,
                  },
                  {
                    id: '330421105007',
                    createTime: '2022-04-26 20:21:01',

                    updateTime: '2022-04-26 20:21:01',

                    label: '长丰村',
                    parentId: '330421105',

                    children: null,

                    code: '330421105007',
                    name: '浙江省/嘉兴市/嘉善县/干窑镇/长丰村',
                    treePath: '330000/330400/330421/330421105/330421105007',

                    level: 6,
                  },
                  {
                    id: '330421105009',
                    createTime: '2022-04-26 20:21:00',

                    updateTime: '2022-04-26 20:21:00',

                    label: '长生村',
                    parentId: '330421105',

                    children: null,

                    code: '330421105009',
                    name: '浙江省/嘉兴市/嘉善县/干窑镇/长生村',
                    treePath: '330000/330400/330421/330421105/330421105009',

                    level: 6,
                  },
                  {
                    id: '330421105003',
                    createTime: '2022-04-26 20:21:04',

                    updateTime: '2022-04-26 20:21:04',

                    label: '黎明村',
                    parentId: '330421105',

                    children: null,

                    code: '330421105003',
                    name: '浙江省/嘉兴市/嘉善县/干窑镇/黎明村',
                    treePath: '330000/330400/330421/330421105/330421105003',

                    level: 6,
                  },
                ],

                code: '330421105',
                name: '浙江省/嘉兴市/嘉善县/干窑镇',
                treePath: '330000/330400/330421/330421105',

                level: 5,
              },
              {
                id: '330421003',

                label: '惠民街道',
                parentId: '330421',

                children: [
                  {
                    id: '330421003009',
                    createTime: '2022-04-26 20:20:58',

                    updateTime: '2022-04-26 20:20:58',

                    label: '优家村',
                    parentId: '330421003',

                    children: null,

                    code: '330421003009',
                    name: '浙江省/嘉兴市/嘉善县/惠民街道/优家村',
                    treePath: '330000/330400/330421/330421003/330421003009',

                    level: 6,
                  },
                  {
                    id: '330421003008',
                    createTime: '2022-04-26 20:20:57',

                    updateTime: '2022-04-26 20:20:57',

                    label: '嘉湖社区',
                    parentId: '330421003',

                    children: null,

                    code: '330421003008',
                    name: '浙江省/嘉兴市/嘉善县/惠民街道/嘉湖社区',
                    treePath: '330000/330400/330421/330421003/330421003008',
                    longitude: '120.93613856893555',
                    latitude: '30.817676081837437',
                    level: 6,
                  },
                  {
                    id: '330421003006',
                    createTime: '2022-04-26 20:20:55',

                    updateTime: '2022-04-26 20:20:55',

                    label: '大泖村',
                    parentId: '330421003',

                    children: null,

                    code: '330421003006',
                    name: '浙江省/嘉兴市/嘉善县/惠民街道/大泖村',
                    treePath: '330000/330400/330421/330421003/330421003006',

                    level: 6,
                  },
                  {
                    id: '330421003012',
                    createTime: '2022-04-26 20:21:07',

                    updateTime: '2022-04-26 20:21:07',

                    label: '大通村',
                    parentId: '330421003',

                    children: null,

                    code: '330421003012',
                    name: '浙江省/嘉兴市/嘉善县/惠民街道/大通村',
                    treePath: '330000/330400/330421/330421003/330421003012',

                    level: 6,
                  },
                  {
                    id: '330421003015',
                    createTime: '2022-04-26 20:21:10',

                    updateTime: '2022-04-26 20:21:10',

                    label: '张汇社区',
                    parentId: '330421003',

                    children: null,

                    code: '330421003015',
                    name: '浙江省/嘉兴市/嘉善县/惠民街道/张汇社区',
                    treePath: '330000/330400/330421/330421003/330421003015',
                    longitude: '120.96393343742814',
                    latitude: '30.83113846640881',
                    level: 6,
                  },
                  {
                    id: '330421003003',
                    createTime: '2022-04-26 20:20:52',

                    updateTime: '2022-04-26 20:20:52',

                    label: '张泾汇社区',
                    parentId: '330421003',

                    children: null,

                    code: '330421003003',
                    name: '浙江省/嘉兴市/嘉善县/惠民街道/张泾汇社区',
                    treePath: '330000/330400/330421/330421003/330421003003',
                    longitude: '120.96069796757823',
                    latitude: '30.834951090451334',
                    level: 6,
                  },
                  {
                    id: '330421003001',
                    createTime: '2022-04-26 20:20:51',

                    updateTime: '2022-04-26 20:20:51',

                    label: '惠丰社区',
                    parentId: '330421003',

                    children: null,

                    code: '330421003001',
                    name: '浙江省/嘉兴市/嘉善县/惠民街道/惠丰社区',
                    treePath: '330000/330400/330421/330421003/330421003001',
                    longitude: '120.93363453030793',
                    latitude: '30.834675274118858',
                    level: 6,
                  },
                  {
                    id: '330421003002',
                    createTime: '2022-04-26 20:20:51',

                    updateTime: '2022-04-26 20:20:51',

                    label: '惠园社区',
                    parentId: '330421003',

                    children: null,

                    code: '330421003002',
                    name: '浙江省/嘉兴市/嘉善县/惠民街道/惠园社区',
                    treePath: '330000/330400/330421/330421003/330421003002',
                    longitude: '120.95965672160015',
                    latitude: '30.8389386048778',
                    level: 6,
                  },
                  {
                    id: '330421003014',
                    createTime: '2022-04-26 20:21:09',

                    updateTime: '2022-04-26 20:21:09',

                    label: '惠通村',
                    parentId: '330421003',

                    children: null,

                    code: '330421003014',
                    name: '浙江省/嘉兴市/嘉善县/惠民街道/惠通村',
                    treePath: '330000/330400/330421/330421003/330421003014',

                    level: 6,
                  },
                  {
                    id: '330421003011',
                    createTime: '2022-04-26 20:21:06',

                    updateTime: '2022-04-26 20:21:06',

                    label: '新润村',
                    parentId: '330421003',

                    children: null,

                    code: '330421003011',
                    name: '浙江省/嘉兴市/嘉善县/惠民街道/新润村',
                    treePath: '330000/330400/330421/330421003/330421003011',

                    level: 6,
                  },
                  {
                    id: '330421003013',
                    createTime: '2022-04-26 20:21:09',

                    updateTime: '2022-04-26 20:21:09',

                    label: '曙光村',
                    parentId: '330421003',

                    children: null,

                    code: '330421003013',
                    name: '浙江省/嘉兴市/嘉善县/惠民街道/曙光村',
                    treePath: '330000/330400/330421/330421003/330421003013',

                    level: 6,
                  },
                  {
                    id: '330421003016',
                    createTime: '2022-04-26 20:21:12',

                    updateTime: '2022-04-26 20:21:12',

                    label: '枫南村',
                    parentId: '330421003',

                    children: null,

                    code: '330421003016',
                    name: '浙江省/嘉兴市/嘉善县/惠民街道/枫南村',
                    treePath: '330000/330400/330421/330421003/330421003016',

                    level: 6,
                  },
                  {
                    id: '330421003010',
                    createTime: '2022-04-26 20:20:50',

                    updateTime: '2022-04-26 20:20:50',

                    label: '横泾桥社区',
                    parentId: '330421003',

                    children: null,

                    code: '330421003010',
                    name: '浙江省/嘉兴市/嘉善县/惠民街道/横泾桥社区',
                    treePath: '330000/330400/330421/330421003/330421003010',
                    longitude: '120.94558317997613',
                    latitude: '30.833222162140004',
                    level: 6,
                  },
                  {
                    id: '330421003004',
                    createTime: '2022-04-26 20:20:53',

                    updateTime: '2022-04-26 20:20:53',

                    label: '毛家社区',
                    parentId: '330421003',

                    children: null,

                    code: '330421003004',
                    name: '浙江省/嘉兴市/嘉善县/惠民街道/毛家社区',
                    treePath: '330000/330400/330421/330421003/330421003004',
                    longitude: '120.95970032251229',
                    latitude: '30.86627556897189',
                    level: 6,
                  },
                  {
                    id: '330421003005',
                    createTime: '2022-04-26 20:20:54',

                    updateTime: '2022-04-26 20:20:54',

                    label: '金嘉社区',
                    parentId: '330421003',

                    children: null,

                    code: '330421003005',
                    name: '浙江省/嘉兴市/嘉善县/惠民街道/金嘉社区',
                    treePath: '330000/330400/330421/330421003/330421003005',
                    longitude: '120.91825230468551',
                    latitude: '30.862505116588842',
                    level: 6,
                  },
                  {
                    id: '330421003007',
                    createTime: '2022-04-26 20:20:56',

                    updateTime: '2022-04-26 20:20:56',

                    label: '阳光社区',
                    parentId: '330421003',

                    children: null,

                    code: '330421003007',
                    name: '浙江省/嘉兴市/嘉善县/惠民街道/阳光社区',
                    treePath: '330000/330400/330421/330421003/330421003007',
                    longitude: '120.95152458351431',
                    latitude: '30.84377357137588',
                    level: 6,
                  },
                ],

                code: '330421003',
                name: '浙江省/嘉兴市/嘉善县/惠民街道',
                treePath: '330000/330400/330421/330421003',

                level: 5,
              },
              {
                id: '330421001',

                label: '罗星街道',
                parentId: '330421',

                children: [
                  {
                    id: '330421001019',
                    createTime: '2022-04-26 20:18:55',

                    updateTime: '2022-04-26 20:18:55',

                    label: '亭桥村',
                    parentId: '330421001',

                    children: null,

                    code: '330421001019',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/亭桥村',
                    treePath: '330000/330400/330421/330421001/330421001019',

                    level: 6,
                  },
                  {
                    id: '330421001011',
                    createTime: '2022-04-26 20:19:02',

                    updateTime: '2022-04-26 20:19:02',

                    label: '南门社区',
                    parentId: '330421001',

                    children: null,

                    code: '330421001011',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/南门社区',
                    treePath: '330000/330400/330421/330421001/330421001011',
                    longitude: '120.90463754811796',
                    latitude: '30.830563392907614',
                    level: 6,
                  },
                  {
                    id: '330421001016',
                    createTime: '2022-04-26 20:18:58',

                    updateTime: '2022-04-26 20:18:58',

                    label: '厍浜村',
                    parentId: '330421001',

                    children: null,

                    code: '330421001016',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/厍浜村',
                    treePath: '330000/330400/330421/330421001/330421001016',

                    level: 6,
                  },
                  {
                    id: '330421001007',
                    createTime: '2022-04-26 20:19:59',

                    updateTime: '2022-04-26 20:19:59',

                    label: '和合社区',
                    parentId: '330421001',

                    children: null,

                    code: '330421001007',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/和合社区',
                    treePath: '330000/330400/330421/330421001/330421001007',
                    longitude: '120.88983081595276',
                    latitude: '30.826270911854515',
                    level: 6,
                  },
                  {
                    id: '330421001006',
                    createTime: '2022-04-26 20:19:59',

                    updateTime: '2022-04-26 20:19:59',

                    label: '城南社区',
                    parentId: '330421001',

                    children: null,

                    code: '330421001006',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/城南社区',
                    treePath: '330000/330400/330421/330421001/330421001006',
                    longitude: '120.90794599707988',
                    latitude: '30.834803094646098',
                    level: 6,
                  },
                  {
                    id: '330421001008',
                    createTime: '2022-04-26 20:19:58',

                    updateTime: '2022-04-26 20:19:58',

                    label: '城西社区',
                    parentId: '330421001',

                    children: null,

                    code: '330421001008',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/城西社区',
                    treePath: '330000/330400/330421/330421001/330421001008',
                    longitude: '120.87832818157337',
                    latitude: '30.828585316899925',
                    level: 6,
                  },
                  {
                    id: '330421001021',
                    createTime: '2022-04-26 20:19:26',

                    updateTime: '2022-04-26 20:19:26',

                    label: '子胥社区',
                    parentId: '330421001',

                    children: null,

                    code: '330421001021',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/子胥社区',
                    treePath: '330000/330400/330421/330421001/330421001021',
                    longitude: '120.89343869071757',
                    latitude: '30.830992694620914',
                    level: 6,
                  },
                  {
                    id: '330421001001',
                    createTime: '2022-04-26 20:20:04',

                    updateTime: '2022-04-26 20:20:04',

                    label: '新洲社区',
                    parentId: '330421001',

                    children: null,

                    code: '330421001001',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/新洲社区',
                    treePath: '330000/330400/330421/330421001/330421001001',

                    level: 6,
                  },
                  {
                    id: '330421001017',
                    createTime: '2022-04-26 20:18:57',

                    updateTime: '2022-04-26 20:18:57',

                    label: '新联社区',
                    parentId: '330421001',

                    children: null,

                    code: '330421001017',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/新联社区',
                    treePath: '330000/330400/330421/330421001/330421001017',
                    longitude: '120.91986108974241',
                    latitude: '30.81680517021706',
                    level: 6,
                  },
                  {
                    id: '330421001005',
                    createTime: '2022-04-26 20:20:00',

                    updateTime: '2022-04-26 20:20:00',

                    label: '星河社区',
                    parentId: '330421001',

                    children: null,

                    code: '330421001005',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/星河社区',
                    treePath: '330000/330400/330421/330421001/330421001005',
                    longitude: '120.8944978816045',
                    latitude: '30.807668670118737',
                    level: 6,
                  },
                  {
                    id: '330421001004',
                    createTime: '2022-04-26 20:20:01',

                    updateTime: '2022-04-26 20:20:01',

                    label: '星辰社区',
                    parentId: '330421001',

                    children: null,

                    code: '330421001004',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/星辰社区',
                    treePath: '330000/330400/330421/330421001/330421001004',
                    longitude: '120.8840852555078',
                    latitude: '30.810088975541138',
                    level: 6,
                  },
                  {
                    id: '330421001010',
                    createTime: '2022-04-26 20:19:03',

                    updateTime: '2022-04-26 20:19:03',

                    label: '晋阳社区',
                    parentId: '330421001',

                    children: null,

                    code: '330421001010',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/晋阳社区',
                    treePath: '330000/330400/330421/330421001/330421001010',
                    longitude: '120.90949911590562',
                    latitude: '30.83575056971132',
                    level: 6,
                  },
                  {
                    id: '330421001013',
                    createTime: '2022-04-26 20:19:00',

                    updateTime: '2022-04-26 20:19:00',

                    label: '李家社区',
                    parentId: '330421001',

                    children: null,

                    code: '330421001013',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/李家社区',
                    treePath: '330000/330400/330421/330421001/330421001013',
                    longitude: '120.92490755343165',
                    latitude: '30.83229133682025',
                    level: 6,
                  },
                  {
                    id: '330421001014',
                    createTime: '2022-04-26 20:19:00',

                    updateTime: '2022-04-26 20:19:00',

                    label: '柳洲社区',
                    parentId: '330421001',

                    children: null,

                    code: '330421001014',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/柳洲社区',
                    treePath: '330000/330400/330421/330421001/330421001014',
                    longitude: '120.9198589711664',
                    latitude: '30.83103180261733',
                    level: 6,
                  },
                  {
                    id: '330421001009',
                    createTime: '2022-04-26 20:19:56',

                    updateTime: '2022-04-26 20:19:56',

                    label: '江南社区',
                    parentId: '330421001',

                    children: null,

                    code: '330421001009',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/江南社区',
                    treePath: '330000/330400/330421/330421001/330421001009',
                    longitude: '120.8976776118326',
                    latitude: '30.815838600412256',
                    level: 6,
                  },
                  {
                    id: '330421001022',
                    createTime: '2022-04-26 20:19:24',

                    updateTime: '2022-04-26 20:19:24',

                    label: '泗洲社区',
                    parentId: '330421001',

                    children: null,

                    code: '330421001022',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/泗洲社区',
                    treePath: '330000/330400/330421/330421001/330421001022',

                    level: 6,
                  },
                  {
                    id: '330421001023',
                    createTime: '2022-04-26 20:19:22',

                    updateTime: '2022-04-26 20:19:22',

                    label: '玉兰社区',
                    parentId: '330421001',

                    children: null,

                    code: '330421001023',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/玉兰社区',
                    treePath: '330000/330400/330421/330421001/330421001023',
                    longitude: '120.91748857485419',
                    latitude: '30.836651314811565',
                    level: 6,
                  },
                  {
                    id: '330421001003',
                    createTime: '2022-04-26 20:20:02',

                    updateTime: '2022-04-26 20:20:02',

                    label: '瓶山社区',
                    parentId: '330421001',

                    children: null,

                    code: '330421001003',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/瓶山社区',
                    treePath: '330000/330400/330421/330421001/330421001003',
                    longitude: '120.90318886110073',
                    latitude: '30.83558240174448',
                    level: 6,
                  },
                  {
                    id: '330421001002',
                    createTime: '2022-04-26 20:20:03',

                    updateTime: '2022-04-26 20:20:03',

                    label: '绿洲社区',
                    parentId: '330421001',

                    children: null,

                    code: '330421001002',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/绿洲社区',
                    treePath: '330000/330400/330421/330421001/330421001002',
                    longitude: '120.90569007538413',
                    latitude: '30.813489982155676',
                    level: 6,
                  },
                  {
                    id: '330421001018',
                    createTime: '2022-04-26 20:18:56',

                    updateTime: '2022-04-26 20:18:56',

                    label: '鑫锋村',
                    parentId: '330421001',

                    children: null,

                    code: '330421001018',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/鑫锋村',
                    treePath: '330000/330400/330421/330421001/330421001018',

                    level: 6,
                  },
                  {
                    id: '330421001015',
                    createTime: '2022-04-26 20:18:59',

                    updateTime: '2022-04-26 20:18:59',

                    label: '钱桥社区',
                    parentId: '330421001',

                    children: null,

                    code: '330421001015',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/钱桥社区',
                    treePath: '330000/330400/330421/330421001/330421001015',
                    longitude: '120.92231764349837',
                    latitude: '30.826548232779945',
                    level: 6,
                  },
                  {
                    id: '330421001012',
                    createTime: '2022-04-26 20:19:01',

                    updateTime: '2022-04-26 20:19:01',

                    label: '马家桥村',
                    parentId: '330421001',

                    children: null,

                    code: '330421001012',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/马家桥村',
                    treePath: '330000/330400/330421/330421001/330421001012',

                    level: 6,
                  },
                  {
                    id: '330421001020',
                    createTime: '2022-04-26 20:19:04',

                    updateTime: '2022-04-26 20:19:04',

                    label: '魏南社区',
                    parentId: '330421001',

                    children: null,

                    code: '330421001020',
                    name: '浙江省/嘉兴市/嘉善县/罗星街道/魏南社区',
                    treePath: '330000/330400/330421/330421001/330421001020',
                    longitude: '120.91524558235199',
                    latitude: '30.833519231115066',
                    level: 6,
                  },
                ],

                code: '330421001',
                name: '浙江省/嘉兴市/嘉善县/罗星街道',
                treePath: '330000/330400/330421/330421001',

                level: 5,
              },
              {
                id: '330421103',

                label: '西塘镇',
                parentId: '330421',

                children: [
                  {
                    id: '330421103001',
                    createTime: '2022-04-26 20:19:19',

                    updateTime: '2022-04-26 20:19:19',

                    label: '下甸庙村',
                    parentId: '330421103',

                    children: null,

                    code: '330421103001',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/下甸庙村',
                    treePath: '330000/330400/330421/330421103/330421103001',

                    level: 6,
                  },
                  {
                    id: '330421103012',
                    createTime: '2022-04-26 20:19:36',

                    updateTime: '2022-04-26 20:19:36',

                    label: '下甸庙社区',
                    parentId: '330421103',

                    children: null,

                    code: '330421103012',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/下甸庙社区',
                    treePath: '330000/330400/330421/330421103/330421103012',
                    longitude: '120.83571253281205',
                    latitude: '30.944434192014075',
                    level: 6,
                  },
                  {
                    id: '330421103022',
                    createTime: '2022-04-26 20:19:52',

                    updateTime: '2022-04-26 20:19:52',

                    label: '东汇村',
                    parentId: '330421103',

                    children: null,

                    code: '330421103022',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/东汇村',
                    treePath: '330000/330400/330421/330421103/330421103022',

                    level: 6,
                  },
                  {
                    id: '330421103019',
                    createTime: '2022-04-26 20:19:34',

                    updateTime: '2022-04-26 20:19:34',

                    label: '华联村',
                    parentId: '330421103',

                    children: null,

                    code: '330421103019',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/华联村',
                    treePath: '330000/330400/330421/330421103/330421103019',

                    level: 6,
                  },
                  {
                    id: '330421103020',
                    createTime: '2022-04-26 20:19:50',

                    updateTime: '2022-04-26 20:19:50',

                    label: '地甸村',
                    parentId: '330421103',

                    children: null,

                    code: '330421103020',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/地甸村',
                    treePath: '330000/330400/330421/330421103/330421103020',

                    level: 6,
                  },
                  {
                    id: '330421103010',
                    createTime: '2022-04-26 20:19:31',

                    updateTime: '2022-04-26 20:19:31',

                    label: '塘东社区',
                    parentId: '330421103',

                    children: null,

                    code: '330421103010',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/塘东社区',
                    treePath: '330000/330400/330421/330421103/330421103010',
                    longitude: '120.88951113545879',
                    latitude: '30.939892785555067',
                    level: 6,
                  },
                  {
                    id: '330421103008',
                    createTime: '2022-04-26 20:19:15',

                    updateTime: '2022-04-26 20:19:15',

                    label: '大舜村',
                    parentId: '330421103',

                    children: null,

                    code: '330421103008',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/大舜村',
                    treePath: '330000/330400/330421/330421103/330421103008',

                    level: 6,
                  },
                  {
                    id: '330421103011',
                    createTime: '2022-04-26 20:19:30',

                    updateTime: '2022-04-26 20:19:30',

                    label: '平川社区',
                    parentId: '330421103',

                    children: null,

                    code: '330421103011',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/平川社区',
                    treePath: '330000/330400/330421/330421103/330421103011',
                    longitude: '120.86880278026891',
                    latitude: '30.936009543723817',
                    level: 6,
                  },
                  {
                    id: '330421103005',
                    createTime: '2022-04-26 20:19:15',

                    updateTime: '2022-04-26 20:19:15',

                    label: '新胜村',
                    parentId: '330421103',

                    children: null,

                    code: '330421103005',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/新胜村',
                    treePath: '330000/330400/330421/330421103/330421103005',

                    level: 6,
                  },
                  {
                    id: '330421103002',
                    createTime: '2022-04-26 20:19:18',

                    updateTime: '2022-04-26 20:19:18',

                    label: '星建村',
                    parentId: '330421103',

                    children: null,

                    code: '330421103002',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/星建村',
                    treePath: '330000/330400/330421/330421103/330421103002',

                    level: 6,
                  },
                  {
                    id: '330421103006',
                    createTime: '2022-04-26 20:19:14',

                    updateTime: '2022-04-26 20:19:14',

                    label: '朝南埭社区',
                    parentId: '330421103',

                    children: null,

                    code: '330421103006',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/朝南埭社区',
                    treePath: '330000/330400/330421/330421103/330421103006',
                    longitude: '120.87847497071309',
                    latitude: '30.944818395530007',
                    level: 6,
                  },
                  {
                    id: '330421103014',
                    createTime: '2022-04-26 20:19:38',

                    updateTime: '2022-04-26 20:19:38',

                    label: '沈道村',
                    parentId: '330421103',

                    children: null,

                    code: '330421103014',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/沈道村',
                    treePath: '330000/330400/330421/330421103/330421103014',

                    level: 6,
                  },
                  {
                    id: '330421103007',
                    createTime: '2022-04-26 20:19:17',

                    updateTime: '2022-04-26 20:19:17',

                    label: '礼庙村',
                    parentId: '330421103',

                    children: null,

                    code: '330421103007',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/礼庙村',
                    treePath: '330000/330400/330421/330421103/330421103007',

                    level: 6,
                  },
                  {
                    id: '330421103024',
                    createTime: '2022-04-26 20:19:55',

                    updateTime: '2022-04-26 20:19:55',

                    label: '红菱村',
                    parentId: '330421103',

                    children: null,

                    code: '330421103024',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/红菱村',
                    treePath: '330000/330400/330421/330421103/330421103024',

                    level: 6,
                  },
                  {
                    id: '330421103016',
                    createTime: '2022-04-26 20:19:33',

                    updateTime: '2022-04-26 20:19:33',

                    label: '翠南村',
                    parentId: '330421103',

                    children: null,

                    code: '330421103016',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/翠南村',
                    treePath: '330000/330400/330421/330421103/330421103016',

                    level: 6,
                  },
                  {
                    id: '330421103017',
                    createTime: '2022-04-26 20:19:32',

                    updateTime: '2022-04-26 20:19:32',

                    label: '茜墩村',
                    parentId: '330421103',

                    children: null,

                    code: '330421103017',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/茜墩村',
                    treePath: '330000/330400/330421/330421103/330421103017',

                    level: 6,
                  },
                  {
                    id: '330421103013',
                    createTime: '2022-04-26 20:19:35',

                    updateTime: '2022-04-26 20:19:35',

                    label: '荷池村',
                    parentId: '330421103',

                    children: null,

                    code: '330421103013',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/荷池村',
                    treePath: '330000/330400/330421/330421103/330421103013',

                    level: 6,
                  },
                  {
                    id: '330421103021',
                    createTime: '2022-04-26 20:19:53',

                    updateTime: '2022-04-26 20:19:53',

                    label: '荻沼村',
                    parentId: '330421103',

                    children: null,

                    code: '330421103021',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/荻沼村',
                    treePath: '330000/330400/330421/330421103/330421103021',

                    level: 6,
                  },
                  {
                    id: '330421103004',
                    createTime: '2022-04-26 20:19:20',

                    updateTime: '2022-04-26 20:19:20',

                    label: '西园社区',
                    parentId: '330421103',

                    children: null,

                    code: '330421103004',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/西园社区',
                    treePath: '330000/330400/330421/330421103/330421103004',
                    longitude: '120.8762401902518',
                    latitude: '30.941803480313574',
                    level: 6,
                  },
                  {
                    id: '330421103003',
                    createTime: '2022-04-26 20:19:21',

                    updateTime: '2022-04-26 20:19:21',

                    label: '西街社区',
                    parentId: '330421103',

                    children: null,

                    code: '330421103003',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/西街社区',
                    treePath: '330000/330400/330421/330421103/330421103003',
                    longitude: '120.88036883337631',
                    latitude: '30.943962629907283',
                    level: 6,
                  },
                  {
                    id: '330421103015',
                    createTime: '2022-04-26 20:19:37',

                    updateTime: '2022-04-26 20:19:37',

                    label: '邗上村',
                    parentId: '330421103',

                    children: null,

                    code: '330421103015',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/邗上村',
                    treePath: '330000/330400/330421/330421103/330421103015',

                    level: 6,
                  },
                  {
                    id: '330421103018',
                    createTime: '2022-04-26 20:19:34',

                    updateTime: '2022-04-26 20:19:34',

                    label: '金明村',
                    parentId: '330421103',

                    children: null,

                    code: '330421103018',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/金明村',
                    treePath: '330000/330400/330421/330421103/330421103018',

                    level: 6,
                  },
                  {
                    id: '330421103023',
                    createTime: '2022-04-26 20:19:57',

                    updateTime: '2022-04-26 20:19:57',

                    label: '钟葫村',
                    parentId: '330421103',

                    children: null,

                    code: '330421103023',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/钟葫村',
                    treePath: '330000/330400/330421/330421103/330421103023',

                    level: 6,
                  },
                  {
                    id: '330421103009',
                    createTime: '2022-04-26 20:19:23',

                    updateTime: '2022-04-26 20:19:23',

                    label: '鸦鹊村',
                    parentId: '330421103',

                    children: null,

                    code: '330421103009',
                    name: '浙江省/嘉兴市/嘉善县/西塘镇/鸦鹊村',
                    treePath: '330000/330400/330421/330421103/330421103009',

                    level: 6,
                  },
                ],

                code: '330421103',
                name: '浙江省/嘉兴市/嘉善县/西塘镇',
                treePath: '330000/330400/330421/330421103',

                level: 5,
              },
              {
                id: '330421107',

                label: '陶庄镇',
                parentId: '330421',

                children: [
                  {
                    id: '330421107001',
                    createTime: '2022-04-26 20:20:29',

                    updateTime: '2022-04-26 20:20:29',

                    label: '养殖场',
                    parentId: '330421107',

                    children: null,

                    code: '330421107001',
                    name: '浙江省/嘉兴市/嘉善县/陶庄镇/养殖场',
                    treePath: '330000/330400/330421/330421107/330421107001',

                    level: 6,
                  },
                  {
                    id: '330421107004',
                    createTime: '2022-04-26 20:20:26',

                    updateTime: '2022-04-26 20:20:26',

                    label: '利生村',
                    parentId: '330421107',

                    children: null,

                    code: '330421107004',
                    name: '浙江省/嘉兴市/嘉善县/陶庄镇/利生村',
                    treePath: '330000/330400/330421/330421107/330421107004',

                    level: 6,
                  },
                  {
                    id: '330421107006',
                    createTime: '2022-04-26 20:20:34',

                    updateTime: '2022-04-26 20:20:34',

                    label: '汾南村',
                    parentId: '330421107',

                    children: null,

                    code: '330421107006',
                    name: '浙江省/嘉兴市/嘉善县/陶庄镇/汾南村',
                    treePath: '330000/330400/330421/330421107/330421107006',

                    level: 6,
                  },
                  {
                    id: '330421107008',
                    createTime: '2022-04-26 20:20:30',

                    updateTime: '2022-04-26 20:20:30',

                    label: '汾湖村',
                    parentId: '330421107',

                    children: null,

                    code: '330421107008',
                    name: '浙江省/嘉兴市/嘉善县/陶庄镇/汾湖村',
                    treePath: '330000/330400/330421/330421107/330421107008',

                    level: 6,
                  },
                  {
                    id: '330421107012',
                    createTime: '2022-07-27 20:20:30',

                    updateTime: '2022-07-27 20:20:30',

                    label: '汾湖社区',
                    parentId: '330421107',

                    children: null,

                    code: '330421107012',
                    name: '浙江省/嘉兴市/嘉善县/陶庄镇/汾湖社区',
                    treePath: '330000/330400/330421/330421107/330421107012',

                    level: 6,
                  },
                  {
                    id: '330421107003',
                    createTime: '2022-04-26 20:20:27',

                    updateTime: '2022-04-26 20:20:27',

                    label: '汾玉村',
                    parentId: '330421107',

                    children: null,

                    code: '330421107003',
                    name: '浙江省/嘉兴市/嘉善县/陶庄镇/汾玉村',
                    treePath: '330000/330400/330421/330421107/330421107003',

                    level: 6,
                  },
                  {
                    id: '330421107007',
                    createTime: '2022-04-26 20:20:32',

                    updateTime: '2022-04-26 20:20:32',

                    label: '湖滨村',
                    parentId: '330421107',

                    children: null,

                    code: '330421107007',
                    name: '浙江省/嘉兴市/嘉善县/陶庄镇/湖滨村',
                    treePath: '330000/330400/330421/330421107/330421107007',

                    level: 6,
                  },
                  {
                    id: '330421107002',
                    createTime: '2022-04-26 20:20:28',

                    updateTime: '2022-04-26 20:20:28',

                    label: '翔胜村',
                    parentId: '330421107',

                    children: null,

                    code: '330421107002',
                    name: '浙江省/嘉兴市/嘉善县/陶庄镇/翔胜村',
                    treePath: '330000/330400/330421/330421107/330421107002',

                    level: 6,
                  },
                  {
                    id: '330421107009',
                    createTime: '2022-04-26 20:20:30',

                    updateTime: '2022-04-26 20:20:30',

                    label: '金湖村',
                    parentId: '330421107',

                    children: null,

                    code: '330421107009',
                    name: '浙江省/嘉兴市/嘉善县/陶庄镇/金湖村',
                    treePath: '330000/330400/330421/330421107/330421107009',

                    level: 6,
                  },
                  {
                    id: '330421107011',
                    createTime: '2022-04-26 20:20:42',

                    updateTime: '2022-04-26 20:20:42',

                    label: '陶中村',
                    parentId: '330421107',

                    children: null,

                    code: '330421107011',
                    name: '浙江省/嘉兴市/嘉善县/陶庄镇/陶中村',
                    treePath: '330000/330400/330421/330421107/330421107011',

                    level: 6,
                  },
                  {
                    id: '330421107005',
                    createTime: '2022-04-26 20:20:35',

                    updateTime: '2022-04-26 20:20:35',

                    label: '陶庄村',
                    parentId: '330421107',

                    children: null,

                    code: '330421107005',
                    name: '浙江省/嘉兴市/嘉善县/陶庄镇/陶庄村',
                    treePath: '330000/330400/330421/330421107/330421107005',

                    level: 6,
                  },
                  {
                    id: '330421107010',
                    createTime: '2022-04-26 20:20:43',

                    updateTime: '2022-04-26 20:20:43',

                    label: '陶庄社区',
                    parentId: '330421107',

                    children: null,

                    code: '330421107010',
                    name: '浙江省/嘉兴市/嘉善县/陶庄镇/陶庄社区',
                    treePath: '330000/330400/330421/330421107/330421107010',
                    longitude: '120.82249061619424',
                    latitude: '30.978678147201524',
                    level: 6,
                  },
                ],

                code: '330421107',
                name: '浙江省/嘉兴市/嘉善县/陶庄镇',
                treePath: '330000/330400/330421/330421107',

                level: 5,
              },
              {
                id: '330421002',

                label: '魏塘街道',
                parentId: '330421',

                children: [
                  {
                    id: '330421002016',
                    createTime: '2022-04-26 20:20:36',

                    updateTime: '2022-04-26 20:20:36',

                    label: '三里桥村',
                    parentId: '330421002',

                    children: null,

                    code: '330421002016',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/三里桥村',
                    treePath: '330000/330400/330421/330421002/330421002016',

                    level: 6,
                  },
                  {
                    id: '330421002023',
                    createTime: '2022-04-26 20:19:41',

                    updateTime: '2022-04-26 20:19:41',

                    label: '中寒圩村',
                    parentId: '330421002',

                    children: null,

                    code: '330421002023',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/中寒圩村',
                    treePath: '330000/330400/330421/330421002/330421002023',

                    level: 6,
                  },
                  {
                    id: '330421002024',
                    createTime: '2022-04-26 20:19:41',

                    updateTime: '2022-04-26 20:19:41',

                    label: '中山社区',
                    parentId: '330421002',

                    children: null,

                    code: '330421002024',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/中山社区',
                    treePath: '330000/330400/330421/330421002/330421002024',
                    longitude: '120.9021830954546',
                    latitude: '30.842767259030033',
                    level: 6,
                  },
                  {
                    id: '330421002001',
                    createTime: '2022-04-26 20:20:21',

                    updateTime: '2022-04-26 20:20:21',

                    label: '南北暑村',
                    parentId: '330421002',

                    children: null,

                    code: '330421002001',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/南北暑村',
                    treePath: '330000/330400/330421/330421002/330421002001',

                    level: 6,
                  },
                  {
                    id: '330421002015',
                    createTime: '2022-04-26 20:20:37',

                    updateTime: '2022-04-26 20:20:37',

                    label: '嘉辰社区',
                    parentId: '330421002',

                    children: null,

                    code: '330421002015',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/嘉辰社区',
                    treePath: '330000/330400/330421/330421002/330421002015',
                    longitude: '120.92275330700583',
                    latitude: '30.848729930104824',
                    level: 6,
                  },
                  {
                    id: '330421002003',
                    createTime: '2022-04-26 20:20:19',

                    updateTime: '2022-04-26 20:20:19',

                    label: '国庆村',
                    parentId: '330421002',

                    children: null,

                    code: '330421002003',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/国庆村',
                    treePath: '330000/330400/330421/330421002/330421002003',

                    level: 6,
                  },
                  {
                    id: '330421002004',
                    createTime: '2022-04-26 20:20:18',

                    updateTime: '2022-04-26 20:20:18',

                    label: '城东社区',
                    parentId: '330421002',

                    children: null,

                    code: '330421002004',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/城东社区',
                    treePath: '330000/330400/330421/330421002/330421002004',
                    longitude: '120.92841241156049',
                    latitude: '30.846353836134778',
                    level: 6,
                  },
                  {
                    id: '330421002005',
                    createTime: '2022-04-26 20:20:18',

                    updateTime: '2022-04-26 20:20:18',

                    label: '城桥社区',
                    parentId: '330421002',

                    children: null,

                    code: '330421002005',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/城桥社区',
                    treePath: '330000/330400/330421/330421002/330421002005',
                    longitude: '120.93323665287538',
                    latitude: '30.853977574115667',
                    level: 6,
                  },
                  {
                    id: '330421002019',
                    createTime: '2022-04-26 20:20:31',

                    updateTime: '2022-04-26 20:20:31',

                    label: '小东门社区',
                    parentId: '330421002',

                    children: null,

                    code: '330421002019',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/小东门社区',
                    treePath: '330000/330400/330421/330421002/330421002019',
                    longitude: '120.91016580637874',
                    latitude: '30.846273649919755',
                    level: 6,
                  },
                  {
                    id: '330421002025',
                    createTime: '2022-04-26 20:19:40',

                    updateTime: '2022-04-26 20:19:40',

                    label: '庄港社区',
                    parentId: '330421002',

                    children: null,

                    code: '330421002025',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/庄港社区',
                    treePath: '330000/330400/330421/330421002/330421002025',
                    longitude: '120.88515067161485',
                    latitude: '30.845139965952903',
                    level: 6,
                  },
                  {
                    id: '330421002008',
                    createTime: '2022-04-26 20:20:15',

                    updateTime: '2022-04-26 20:20:15',

                    label: '日晖社区',
                    parentId: '330421002',

                    children: null,

                    code: '330421002008',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/日晖社区',
                    treePath: '330000/330400/330421/330421002/330421002008',

                    level: 6,
                  },
                  {
                    id: '330421002013',
                    createTime: '2022-04-26 20:20:39',

                    updateTime: '2022-04-26 20:20:39',

                    label: '智果村',
                    parentId: '330421002',

                    children: null,

                    code: '330421002013',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/智果村',
                    treePath: '330000/330400/330421/330421002/330421002013',

                    level: 6,
                  },
                  {
                    id: '330421002017',
                    createTime: '2022-04-26 20:20:35',

                    updateTime: '2022-04-26 20:20:35',

                    label: '梁桥村',
                    parentId: '330421002',

                    children: null,

                    code: '330421002017',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/梁桥村',
                    treePath: '330000/330400/330421/330421002/330421002017',

                    level: 6,
                  },
                  {
                    id: '330421002006',
                    createTime: '2022-04-26 20:20:17',

                    updateTime: '2022-04-26 20:20:17',

                    label: '浒弄社区',
                    parentId: '330421002',

                    children: null,

                    code: '330421002006',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/浒弄社区',
                    treePath: '330000/330400/330421/330421002/330421002006',
                    longitude: '120.89721041840932',
                    latitude: '30.84471012120222',
                    level: 6,
                  },
                  {
                    id: '330421002012',
                    createTime: '2022-04-26 20:20:40',

                    updateTime: '2022-04-26 20:20:40',

                    label: '网埭港村',
                    parentId: '330421002',

                    children: null,

                    code: '330421002012',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/网埭港村',
                    treePath: '330000/330400/330421/330421002/330421002012',

                    level: 6,
                  },
                  {
                    id: '330421002007',
                    createTime: '2022-04-26 20:20:16',

                    updateTime: '2022-04-26 20:20:16',

                    label: '虹桥村',
                    parentId: '330421002',

                    children: null,

                    code: '330421002007',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/虹桥村',
                    treePath: '330000/330400/330421/330421002/330421002007',

                    level: 6,
                  },
                  {
                    id: '330421002014',
                    createTime: '2022-04-26 20:20:38',

                    updateTime: '2022-04-26 20:20:38',

                    label: '西门社区',
                    parentId: '330421002',

                    children: null,

                    code: '330421002014',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/西门社区',
                    treePath: '330000/330400/330421/330421002/330421002014',

                    level: 6,
                  },
                  {
                    id: '330421002011',
                    createTime: '2022-04-26 20:20:41',

                    updateTime: '2022-04-26 20:20:41',

                    label: '西项社区',
                    parentId: '330421002',

                    children: null,

                    code: '330421002011',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/西项社区',
                    treePath: '330000/330400/330421/330421002/330421002011',
                    longitude: '120.91432621274778',
                    latitude: '30.86183760216684',
                    level: 6,
                  },
                  {
                    id: '330421002010',
                    createTime: '2022-04-26 20:20:41',

                    updateTime: '2022-04-26 20:20:41',

                    label: '解放社区',
                    parentId: '330421002',

                    children: null,

                    code: '330421002010',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/解放社区',
                    treePath: '330000/330400/330421/330421002/330421002010',
                    longitude: '120.91378445829416',
                    latitude: '30.84328617688104',
                    level: 6,
                  },
                  {
                    id: '330421002021',
                    createTime: '2022-04-26 20:19:43',

                    updateTime: '2022-04-26 20:19:43',

                    label: '谈公社区',
                    parentId: '330421002',

                    children: null,

                    code: '330421002021',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/谈公社区',
                    treePath: '330000/330400/330421/330421002/330421002021',
                    longitude: '120.91498446324935',
                    latitude: '30.83907283215914',
                    level: 6,
                  },
                  {
                    id: '330421002002',
                    createTime: '2022-04-26 20:20:20',

                    updateTime: '2022-04-26 20:20:20',

                    label: '车站社区',
                    parentId: '330421002',

                    children: null,

                    code: '330421002002',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/车站社区',
                    treePath: '330000/330400/330421/330421002/330421002002',
                    longitude: '120.91719573663129',
                    latitude: '30.85211776421631',
                    level: 6,
                  },
                  {
                    id: '330421002009',
                    createTime: '2022-04-26 20:20:14',

                    updateTime: '2022-04-26 20:20:14',

                    label: '里泽村',
                    parentId: '330421002',

                    children: null,

                    code: '330421002009',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/里泽村',
                    treePath: '330000/330400/330421/330421002/330421002009',

                    level: 6,
                  },
                  {
                    id: '330421002026',
                    createTime: '2022-04-26 20:19:39',

                    updateTime: '2022-04-26 20:19:39',

                    label: '镇北社区',
                    parentId: '330421002',

                    children: null,

                    code: '330421002026',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/镇北社区',
                    treePath: '330000/330400/330421/330421002/330421002026',

                    level: 6,
                  },
                  {
                    id: '330421002022',
                    createTime: '2022-04-26 20:19:42',

                    updateTime: '2022-04-26 20:19:42',

                    label: '长秀村',
                    parentId: '330421002',

                    children: null,

                    code: '330421002022',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/长秀村',
                    treePath: '330000/330400/330421/330421002/330421002022',

                    level: 6,
                  },
                  {
                    id: '330421002020',
                    createTime: '2022-04-26 20:19:44',

                    updateTime: '2022-04-26 20:19:44',

                    label: '香山社区',
                    parentId: '330421002',

                    children: null,

                    code: '330421002020',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/香山社区',
                    treePath: '330000/330400/330421/330421002/330421002020',
                    longitude: '120.91619868008227',
                    latitude: '30.85721436003016',
                    level: 6,
                  },
                  {
                    id: '330421002018',
                    createTime: '2022-04-26 20:20:33',

                    updateTime: '2022-04-26 20:20:33',

                    label: '魏中村',
                    parentId: '330421002',

                    children: null,

                    code: '330421002018',
                    name: '浙江省/嘉兴市/嘉善县/魏塘街道/魏中村',
                    treePath: '330000/330400/330421/330421002/330421002018',

                    level: 6,
                  },
                ],

                code: '330421002',
                name: '浙江省/嘉兴市/嘉善县/魏塘街道',
                treePath: '330000/330400/330421/330421002',

                level: 5,
              },
            ],

            code: '330421',
            name: '浙江省/嘉兴市/嘉善县',
            treePath: '330000/330400/330421',

            level: 4,
          },
          {
            id: '330482',

            label: '平湖市',
            parentId: '330400',

            children: [
              {
                id: '330482101',

                label: '乍浦镇',
                parentId: '330482',

                children: null,

                code: '330482101',
                name: '浙江省/嘉兴市/平湖市/乍浦镇',
                treePath: '330000/330400/330482/330482101',

                level: 5,
              },
              {
                id: '330482106',

                label: '广陈镇',
                parentId: '330482',

                children: null,

                code: '330482106',
                name: '浙江省/嘉兴市/平湖市/广陈镇',
                treePath: '330000/330400/330482/330482106',

                level: 5,
              },
              {
                id: '330482001',

                label: '当湖街道',
                parentId: '330482',

                children: null,

                code: '330482001',
                name: '浙江省/嘉兴市/平湖市/当湖街道',
                treePath: '330000/330400/330482/330482001',

                level: 5,
              },
              {
                id: '330482103',

                label: '新仓镇',
                parentId: '330482',

                children: null,

                code: '330482103',
                name: '浙江省/嘉兴市/平湖市/新仓镇',
                treePath: '330000/330400/330482/330482103',

                level: 5,
              },
              {
                id: '330482102',

                label: '新埭镇',
                parentId: '330482',

                children: null,

                code: '330482102',
                name: '浙江省/嘉兴市/平湖市/新埭镇',
                treePath: '330000/330400/330482/330482102',

                level: 5,
              },
              {
                id: '330482002',

                label: '曹桥街道',
                parentId: '330482',

                children: null,

                code: '330482002',
                name: '浙江省/嘉兴市/平湖市/曹桥街道',
                treePath: '330000/330400/330482/330482002',

                level: 5,
              },
              {
                id: '330482107',

                label: '林埭镇',
                parentId: '330482',

                children: null,

                code: '330482107',
                name: '浙江省/嘉兴市/平湖市/林埭镇',
                treePath: '330000/330400/330482/330482107',

                level: 5,
              },
              {
                id: '330482108',

                label: '独山港镇',
                parentId: '330482',

                children: null,

                code: '330482108',
                name: '浙江省/嘉兴市/平湖市/独山港镇',
                treePath: '330000/330400/330482/330482108',

                level: 5,
              },
              {
                id: '330482003',

                label: '钟埭街道',
                parentId: '330482',

                children: null,

                code: '330482003',
                name: '浙江省/嘉兴市/平湖市/钟埭街道',
                treePath: '330000/330400/330482/330482003',

                level: 5,
              },
            ],

            code: '330482',
            name: '浙江省/嘉兴市/平湖市',
            treePath: '330000/330400/330482',

            level: 4,
          },
          {
            id: '330483',

            label: '桐乡市',
            parentId: '330400',

            children: [
              {
                id: '330483100',

                label: '乌镇镇',
                parentId: '330483',

                children: null,

                code: '330483100',
                name: '浙江省/嘉兴市/桐乡市/乌镇镇',
                treePath: '330000/330400/330483/330483100',

                level: 5,
              },
              {
                id: '330483003',

                label: '凤鸣街道',
                parentId: '330483',

                children: null,

                code: '330483003',
                name: '浙江省/嘉兴市/桐乡市/凤鸣街道',
                treePath: '330000/330400/330483/330483003',

                level: 5,
              },
              {
                id: '330483106',

                label: '大麻镇',
                parentId: '330483',

                children: null,

                code: '330483106',
                name: '浙江省/嘉兴市/桐乡市/大麻镇',
                treePath: '330000/330400/330483/330483106',

                level: 5,
              },
              {
                id: '330483102',

                label: '屠甸镇',
                parentId: '330483',

                children: null,

                code: '330483102',
                name: '浙江省/嘉兴市/桐乡市/屠甸镇',
                treePath: '330000/330400/330483/330483102',

                level: 5,
              },
              {
                id: '330483107',

                label: '崇福镇',
                parentId: '330483',

                children: null,

                code: '330483107',
                name: '浙江省/嘉兴市/桐乡市/崇福镇',
                treePath: '330000/330400/330483/330483107',

                level: 5,
              },
              {
                id: '330483001',

                label: '梧桐街道',
                parentId: '330483',

                children: null,

                code: '330483001',
                name: '浙江省/嘉兴市/桐乡市/梧桐街道',
                treePath: '330000/330400/330483/330483001',

                level: 5,
              },
              {
                id: '330483104',

                label: '河山镇',
                parentId: '330483',

                children: null,

                code: '330483104',
                name: '浙江省/嘉兴市/桐乡市/河山镇',
                treePath: '330000/330400/330483/330483104',

                level: 5,
              },
              {
                id: '330483105',

                label: '洲泉镇',
                parentId: '330483',

                children: null,

                code: '330483105',
                name: '浙江省/嘉兴市/桐乡市/洲泉镇',
                treePath: '330000/330400/330483/330483105',

                level: 5,
              },
              {
                id: '330483101',

                label: '濮院镇',
                parentId: '330483',

                children: null,

                code: '330483101',
                name: '浙江省/嘉兴市/桐乡市/濮院镇',
                treePath: '330000/330400/330483/330483101',

                level: 5,
              },
              {
                id: '330483103',

                label: '石门镇',
                parentId: '330483',

                children: null,

                code: '330483103',
                name: '浙江省/嘉兴市/桐乡市/石门镇',
                treePath: '330000/330400/330483/330483103',

                level: 5,
              },
              {
                id: '330483008',

                label: '高桥街道',
                parentId: '330483',

                children: null,

                code: '330483008',
                name: '浙江省/嘉兴市/桐乡市/高桥街道',
                treePath: '330000/330400/330483/330483008',

                level: 5,
              },
            ],

            code: '330483',
            name: '浙江省/嘉兴市/桐乡市',
            treePath: '330000/330400/330483',

            level: 4,
          },
          {
            id: '330481',

            label: '海宁市',
            parentId: '330400',

            children: [
              {
                id: '330481106',

                label: '丁桥镇',
                parentId: '330481',

                children: [
                  {
                    id: '330481106004',

                    label: '丁桥村',
                    parentId: '330481106',

                    children: null,

                    code: '330481106004',
                    name: '浙江省/嘉兴市/海宁市/丁桥镇/丁桥村',
                    treePath: '330000/330400/330481/330481106/330481106004',
                    longitude: '120.644046601',
                    latitude: '30.422395411',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481106005',

                    label: '丁桥社区',
                    parentId: '330481106',

                    children: null,

                    code: '330481106005',
                    name: '浙江省/嘉兴市/海宁市/丁桥镇/丁桥社区',
                    treePath: '330000/330400/330481/330481106/330481106005',
                    longitude: '120.639015014',
                    latitude: '30.4230688490001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481106017',

                    label: '丁桥镇本级社区',
                    parentId: '330481106',

                    children: null,

                    code: '330481106017',
                    name: '浙江省/嘉兴市/海宁市/丁桥镇/丁桥镇本级社区',
                    treePath: '330000/330400/330481/330481106/330481106017',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481106006',

                    label: '万新村',
                    parentId: '330481106',

                    children: null,

                    code: '330481106006',
                    name: '浙江省/嘉兴市/海宁市/丁桥镇/万新村',
                    treePath: '330000/330400/330481/330481106/330481106006',
                    longitude: '120.690226493',
                    latitude: '30.4260014600001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481106007',

                    label: '两丰村',
                    parentId: '330481106',

                    children: null,

                    code: '330481106007',
                    name: '浙江省/嘉兴市/海宁市/丁桥镇/两丰村',
                    treePath: '330000/330400/330481/330481106/330481106007',
                    longitude: '120.633767962',
                    latitude: '30.441226994',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481106008',

                    label: '保胜村',
                    parentId: '330481106',

                    children: null,

                    code: '330481106008',
                    name: '浙江省/嘉兴市/海宁市/丁桥镇/保胜村',
                    treePath: '330000/330400/330481/330481106/330481106008',
                    longitude: '120.674821442',
                    latitude: '30.4399504850001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481106001',

                    label: '利群村',
                    parentId: '330481106',

                    children: null,

                    code: '330481106001',
                    name: '浙江省/嘉兴市/海宁市/丁桥镇/利群村',
                    treePath: '330000/330400/330481/330481106/330481106001',
                    longitude: '120.70495176',
                    latitude: '30.424713898',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481106002',

                    label: '新仓村',
                    parentId: '330481106',

                    children: null,

                    code: '330481106002',
                    name: '浙江省/嘉兴市/海宁市/丁桥镇/新仓村',
                    treePath: '330000/330400/330481/330481106/330481106002',
                    longitude: '120.692704676',
                    latitude: '30.4024517300001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481106003',

                    label: '民利村',
                    parentId: '330481106',

                    children: null,

                    code: '330481106003',
                    name: '浙江省/嘉兴市/海宁市/丁桥镇/民利村',
                    treePath: '330000/330400/330481/330481106/330481106003',
                    longitude: '120.636333093',
                    latitude: '30.430727883',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481106009',

                    label: '永胜村',
                    parentId: '330481106',

                    children: null,

                    code: '330481106009',
                    name: '浙江省/嘉兴市/海宁市/丁桥镇/永胜村',
                    treePath: '330000/330400/330481/330481106/330481106009',
                    longitude: '120.652061577',
                    latitude: '30.4400913280001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481106010',

                    label: '海星村',
                    parentId: '330481106',

                    children: null,

                    code: '330481106010',
                    name: '浙江省/嘉兴市/海宁市/丁桥镇/海星村',
                    treePath: '330000/330400/330481/330481106/330481106010',
                    longitude: '120.616793127',
                    latitude: '30.411094324',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481106011',

                    label: '海潮村',
                    parentId: '330481106',

                    children: null,

                    code: '330481106011',
                    name: '浙江省/嘉兴市/海宁市/丁桥镇/海潮村',
                    treePath: '330000/330400/330481/330481106/330481106011',
                    longitude: '120.673307078',
                    latitude: '30.412054144',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481106012',

                    label: '群海村',
                    parentId: '330481106',

                    children: null,

                    code: '330481106012',
                    name: '浙江省/嘉兴市/海宁市/丁桥镇/群海村',
                    treePath: '330000/330400/330481/330481106/330481106012',
                    longitude: '120.605031871',
                    latitude: '30.416851803',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481106013',

                    label: '芦湾村',
                    parentId: '330481106',

                    children: null,

                    code: '330481106013',
                    name: '浙江省/嘉兴市/海宁市/丁桥镇/芦湾村',
                    treePath: '330000/330400/330481/330481106/330481106013',
                    longitude: '120.664167948',
                    latitude: '30.442746157',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481106014',

                    label: '诸桥村',
                    parentId: '330481106',

                    children: null,

                    code: '330481106014',
                    name: '浙江省/嘉兴市/海宁市/丁桥镇/诸桥村',
                    treePath: '330000/330400/330481/330481106/330481106014',
                    longitude: '120.604253984',
                    latitude: '30.4304545300001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481106018',

                    label: '金扬村',
                    parentId: '330481106',

                    children: null,

                    code: '330481106018',
                    name: '浙江省/嘉兴市/海宁市/丁桥镇/金扬村',
                    treePath: '330000/330400/330481/330481106/330481106018',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481106015',

                    label: '金敭村',
                    parentId: '330481106',

                    children: null,

                    code: '330481106015',
                    name: '浙江省/嘉兴市/海宁市/丁桥镇/金敭村',
                    treePath: '330000/330400/330481/330481106/330481106015',
                    longitude: '120.698989519',
                    latitude: '30.4324446590001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481106016',

                    label: '龙新社区',
                    parentId: '330481106',

                    children: null,

                    code: '330481106016',
                    name: '浙江省/嘉兴市/海宁市/丁桥镇/龙新社区',
                    treePath: '330000/330400/330481/330481106/330481106016',

                    level: 6,
                    source: '',
                  },
                ],

                code: '330481106',
                name: '浙江省/嘉兴市/海宁市/丁桥镇',
                treePath: '330000/330400/330481/330481106',
                longitude: '120.66466361119583',
                latitude: '30.427248123083384',
                level: 5,
              },
              {
                id: '330481105',

                label: '周王庙镇',
                parentId: '330481',

                children: [
                  {
                    id: '330481105005',

                    label: '上林村',
                    parentId: '330481105',

                    children: null,

                    code: '330481105005',
                    name: '浙江省/嘉兴市/海宁市/周王庙镇/上林村',
                    treePath: '330000/330400/330481/330481105/330481105005',
                    longitude: '120.518925415',
                    latitude: '30.464513713',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481105001',

                    label: '之江村',
                    parentId: '330481105',

                    children: null,

                    code: '330481105001',
                    name: '浙江省/嘉兴市/海宁市/周王庙镇/之江村',
                    treePath: '330000/330400/330481/330481105/330481105001',
                    longitude: '120.491010083',
                    latitude: '30.4352253710001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481105002',

                    label: '云龙村',
                    parentId: '330481105',

                    children: null,

                    code: '330481105002',
                    name: '浙江省/嘉兴市/海宁市/周王庙镇/云龙村',
                    treePath: '330000/330400/330481/330481105/330481105002',
                    longitude: '120.474504707',
                    latitude: '30.4273495470001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481105003',

                    label: '博儒桥村',
                    parentId: '330481105',

                    children: null,

                    code: '330481105003',
                    name: '浙江省/嘉兴市/海宁市/周王庙镇/博儒桥村',
                    treePath: '330000/330400/330481/330481105/330481105003',
                    longitude: '120.495969701',
                    latitude: '30.4844114270001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481105004',

                    label: '双涧村',
                    parentId: '330481105',

                    children: null,

                    code: '330481105004',
                    name: '浙江省/嘉兴市/海宁市/周王庙镇/双涧村',
                    treePath: '330000/330400/330481/330481105/330481105004',
                    longitude: '120.511635854',
                    latitude: '30.434191501',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481105006',

                    label: '周王庙社区',
                    parentId: '330481105',

                    children: null,

                    code: '330481105006',
                    name: '浙江省/嘉兴市/海宁市/周王庙镇/周王庙社区',
                    treePath: '330000/330400/330481/330481105/330481105006',
                    longitude: '120.505995883',
                    latitude: '30.466361853',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481105015',

                    label: '周王庙镇本级社区',
                    parentId: '330481105',

                    children: null,

                    code: '330481105015',
                    name: '浙江省/嘉兴市/海宁市/周王庙镇/周王庙镇本级社区',
                    treePath: '330000/330400/330481/330481105/330481105015',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481105007',

                    label: '新建村',
                    parentId: '330481105',

                    children: null,

                    code: '330481105007',
                    name: '浙江省/嘉兴市/海宁市/周王庙镇/新建村',
                    treePath: '330000/330400/330481/330481105/330481105007',
                    longitude: '120.50992401',
                    latitude: '30.4543728990001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481105008',

                    label: '星火村',
                    parentId: '330481105',

                    children: null,

                    code: '330481105008',
                    name: '浙江省/嘉兴市/海宁市/周王庙镇/星火村',
                    treePath: '330000/330400/330481/330481105/330481105008',
                    longitude: '120.535122297',
                    latitude: '30.482976803',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481105009',

                    label: '石井村',
                    parentId: '330481105',

                    children: null,

                    code: '330481105009',
                    name: '浙江省/嘉兴市/海宁市/周王庙镇/石井村',
                    treePath: '330000/330400/330481/330481105/330481105009',
                    longitude: '120.496570007',
                    latitude: '30.4312232340001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481105010',

                    label: '联民村',
                    parentId: '330481105',

                    children: null,

                    code: '330481105010',
                    name: '浙江省/嘉兴市/海宁市/周王庙镇/联民村',
                    treePath: '330000/330400/330481/330481105/330481105010',
                    longitude: '120.494393962',
                    latitude: '30.4566094480001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481105011',

                    label: '胡斗村',
                    parentId: '330481105',

                    children: null,

                    code: '330481105011',
                    name: '浙江省/嘉兴市/海宁市/周王庙镇/胡斗村',
                    treePath: '330000/330400/330481/330481105/330481105011',
                    longitude: '120.46855326',
                    latitude: '30.4022481540001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481105012',

                    label: '荆山村',
                    parentId: '330481105',

                    children: null,

                    code: '330481105012',
                    name: '浙江省/嘉兴市/海宁市/周王庙镇/荆山村',
                    treePath: '330000/330400/330481/330481105/330481105012',
                    longitude: '120.513462186',
                    latitude: '30.414196057',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481105013',

                    label: '长春村',
                    parentId: '330481105',

                    children: null,

                    code: '330481105013',
                    name: '浙江省/嘉兴市/海宁市/周王庙镇/长春村',
                    treePath: '330000/330400/330481/330481105/330481105013',
                    longitude: '120.50769765',
                    latitude: '30.4758817000001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481105014',

                    label: '陈桥村',
                    parentId: '330481105',

                    children: null,

                    code: '330481105014',
                    name: '浙江省/嘉兴市/海宁市/周王庙镇/陈桥村',
                    treePath: '330000/330400/330481/330481105/330481105014',
                    longitude: '120.505704432',
                    latitude: '30.4454508600001',
                    level: 6,
                    source: '',
                  },
                ],

                code: '330481105',
                name: '浙江省/嘉兴市/海宁市/周王庙镇',
                treePath: '330000/330400/330481/330481105',
                longitude: '120.50679508059133',
                latitude: '30.45348415913704',
                level: 5,
              },
              {
                id: '330481107',

                label: '斜桥镇',
                parentId: '330481',

                children: [
                  {
                    id: '330481107011',

                    label: '万星村',
                    parentId: '330481107',

                    children: null,

                    code: '330481107011',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/万星村',
                    treePath: '330000/330400/330481/330481107/330481107011',
                    longitude: '120.607771673',
                    latitude: '30.4759687580001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107020',

                    label: '三联村',
                    parentId: '330481107',

                    children: null,

                    code: '330481107020',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/三联村',
                    treePath: '330000/330400/330481/330481107/330481107020',
                    longitude: '120.586349042',
                    latitude: '30.472936604',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107019',

                    label: '乐农村',
                    parentId: '330481107',

                    children: null,

                    code: '330481107019',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/乐农村',
                    treePath: '330000/330400/330481/330481107/330481107019',
                    longitude: '120.572652364',
                    latitude: '30.508050945',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107018',

                    label: '仲乐村',
                    parentId: '330481107',

                    children: null,

                    code: '330481107018',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/仲乐村',
                    treePath: '330000/330400/330481/330481107/330481107018',
                    longitude: '120.581696128',
                    latitude: '30.509544331',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107017',

                    label: '光明村',
                    parentId: '330481107',

                    children: null,

                    code: '330481107017',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/光明村',
                    treePath: '330000/330400/330481/330481107/330481107017',
                    longitude: '120.618554701',
                    latitude: '30.522048752',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107016',

                    label: '华丰村',
                    parentId: '330481107',

                    children: null,

                    code: '330481107016',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/华丰村',
                    treePath: '330000/330400/330481/330481107/330481107016',
                    longitude: '120.622607428',
                    latitude: '30.4924743290001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107015',

                    label: '庆云村',
                    parentId: '330481107',

                    children: null,

                    code: '330481107015',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/庆云村',
                    treePath: '330000/330400/330481/330481107/330481107015',
                    longitude: '120.604784901',
                    latitude: '30.4892785500001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107014',

                    label: '庆云社区',
                    parentId: '330481107',

                    children: null,

                    code: '330481107014',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/庆云社区',
                    treePath: '330000/330400/330481/330481107/330481107014',
                    longitude: '120.61009597',
                    latitude: '30.496991581',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107013',

                    label: '斜桥村',
                    parentId: '330481107',

                    children: null,

                    code: '330481107013',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/斜桥村',
                    treePath: '330000/330400/330481/330481107/330481107013',
                    longitude: '120.578003285',
                    latitude: '30.483815556',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107012',

                    label: '斜桥社区',
                    parentId: '330481107',

                    children: null,

                    code: '330481107012',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/斜桥社区',
                    treePath: '330000/330400/330481/330481107/330481107012',
                    longitude: '120.57229088',
                    latitude: '30.48251062',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107021',

                    label: '斜桥镇本级社区',
                    parentId: '330481107',

                    children: null,

                    code: '330481107021',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/斜桥镇本级社区',
                    treePath: '330000/330400/330481/330481107/330481107021',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107001',

                    label: '斜西村',
                    parentId: '330481107',

                    children: null,

                    code: '330481107001',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/斜西村',
                    treePath: '330000/330400/330481/330481107/330481107001',
                    longitude: '120.552708257',
                    latitude: '30.47985185',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107010',

                    label: '新农村',
                    parentId: '330481107',

                    children: null,

                    code: '330481107010',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/新农村',
                    treePath: '330000/330400/330481/330481107/330481107010',
                    longitude: '120.566130982',
                    latitude: '30.471316915',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107009',

                    label: '望河社区',
                    parentId: '330481107',

                    children: null,

                    code: '330481107009',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/望河社区',
                    treePath: '330000/330400/330481/330481107/330481107009',
                    longitude: '120.624241672',
                    latitude: '30.494932191',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107008',

                    label: '永合村',
                    parentId: '330481107',

                    children: null,

                    code: '330481107008',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/永合村',
                    treePath: '330000/330400/330481/330481107/330481107008',
                    longitude: '120.61836036',
                    latitude: '30.5034706800001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107007',

                    label: '洛溪社区',
                    parentId: '330481107',

                    children: null,

                    code: '330481107007',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/洛溪社区',
                    treePath: '330000/330400/330481/330481107/330481107007',
                    longitude: '120.607831682',
                    latitude: '30.4884038120001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107006',

                    label: '祝东村',
                    parentId: '330481107',

                    children: null,

                    code: '330481107006',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/祝东村',
                    treePath: '330000/330400/330481/330481107/330481107006',
                    longitude: '120.64965242',
                    latitude: '30.4727812460001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107005',

                    label: '祝场村',
                    parentId: '330481107',

                    children: null,

                    code: '330481107005',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/祝场村',
                    treePath: '330000/330400/330481/330481107/330481107005',
                    longitude: '120.630448013',
                    latitude: '30.4716237010001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107004',

                    label: '路仲村',
                    parentId: '330481107',

                    children: null,

                    code: '330481107004',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/路仲村',
                    treePath: '330000/330400/330481/330481107/330481107004',
                    longitude: '120.60800368',
                    latitude: '30.5256665740001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107003',

                    label: '金石村',
                    parentId: '330481107',

                    children: null,

                    code: '330481107003',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/金石村',
                    treePath: '330000/330400/330481/330481107/330481107003',
                    longitude: '120.626212416',
                    latitude: '30.449632883',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481107002',

                    label: '黄墩村',
                    parentId: '330481107',

                    children: null,

                    code: '330481107002',
                    name: '浙江省/嘉兴市/海宁市/斜桥镇/黄墩村',
                    treePath: '330000/330400/330481/330481107/330481107002',
                    longitude: '120.564194045',
                    latitude: '30.489712793',
                    level: 6,
                    source: '',
                  },
                ],

                code: '330481107',
                name: '浙江省/嘉兴市/海宁市/斜桥镇',
                treePath: '330000/330400/330481/330481107',
                longitude: '120.59480199769231',
                latitude: '30.491911124412447',
                level: 5,
              },
              {
                id: '330481002',

                label: '海昌街道',
                parentId: '330481',

                children: [
                  {
                    id: '330481002001',

                    label: '利民村',
                    parentId: '330481002',

                    children: null,

                    code: '330481002001',
                    name: '浙江省/嘉兴市/海宁市/海昌街道/利民村',
                    treePath: '330000/330400/330481/330481002/330481002001',
                    longitude: '120.684991578',
                    latitude: '30.5574247920001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481002002',

                    label: '双喜村',
                    parentId: '330481002',

                    children: null,

                    code: '330481002002',
                    name: '浙江省/嘉兴市/海宁市/海昌街道/双喜村',
                    treePath: '330000/330400/330481/330481002/330481002002',
                    longitude: '120.692887793',
                    latitude: '30.556718974',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481002003',

                    label: '双山村',
                    parentId: '330481002',

                    children: null,

                    code: '330481002003',
                    name: '浙江省/嘉兴市/海宁市/海昌街道/双山村',
                    treePath: '330000/330400/330481/330481002/330481002003',
                    longitude: '120.69158875',
                    latitude: '30.5797678390001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481002004',

                    label: '双联社区',
                    parentId: '330481002',

                    children: null,

                    code: '330481002004',
                    name: '浙江省/嘉兴市/海宁市/海昌街道/双联社区',
                    treePath: '330000/330400/330481/330481002/330481002004',
                    longitude: '120.654779095',
                    latitude: '30.533048089',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481002005',

                    label: '横山社区',
                    parentId: '330481002',

                    children: null,

                    code: '330481002005',
                    name: '浙江省/嘉兴市/海宁市/海昌街道/横山社区',
                    treePath: '330000/330400/330481/330481002/330481002005',
                    longitude: '120.707730869',
                    latitude: '30.55228873',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481002006',

                    label: '洛隆社区',
                    parentId: '330481002',

                    children: null,

                    code: '330481002006',
                    name: '浙江省/嘉兴市/海宁市/海昌街道/洛隆社区',
                    treePath: '330000/330400/330481/330481002/330481002006',
                    longitude: '120.675132196',
                    latitude: '30.5455474390001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481002018',

                    label: '海昌街道本级社区',
                    parentId: '330481002',

                    children: null,

                    code: '330481002018',
                    name: '浙江省/嘉兴市/海宁市/海昌街道/海昌街道本级社区',
                    treePath: '330000/330400/330481/330481002/330481002018',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481002007',

                    label: '火炬社区',
                    parentId: '330481002',

                    children: null,

                    code: '330481002007',
                    name: '浙江省/嘉兴市/海宁市/海昌街道/火炬社区',
                    treePath: '330000/330400/330481/330481002/330481002007',
                    longitude: '120.670302018',
                    latitude: '30.5491539500001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481002008',

                    label: '狮岭社区',
                    parentId: '330481002',

                    children: null,

                    code: '330481002008',
                    name: '浙江省/嘉兴市/海宁市/海昌街道/狮岭社区',
                    treePath: '330000/330400/330481/330481002/330481002008',
                    longitude: '120.724877995',
                    latitude: '30.5490210200001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481002017',

                    label: '皮都社区',
                    parentId: '330481002',

                    children: null,

                    code: '330481002017',
                    name: '浙江省/嘉兴市/海宁市/海昌街道/皮都社区',
                    treePath: '330000/330400/330481/330481002/330481002017',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481002009',

                    label: '硖川社区',
                    parentId: '330481002',

                    children: null,

                    code: '330481002009',
                    name: '浙江省/嘉兴市/海宁市/海昌街道/硖川社区',
                    treePath: '330000/330400/330481/330481002/330481002009',
                    longitude: '120.740037229',
                    latitude: '30.5442997390001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481002010',

                    label: '硖西社区',
                    parentId: '330481002',

                    children: null,

                    code: '330481002010',
                    name: '浙江省/嘉兴市/海宁市/海昌街道/硖西社区',
                    treePath: '330000/330400/330481/330481002/330481002010',
                    longitude: '120.670684088',
                    latitude: '30.5361356110001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481002011',

                    label: '碧云社区',
                    parentId: '330481002',

                    children: null,

                    code: '330481002011',
                    name: '浙江省/嘉兴市/海宁市/海昌街道/碧云社区',
                    treePath: '330000/330400/330481/330481002/330481002011',
                    longitude: '120.707429152',
                    latitude: '30.5380103520001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481002012',

                    label: '碧海社区',
                    parentId: '330481002',

                    children: null,

                    code: '330481002012',
                    name: '浙江省/嘉兴市/海宁市/海昌街道/碧海社区',
                    treePath: '330000/330400/330481/330481002/330481002012',
                    longitude: '120.703803398',
                    latitude: '30.55239827',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481002013',

                    label: '胜利社区',
                    parentId: '330481002',

                    children: null,

                    code: '330481002013',
                    name: '浙江省/嘉兴市/海宁市/海昌街道/胜利社区',
                    treePath: '330000/330400/330481/330481002/330481002013',
                    longitude: '120.671781075',
                    latitude: '30.552448107',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481002014',

                    label: '迎丰村',
                    parentId: '330481002',

                    children: null,

                    code: '330481002014',
                    name: '浙江省/嘉兴市/海宁市/海昌街道/迎丰村',
                    treePath: '330000/330400/330481/330481002/330481002014',
                    longitude: '120.638810436',
                    latitude: '30.527802084',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481002015',

                    label: '金利社区',
                    parentId: '330481002',

                    children: null,

                    code: '330481002015',
                    name: '浙江省/嘉兴市/海宁市/海昌街道/金利社区',
                    treePath: '330000/330400/330481/330481002/330481002015',
                    longitude: '120.657688197',
                    latitude: '30.5300465990001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481002016',

                    label: '隆兴社区',
                    parentId: '330481002',

                    children: null,

                    code: '330481002016',
                    name: '浙江省/嘉兴市/海宁市/海昌街道/隆兴社区',
                    treePath: '330000/330400/330481/330481002/330481002016',
                    longitude: '120.682910478',
                    latitude: '30.547769972',
                    level: 6,
                    source: '',
                  },
                ],

                code: '330481002',
                name: '浙江省/嘉兴市/海宁市/海昌街道',
                treePath: '330000/330400/330481/330481002',
                longitude: '120.70256901862712',
                latitude: '30.55595453460834',
                level: 5,
              },
              {
                id: '330481003',

                label: '海洲街道',
                parentId: '330481',

                children: [
                  {
                    id: '330481003012',

                    label: '东长社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003012',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/东长社区',
                    treePath: '330000/330400/330481/330481003/330481003012',
                    longitude: '120.685196838',
                    latitude: '30.5006265260001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003021',

                    label: '云和社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003021',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/云和社区',
                    treePath: '330000/330400/330481/330481003/330481003021',
                    longitude: '120.65023261',
                    latitude: '30.5166738250001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003020',

                    label: '伊桥社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003020',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/伊桥社区',
                    treePath: '330000/330400/330481/330481003/330481003020',
                    longitude: '120.654904155',
                    latitude: '30.522275909',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003019',

                    label: '南宛社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003019',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/南宛社区',
                    treePath: '330000/330400/330481/330481003/330481003019',
                    longitude: '120.685525683',
                    latitude: '30.518595697',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003022',

                    label: '南郊社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003022',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/南郊社区',
                    treePath: '330000/330400/330481/330481003/330481003022',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003018',

                    label: '双凤社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003018',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/双凤社区',
                    treePath: '330000/330400/330481/330481003/330481003018',
                    longitude: '120.662683122',
                    latitude: '30.498373284',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003023',

                    label: '开元社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003023',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/开元社区',
                    treePath: '330000/330400/330481/330481003/330481003023',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003017',

                    label: '张店村',
                    parentId: '330481003',

                    children: null,

                    code: '330481003017',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/张店村',
                    treePath: '330000/330400/330481/330481003/330481003017',
                    longitude: '120.63768489',
                    latitude: '30.5050200580001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003016',

                    label: '成园社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003016',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/成园社区',
                    treePath: '330000/330400/330481/330481003/330481003016',
                    longitude: '120.676687077',
                    latitude: '30.5296924840001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003015',

                    label: '新庄社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003015',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/新庄社区',
                    treePath: '330000/330400/330481/330481003/330481003015',
                    longitude: '120.672323244',
                    latitude: '30.5045401680001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003014',

                    label: '新桥社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003014',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/新桥社区',
                    treePath: '330000/330400/330481/330481003/330481003014',
                    longitude: '120.673072319',
                    latitude: '30.5080629460001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003013',

                    label: '梅园社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003013',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/梅园社区',
                    treePath: '330000/330400/330481/330481003/330481003013',
                    longitude: '120.672798745',
                    latitude: '30.522157389',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003001',

                    label: '梨园社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003001',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/梨园社区',
                    treePath: '330000/330400/330481/330481003/330481003001',
                    longitude: '120.672908089',
                    latitude: '30.529500512',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003011',

                    label: '民和社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003011',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/民和社区',
                    treePath: '330000/330400/330481/330481003/330481003011',
                    longitude: '120.656433268',
                    latitude: '30.5105948780001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003010',

                    label: '江南社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003010',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/江南社区',
                    treePath: '330000/330400/330481/330481003/330481003010',
                    longitude: '120.691548444',
                    latitude: '30.495421616',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003009',

                    label: '海洲社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003009',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/海洲社区',
                    treePath: '330000/330400/330481/330481003/330481003009',
                    longitude: '120.681296284',
                    latitude: '30.516830054',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003024',

                    label: '海洲街道本级社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003024',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/海洲街道本级社区',
                    treePath: '330000/330400/330481/330481003/330481003024',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003008',

                    label: '白漾社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003008',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/白漾社区',
                    treePath: '330000/330400/330481/330481003/330481003008',
                    longitude: '120.679831057',
                    latitude: '30.5285084660001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003007',

                    label: '百合社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003007',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/百合社区',
                    treePath: '330000/330400/330481/330481003/330481003007',
                    longitude: '120.681405719',
                    latitude: '30.5002062250001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003006',

                    label: '联合社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003006',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/联合社区',
                    treePath: '330000/330400/330481/330481003/330481003006',
                    longitude: '120.667489894',
                    latitude: '30.5197422100001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003005',

                    label: '联塘社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003005',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/联塘社区',
                    treePath: '330000/330400/330481/330481003/330481003005',
                    longitude: '120.679481615',
                    latitude: '30.5214541460001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003025',

                    label: '莲塘社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003025',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/莲塘社区',
                    treePath: '330000/330400/330481/330481003/330481003025',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003004',

                    label: '西郊社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003004',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/西郊社区',
                    treePath: '330000/330400/330481/330481003/330481003004',
                    longitude: '120.660249072',
                    latitude: '30.516559118',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003003',

                    label: '金龙村',
                    parentId: '330481003',

                    children: null,

                    code: '330481003003',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/金龙村',
                    treePath: '330000/330400/330481/330481003/330481003003',
                    longitude: '120.640733669',
                    latitude: '30.501851146',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481003002',

                    label: '长丰社区',
                    parentId: '330481003',

                    children: null,

                    code: '330481003002',
                    name: '浙江省/嘉兴市/海宁市/海洲街道/长丰社区',
                    treePath: '330000/330400/330481/330481003/330481003002',
                    longitude: '120.685709272',
                    latitude: '30.495992727',
                    level: 6,
                    source: '',
                  },
                ],

                code: '330481003',
                name: '浙江省/嘉兴市/海宁市/海洲街道',
                treePath: '330000/330400/330481/330481003',
                longitude: '120.66974122983422',
                latitude: '30.50002518936369',
                level: 5,
              },
              {
                id: '330481110',

                label: '盐官镇',
                parentId: '330481',

                children: [
                  {
                    id: '330481110014',

                    label: '万寿村',
                    parentId: '330481110',

                    children: null,

                    code: '330481110014',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/万寿村',
                    treePath: '330000/330400/330481/330481110/330481110014',
                    longitude: '120.608163655',
                    latitude: '30.447754601',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481110013',

                    label: '中新社区',
                    parentId: '330481110',

                    children: null,

                    code: '330481110013',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/中新社区',
                    treePath: '330000/330400/330481/330481110/330481110013',
                    longitude: '120.564697112',
                    latitude: '30.409563549',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481110011',

                    label: '丰兴社区',
                    parentId: '330481110',

                    children: null,

                    code: '330481110011',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/丰兴社区',
                    treePath: '330000/330400/330481/330481110/330481110011',
                    longitude: '120.588796002',
                    latitude: '30.4524977830001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481110019',

                    label: '丰士村',
                    parentId: '330481110',

                    children: null,

                    code: '330481110019',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/丰士村',
                    treePath: '330000/330400/330481/330481110/330481110019',
                    longitude: '120.588132399',
                    latitude: '30.4405566680001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481110018',

                    label: '包王村',
                    parentId: '330481110',

                    children: null,

                    code: '330481110018',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/包王村',
                    treePath: '330000/330400/330481/330481110/330481110018',
                    longitude: '120.578473548',
                    latitude: '30.452651631',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481110017',

                    label: '城北村',
                    parentId: '330481110',

                    children: null,

                    code: '330481110017',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/城北村',
                    treePath: '330000/330400/330481/330481110/330481110017',
                    longitude: '120.530751097',
                    latitude: '30.4233193100001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481110016',

                    label: '安星村',
                    parentId: '330481110',

                    children: null,

                    code: '330481110016',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/安星村',
                    treePath: '330000/330400/330481/330481110/330481110016',
                    longitude: '120.552220387',
                    latitude: '30.4240088020001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481110015',

                    label: '广福村',
                    parentId: '330481110',

                    children: null,

                    code: '330481110015',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/广福村',
                    treePath: '330000/330400/330481/330481110/330481110015',
                    longitude: '120.526167714',
                    latitude: '30.4450587010001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481110012',

                    label: '新星村',
                    parentId: '330481110',

                    children: null,

                    code: '330481110012',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/新星村',
                    treePath: '330000/330400/330481/330481110/330481110012',
                    longitude: '120.560696175',
                    latitude: '30.420742852',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481110001',

                    label: '桃园村',
                    parentId: '330481110',

                    children: null,

                    code: '330481110001',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/桃园村',
                    treePath: '330000/330400/330481/330481110/330481110001',
                    longitude: '120.557104888',
                    latitude: '30.4432257930001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481110010',

                    label: '盐官社区',
                    parentId: '330481110',

                    children: null,

                    code: '330481110010',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/盐官社区',
                    treePath: '330000/330400/330481/330481110/330481110010',
                    longitude: '120.543450626',
                    latitude: '30.4070969520001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481110020',

                    label: '盐官镇本级社区',
                    parentId: '330481110',

                    children: null,

                    code: '330481110020',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/盐官镇本级社区',
                    treePath: '330000/330400/330481/330481110/330481110020',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481110009',

                    label: '祝会村',
                    parentId: '330481110',

                    children: null,

                    code: '330481110009',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/祝会村',
                    treePath: '330000/330400/330481/330481110/330481110009',
                    longitude: '120.590975221',
                    latitude: '30.4150678600001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481110008',

                    label: '红友村',
                    parentId: '330481110',

                    children: null,

                    code: '330481110008',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/红友村',
                    treePath: '330000/330400/330481/330481110/330481110008',
                    longitude: '120.587586791',
                    latitude: '30.4574712900001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481110007',

                    label: '群益村',
                    parentId: '330481110',

                    children: null,

                    code: '330481110007',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/群益村',
                    treePath: '330000/330400/330481/330481110/330481110007',
                    longitude: '120.565696562',
                    latitude: '30.4544670070001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481110006',

                    label: '联丰村',
                    parentId: '330481110',

                    children: null,

                    code: '330481110006',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/联丰村',
                    treePath: '330000/330400/330481/330481110/330481110006',
                    longitude: '120.532787326',
                    latitude: '30.4526801810001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481110005',

                    label: '联农村',
                    parentId: '330481110',

                    children: null,

                    code: '330481110005',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/联农村',
                    treePath: '330000/330400/330481/330481110/330481110005',
                    longitude: '120.586812735',
                    latitude: '30.4297711130001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481110004',

                    label: '联群村',
                    parentId: '330481110',

                    children: null,

                    code: '330481110004',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/联群村',
                    treePath: '330000/330400/330481/330481110/330481110004',
                    longitude: '120.609438125',
                    latitude: '30.457137753',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481110003',

                    label: '郭店村',
                    parentId: '330481110',

                    children: null,

                    code: '330481110003',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/郭店村',
                    treePath: '330000/330400/330481/330481110/330481110003',
                    longitude: '120.540605313',
                    latitude: '30.4671709150001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481110002',

                    label: '郭溪社区',
                    parentId: '330481110',

                    children: null,

                    code: '330481110002',
                    name: '浙江省/嘉兴市/海宁市/盐官镇/郭溪社区',
                    treePath: '330000/330400/330481/330481110/330481110002',
                    longitude: '120.547967966',
                    latitude: '30.4547211620001',
                    level: 6,
                    source: '',
                  },
                ],

                code: '330481110',
                name: '浙江省/嘉兴市/海宁市/盐官镇',
                treePath: '330000/330400/330481/330481110',
                longitude: '120.55924432345269',
                latitude: '30.451179744266035',
                level: 5,
              },
              {
                id: '330481004',

                label: '硖石街道',
                parentId: '330481',

                children: [
                  {
                    id: '330481004013',

                    label: '东山社区',
                    parentId: '330481004',

                    children: null,

                    code: '330481004013',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/东山社区',
                    treePath: '330000/330400/330481/330481004/330481004013',
                    longitude: '120.693457083',
                    latitude: '30.530390577',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004024',

                    label: '东苑社区',
                    parentId: '330481004',

                    children: null,

                    code: '330481004024',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/东苑社区',
                    treePath: '330000/330400/330481/330481004/330481004024',
                    longitude: '120.698134366',
                    latitude: '30.518945844',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004023',

                    label: '军民村',
                    parentId: '330481004',

                    children: null,

                    code: '330481004023',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/军民村',
                    treePath: '330000/330400/330481/330481004/330481004023',
                    longitude: '120.739620073',
                    latitude: '30.4875336760001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004022',

                    label: '农丰社区',
                    parentId: '330481004',

                    children: null,

                    code: '330481004022',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/农丰社区',
                    treePath: '330000/330400/330481/330481004/330481004022',
                    longitude: '120.698767636',
                    latitude: '30.508492388',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004021',

                    label: '南关厢社区',
                    parentId: '330481004',

                    children: null,

                    code: '330481004021',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/南关厢社区',
                    treePath: '330000/330400/330481/330481004/330481004021',
                    longitude: '120.686059784',
                    latitude: '30.522977488',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004020',

                    label: '南漾村',
                    parentId: '330481004',

                    children: null,

                    code: '330481004020',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/南漾村',
                    treePath: '330000/330400/330481/330481004/330481004020',
                    longitude: '120.759265422',
                    latitude: '30.50689184',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004019',

                    label: '南苑社区',
                    parentId: '330481004',

                    children: null,

                    code: '330481004019',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/南苑社区',
                    treePath: '330000/330400/330481/330481004/330481004019',
                    longitude: '120.689859684',
                    latitude: '30.5185510110001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004018',

                    label: '双合村',
                    parentId: '330481004',

                    children: null,

                    code: '330481004018',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/双合村',
                    treePath: '330000/330400/330481/330481004/330481004018',
                    longitude: '120.718561116',
                    latitude: '30.4846829360001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004017',

                    label: '新华社区',
                    parentId: '330481004',

                    children: null,

                    code: '330481004017',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/新华社区',
                    treePath: '330000/330400/330481/330481004/330481004017',
                    longitude: '120.683665258',
                    latitude: '30.5291069100001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004016',

                    label: '新苑社区',
                    parentId: '330481004',

                    children: null,

                    code: '330481004016',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/新苑社区',
                    treePath: '330000/330400/330481/330481004/330481004016',
                    longitude: '120.701705051',
                    latitude: '30.5013579110001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004015',

                    label: '杨汇桥村',
                    parentId: '330481004',

                    children: null,

                    code: '330481004015',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/杨汇桥村',
                    treePath: '330000/330400/330481/330481004/330481004015',
                    longitude: '120.746555641',
                    latitude: '30.5176392400001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004014',

                    label: '永丰村',
                    parentId: '330481004',

                    children: null,

                    code: '330481004014',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/永丰村',
                    treePath: '330000/330400/330481/330481004/330481004014',
                    longitude: '120.732716736',
                    latitude: '30.5031802030001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004001',

                    label: '沙泗浜社区',
                    parentId: '330481004',

                    children: null,

                    code: '330481004001',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/沙泗浜社区',
                    treePath: '330000/330400/330481/330481004/330481004001',
                    longitude: '120.688734135',
                    latitude: '30.526521438',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004012',

                    label: '海青桥社区',
                    parentId: '330481004',

                    children: null,

                    code: '330481004012',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/海青桥社区',
                    treePath: '330000/330400/330481/330481004/330481004012',
                    longitude: '120.690217457',
                    latitude: '30.5220802760001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004011',

                    label: '由拳社区',
                    parentId: '330481004',

                    children: null,

                    code: '330481004011',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/由拳社区',
                    treePath: '330000/330400/330481/330481004/330481004011',
                    longitude: '120.696970093',
                    latitude: '30.540374123',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004025',

                    label: '石路社区',
                    parentId: '330481004',

                    children: null,

                    code: '330481004025',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/石路社区',
                    treePath: '330000/330400/330481/330481004/330481004025',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004026',

                    label: '硖石街道本级社区',
                    parentId: '330481004',

                    children: null,

                    code: '330481004026',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/硖石街道本级社区',
                    treePath: '330000/330400/330481/330481004/330481004026',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004010',

                    label: '竦秀社区',
                    parentId: '330481004',

                    children: null,

                    code: '330481004010',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/竦秀社区',
                    treePath: '330000/330400/330481/330481004/330481004010',
                    longitude: '120.706329447',
                    latitude: '30.525999439',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004009',

                    label: '群园社区',
                    parentId: '330481004',

                    children: null,

                    code: '330481004009',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/群园社区',
                    treePath: '330000/330400/330481/330481004/330481004009',
                    longitude: '120.707874616',
                    latitude: '30.5194037470001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004008',

                    label: '联和村',
                    parentId: '330481004',

                    children: null,

                    code: '330481004008',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/联和村',
                    treePath: '330000/330400/330481/330481004/330481004008',
                    longitude: '120.720480891',
                    latitude: '30.4953209380001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004007',

                    label: '荷叶村',
                    parentId: '330481004',

                    children: null,

                    code: '330481004007',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/荷叶村',
                    treePath: '330000/330400/330481/330481004/330481004007',
                    longitude: '120.701786272',
                    latitude: '30.4945453390001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004006',

                    label: '西山社区',
                    parentId: '330481004',

                    children: null,

                    code: '330481004006',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/西山社区',
                    treePath: '330000/330400/330481/330481004/330481004006',
                    longitude: '120.689487499',
                    latitude: '30.538491552',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004005',

                    label: '西环村',
                    parentId: '330481004',

                    children: null,

                    code: '330481004005',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/西环村',
                    treePath: '330000/330400/330481/330481004/330481004005',
                    longitude: '120.733326091',
                    latitude: '30.519024422',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004004',

                    label: '赞山社区',
                    parentId: '330481004',

                    children: null,

                    code: '330481004004',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/赞山社区',
                    treePath: '330000/330400/330481/330481004/330481004004',
                    longitude: '120.706799166',
                    latitude: '30.502130014',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004003',

                    label: '长田社区',
                    parentId: '330481004',

                    children: null,

                    code: '330481004003',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/长田社区',
                    treePath: '330000/330400/330481/330481004/330481004003',
                    longitude: '120.717107058',
                    latitude: '30.5269400940001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481004002',

                    label: '风和丽苑社区',
                    parentId: '330481004',

                    children: null,

                    code: '330481004002',
                    name: '浙江省/嘉兴市/海宁市/硖石街道/风和丽苑社区',
                    treePath: '330000/330400/330481/330481004/330481004002',
                    longitude: '120.697215619',
                    latitude: '30.504836359',
                    level: 6,
                    source: '',
                  },
                ],

                code: '330481004',
                name: '浙江省/嘉兴市/海宁市/硖石街道',
                treePath: '330000/330400/330481/330481004',
                longitude: '120.72507798863114',
                latitude: '30.507170036557426',
                level: 5,
              },
              {
                id: '330481112',

                label: '袁花镇',
                parentId: '330481',

                children: [
                  {
                    id: '330481112010',

                    label: '东风村',
                    parentId: '330481112',

                    children: null,

                    code: '330481112010',
                    name: '浙江省/嘉兴市/海宁市/袁花镇/东风村',
                    treePath: '330000/330400/330481/330481112/330481112010',
                    longitude: '120.767005866',
                    latitude: '30.484226026',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481112017',

                    label: '双丰村',
                    parentId: '330481112',

                    children: null,

                    code: '330481112017',
                    name: '浙江省/嘉兴市/海宁市/袁花镇/双丰村',
                    treePath: '330000/330400/330481/330481112/330481112017',
                    longitude: '120.753218452',
                    latitude: '30.4073688500001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481112016',

                    label: '夹山村',
                    parentId: '330481112',

                    children: null,

                    code: '330481112016',
                    name: '浙江省/嘉兴市/海宁市/袁花镇/夹山村',
                    treePath: '330000/330400/330481/330481112/330481112016',
                    longitude: '120.809025465',
                    latitude: '30.414999478',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481112015',

                    label: '彭墩村',
                    parentId: '330481112',

                    children: null,

                    code: '330481112015',
                    name: '浙江省/嘉兴市/海宁市/袁花镇/彭墩村',
                    treePath: '330000/330400/330481/330481112/330481112015',
                    longitude: '120.763773716',
                    latitude: '30.4913405720001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481112014',

                    label: '新袁村',
                    parentId: '330481112',

                    children: null,

                    code: '330481112014',
                    name: '浙江省/嘉兴市/海宁市/袁花镇/新袁村',
                    treePath: '330000/330400/330481/330481112/330481112014',
                    longitude: '120.771629048',
                    latitude: '30.407455462',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481112013',

                    label: '梨园村',
                    parentId: '330481112',

                    children: null,

                    code: '330481112013',
                    name: '浙江省/嘉兴市/海宁市/袁花镇/梨园村',
                    treePath: '330000/330400/330481/330481112/330481112013',
                    longitude: '120.782257352',
                    latitude: '30.4563326540001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481112012',

                    label: '河东街社区',
                    parentId: '330481112',

                    children: null,

                    code: '330481112012',
                    name: '浙江省/嘉兴市/海宁市/袁花镇/河东街社区',
                    treePath: '330000/330400/330481/330481112/330481112012',
                    longitude: '120.771723045',
                    latitude: '30.4165606990001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481112011',

                    label: '河西街社区',
                    parentId: '330481112',

                    children: null,

                    code: '330481112011',
                    name: '浙江省/嘉兴市/海宁市/袁花镇/河西街社区',
                    treePath: '330000/330400/330481/330481112/330481112011',
                    longitude: '120.770283146',
                    latitude: '30.415936463',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481112001',

                    label: '濮桥村',
                    parentId: '330481112',

                    children: null,

                    code: '330481112001',
                    name: '浙江省/嘉兴市/海宁市/袁花镇/濮桥村',
                    treePath: '330000/330400/330481/330481112/330481112001',
                    longitude: '120.763537091',
                    latitude: '30.473301797',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481112009',

                    label: '红新村',
                    parentId: '330481112',

                    children: null,

                    code: '330481112009',
                    name: '浙江省/嘉兴市/海宁市/袁花镇/红新村',
                    treePath: '330000/330400/330481/330481112/330481112009',
                    longitude: '120.756877339',
                    latitude: '30.4372042860001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481112008',

                    label: '红晓村',
                    parentId: '330481112',

                    children: null,

                    code: '330481112008',
                    name: '浙江省/嘉兴市/海宁市/袁花镇/红晓村',
                    treePath: '330000/330400/330481/330481112/330481112008',
                    longitude: '120.777467694',
                    latitude: '30.4300688820001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481112007',

                    label: '花溪社区',
                    parentId: '330481112',

                    children: null,

                    code: '330481112007',
                    name: '浙江省/嘉兴市/海宁市/袁花镇/花溪社区',
                    treePath: '330000/330400/330481/330481112/330481112007',
                    longitude: '120.772671679',
                    latitude: '30.4194727920001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481112018',

                    label: '袁花镇本级社区',
                    parentId: '330481112',

                    children: null,

                    code: '330481112018',
                    name: '浙江省/嘉兴市/海宁市/袁花镇/袁花镇本级社区',
                    treePath: '330000/330400/330481/330481112/330481112018',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481112006',

                    label: '谈桥村',
                    parentId: '330481112',

                    children: null,

                    code: '330481112006',
                    name: '浙江省/嘉兴市/海宁市/袁花镇/谈桥村',
                    treePath: '330000/330400/330481/330481112/330481112006',
                    longitude: '120.758659917',
                    latitude: '30.4598286560001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481112005',

                    label: '镇东村',
                    parentId: '330481112',

                    children: null,

                    code: '330481112005',
                    name: '浙江省/嘉兴市/海宁市/袁花镇/镇东村',
                    treePath: '330000/330400/330481/330481112/330481112005',
                    longitude: '120.783405732',
                    latitude: '30.4050443020001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481112004',

                    label: '镇西村',
                    parentId: '330481112',

                    children: null,

                    code: '330481112004',
                    name: '浙江省/嘉兴市/海宁市/袁花镇/镇西村',
                    treePath: '330000/330400/330481/330481112/330481112004',
                    longitude: '120.763251415',
                    latitude: '30.416272662',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481112003',

                    label: '长啸村',
                    parentId: '330481112',

                    children: null,

                    code: '330481112003',
                    name: '浙江省/嘉兴市/海宁市/袁花镇/长啸村',
                    treePath: '330000/330400/330481/330481112/330481112003',
                    longitude: '120.786315647',
                    latitude: '30.4267929420001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481112002',

                    label: '龙联村',
                    parentId: '330481112',

                    children: null,

                    code: '330481112002',
                    name: '浙江省/嘉兴市/海宁市/袁花镇/龙联村',
                    treePath: '330000/330400/330481/330481112/330481112002',
                    longitude: '120.726767556',
                    latitude: '30.422967353',
                    level: 6,
                    source: '',
                  },
                ],

                code: '330481112',
                name: '浙江省/嘉兴市/海宁市/袁花镇',
                treePath: '330000/330400/330481/330481112',
                longitude: '120.77950116781477',
                latitude: '30.44834821296957',
                level: 5,
              },
              {
                id: '330481101',

                label: '许村镇',
                parentId: '330481',

                children: [
                  {
                    id: '330481101016',

                    label: '前进村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101016',
                    name: '浙江省/嘉兴市/海宁市/许村镇/前进村',
                    treePath: '330000/330400/330481/330481101/330481101016',
                    longitude: '120.321737585',
                    latitude: '30.3855404490001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101029',

                    label: '南联村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101029',
                    name: '浙江省/嘉兴市/海宁市/许村镇/南联村',
                    treePath: '330000/330400/330481/330481101/330481101029',
                    longitude: '120.367665168',
                    latitude: '30.4244749270001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101030',

                    label: '双联村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101030',
                    name: '浙江省/嘉兴市/海宁市/许村镇/双联村',
                    treePath: '330000/330400/330481/330481101/330481101030',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101028',

                    label: '团结村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101028',
                    name: '浙江省/嘉兴市/海宁市/许村镇/团结村',
                    treePath: '330000/330400/330481/330481101/330481101028',
                    longitude: '120.367348392',
                    latitude: '30.4431661350001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101027',

                    label: '塘桥村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101027',
                    name: '浙江省/嘉兴市/海宁市/许村镇/塘桥村',
                    treePath: '330000/330400/330481/330481101/330481101027',
                    longitude: '120.361089121',
                    latitude: '30.3821504370001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101026',

                    label: '孙桥村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101026',
                    name: '浙江省/嘉兴市/海宁市/许村镇/孙桥村',
                    treePath: '330000/330400/330481/330481101/330481101026',
                    longitude: '120.339797348',
                    latitude: '30.456967293',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101025',

                    label: '巷东村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101025',
                    name: '浙江省/嘉兴市/海宁市/许村镇/巷东村',
                    treePath: '330000/330400/330481/330481101/330481101025',
                    longitude: '120.389358685',
                    latitude: '30.4088911920001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101024',

                    label: '庄湾村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101024',
                    name: '浙江省/嘉兴市/海宁市/许村镇/庄湾村',
                    treePath: '330000/330400/330481/330481101/330481101024',
                    longitude: '120.340430464',
                    latitude: '30.4731463160001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101023',

                    label: '报国村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101023',
                    name: '浙江省/嘉兴市/海宁市/许村镇/报国村',
                    treePath: '330000/330400/330481/330481101/330481101023',
                    longitude: '120.388272187',
                    latitude: '30.446111769',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101022',

                    label: '文桥村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101022',
                    name: '浙江省/嘉兴市/海宁市/许村镇/文桥村',
                    treePath: '330000/330400/330481/330481101/330481101022',
                    longitude: '120.390812148',
                    latitude: '30.460648168',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101021',

                    label: '新华村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101021',
                    name: '浙江省/嘉兴市/海宁市/许村镇/新华村',
                    treePath: '330000/330400/330481/330481101/330481101021',
                    longitude: '120.396918797',
                    latitude: '30.461073297',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101020',

                    label: '新益村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101020',
                    name: '浙江省/嘉兴市/海宁市/许村镇/新益村',
                    treePath: '330000/330400/330481/330481101/330481101020',
                    longitude: '120.352172945',
                    latitude: '30.4470323370001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101019',

                    label: '景树村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101019',
                    name: '浙江省/嘉兴市/海宁市/许村镇/景树村',
                    treePath: '330000/330400/330481/330481101/330481101019',
                    longitude: '120.33745971',
                    latitude: '30.4168805830001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101018',

                    label: '李家村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101018',
                    name: '浙江省/嘉兴市/海宁市/许村镇/李家村',
                    treePath: '330000/330400/330481/330481101/330481101018',
                    longitude: '120.380729421',
                    latitude: '30.471559659',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101017',

                    label: '杨渡村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101017',
                    name: '浙江省/嘉兴市/海宁市/许村镇/杨渡村',
                    treePath: '330000/330400/330481/330481101/330481101017',
                    longitude: '120.409631251',
                    latitude: '30.4440622180001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101001',

                    label: '永福村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101001',
                    name: '浙江省/嘉兴市/海宁市/许村镇/永福村',
                    treePath: '330000/330400/330481/330481101/330481101001',
                    longitude: '120.371541768',
                    latitude: '30.4583112870001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101015',

                    label: '海王村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101015',
                    name: '浙江省/嘉兴市/海宁市/许村镇/海王村',
                    treePath: '330000/330400/330481/330481101/330481101015',
                    longitude: '120.357794568',
                    latitude: '30.4097497230001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101014',

                    label: '科同村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101014',
                    name: '浙江省/嘉兴市/海宁市/许村镇/科同村',
                    treePath: '330000/330400/330481/330481101/330481101014',
                    longitude: '120.380680007',
                    latitude: '30.487577733',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101013',

                    label: '红旗村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101013',
                    name: '浙江省/嘉兴市/海宁市/许村镇/红旗村',
                    treePath: '330000/330400/330481/330481101/330481101013',
                    longitude: '120.378542954',
                    latitude: '30.3868210580001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101012',

                    label: '翁埠村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101012',
                    name: '浙江省/嘉兴市/海宁市/许村镇/翁埠村',
                    treePath: '330000/330400/330481/330481101/330481101012',
                    longitude: '120.338627441',
                    latitude: '30.391870318',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101011',

                    label: '联盟村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101011',
                    name: '浙江省/嘉兴市/海宁市/许村镇/联盟村',
                    treePath: '330000/330400/330481/330481101/330481101011',
                    longitude: '120.393792868',
                    latitude: '30.479272075',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101010',

                    label: '胜利村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101010',
                    name: '浙江省/嘉兴市/海宁市/许村镇/胜利村',
                    treePath: '330000/330400/330481/330481101/330481101010',
                    longitude: '120.316001899',
                    latitude: '30.400807592',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101009',

                    label: '花园村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101009',
                    name: '浙江省/嘉兴市/海宁市/许村镇/花园村',
                    treePath: '330000/330400/330481/330481101/330481101009',
                    longitude: '120.36167527',
                    latitude: '30.401006753',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101008',

                    label: '茗山村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101008',
                    name: '浙江省/嘉兴市/海宁市/许村镇/茗山村',
                    treePath: '330000/330400/330481/330481101/330481101008',
                    longitude: '120.411977582',
                    latitude: '30.470763752',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101007',

                    label: '荡湾村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101007',
                    name: '浙江省/嘉兴市/海宁市/许村镇/荡湾村',
                    treePath: '330000/330400/330481/330481101/330481101007',
                    longitude: '120.35119139',
                    latitude: '30.4650406310001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101006',

                    label: '许巷村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101006',
                    name: '浙江省/嘉兴市/海宁市/许村镇/许巷村',
                    treePath: '330000/330400/330481/330481101/330481101006',
                    longitude: '120.343768671',
                    latitude: '30.399237122',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101005',

                    label: '许巷社区',
                    parentId: '330481101',

                    children: null,

                    code: '330481101005',
                    name: '浙江省/嘉兴市/海宁市/许村镇/许巷社区',
                    treePath: '330000/330400/330481/330481101/330481101005',
                    longitude: '120.357772153',
                    latitude: '30.4075438040001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101004',

                    label: '许村社区',
                    parentId: '330481101',

                    children: null,

                    code: '330481101004',
                    name: '浙江省/嘉兴市/海宁市/许村镇/许村社区',
                    treePath: '330000/330400/330481/330481101/330481101004',
                    longitude: '120.364577304',
                    latitude: '30.4374863560001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101031',

                    label: '许村镇本级社区',
                    parentId: '330481101',

                    children: null,

                    code: '330481101031',
                    name: '浙江省/嘉兴市/海宁市/许村镇/许村镇本级社区',
                    treePath: '330000/330400/330481/330481101/330481101031',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101003',

                    label: '许桥村',
                    parentId: '330481101',

                    children: null,

                    code: '330481101003',
                    name: '浙江省/嘉兴市/海宁市/许村镇/许桥村',
                    treePath: '330000/330400/330481/330481101/330481101003',
                    longitude: '120.38537842',
                    latitude: '30.4254403910001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481101002',

                    label: '龙渡社区',
                    parentId: '330481101',

                    children: null,

                    code: '330481101002',
                    name: '浙江省/嘉兴市/海宁市/许村镇/龙渡社区',
                    treePath: '330000/330400/330481/330481101/330481101002',
                    longitude: '120.347077534',
                    latitude: '30.4275832920001',
                    level: 6,
                    source: '',
                  },
                ],

                code: '330481101',
                name: '浙江省/嘉兴市/海宁市/许村镇',
                treePath: '330000/330400/330481/330481101',
                longitude: '120.36276430388318',
                latitude: '30.43476237249285',
                level: 5,
              },
              {
                id: '330481103',

                label: '长安镇',
                parentId: '330481',

                children: [
                  {
                    id: '330481103016',

                    label: '东升村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103016',
                    name: '浙江省/嘉兴市/海宁市/长安镇/东升村',
                    treePath: '330000/330400/330481/330481103/330481103016',
                    longitude: '120.470946309',
                    latitude: '30.4753394160001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103029',

                    label: '东陈村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103029',
                    name: '浙江省/嘉兴市/海宁市/长安镇/东陈村',
                    treePath: '330000/330400/330481/330481103/330481103029',
                    longitude: '120.441657291',
                    latitude: '30.410511496',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103028',

                    label: '仰山社区',
                    parentId: '330481103',

                    children: null,

                    code: '330481103028',
                    name: '浙江省/嘉兴市/海宁市/长安镇/仰山社区',
                    treePath: '330000/330400/330481/330481103/330481103028',
                    longitude: '120.444620012',
                    latitude: '30.4399750810001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103027',

                    label: '修川社区',
                    parentId: '330481103',

                    children: null,

                    code: '330481103027',
                    name: '浙江省/嘉兴市/海宁市/长安镇/修川社区',
                    treePath: '330000/330400/330481/330481103/330481103027',
                    longitude: '120.443210731',
                    latitude: '30.4503028080001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103026',

                    label: '兴城村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103026',
                    name: '浙江省/嘉兴市/海宁市/长安镇/兴城村',
                    treePath: '330000/330400/330481/330481103/330481103026',
                    longitude: '120.449309058',
                    latitude: '30.4946346770001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103025',

                    label: '兴福村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103025',
                    name: '浙江省/嘉兴市/海宁市/长安镇/兴福村',
                    treePath: '330000/330400/330481/330481103/330481103025',
                    longitude: '120.468296462',
                    latitude: '30.4985511890001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103024',

                    label: '创智社区',
                    parentId: '330481103',

                    children: null,

                    code: '330481103024',
                    name: '浙江省/嘉兴市/海宁市/长安镇/创智社区',
                    treePath: '330000/330400/330481/330481103/330481103024',
                    longitude: '120.382013576',
                    latitude: '30.3440239240001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103023',

                    label: '城东村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103023',
                    name: '浙江省/嘉兴市/海宁市/长安镇/城东村',
                    treePath: '330000/330400/330481/330481103/330481103023',
                    longitude: '120.465823162',
                    latitude: '30.455260507',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103022',

                    label: '大型村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103022',
                    name: '浙江省/嘉兴市/海宁市/长安镇/大型村',
                    treePath: '330000/330400/330481/330481103/330481103022',
                    longitude: '120.428263041',
                    latitude: '30.4654398690001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103021',

                    label: '天明村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103021',
                    name: '浙江省/嘉兴市/海宁市/长安镇/天明村',
                    treePath: '330000/330400/330481/330481103/330481103021',
                    longitude: '120.405623701',
                    latitude: '30.430831466',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103020',

                    label: '德丰村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103020',
                    name: '浙江省/嘉兴市/海宁市/长安镇/德丰村',
                    treePath: '330000/330400/330481/330481103/330481103020',
                    longitude: '120.457288518',
                    latitude: '30.471139189',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103019',

                    label: '怡院社区',
                    parentId: '330481103',

                    children: null,

                    code: '330481103019',
                    name: '浙江省/嘉兴市/海宁市/长安镇/怡院社区',
                    treePath: '330000/330400/330481/330481103/330481103019',
                    longitude: '120.451450035',
                    latitude: '30.447670997',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103033',

                    label: '文海社区',
                    parentId: '330481103',

                    children: null,

                    code: '330481103033',
                    name: '浙江省/嘉兴市/海宁市/长安镇/文海社区',
                    treePath: '330000/330400/330481/330481103/330481103033',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103018',

                    label: '新民村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103018',
                    name: '浙江省/嘉兴市/海宁市/长安镇/新民村',
                    treePath: '330000/330400/330481/330481103/330481103018',
                    longitude: '120.436620319',
                    latitude: '30.4437275350001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103017',

                    label: '春澜社区',
                    parentId: '330481103',

                    children: null,

                    code: '330481103017',
                    name: '浙江省/嘉兴市/海宁市/长安镇/春澜社区',
                    treePath: '330000/330400/330481/330481103/330481103017',
                    longitude: '120.409516217',
                    latitude: '30.382602639',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103001',

                    label: '泰山村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103001',
                    name: '浙江省/嘉兴市/海宁市/长安镇/泰山村',
                    treePath: '330000/330400/330481/330481103/330481103001',
                    longitude: '120.425638601',
                    latitude: '30.4764179860001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103034',

                    label: '海川社区',
                    parentId: '330481103',

                    children: null,

                    code: '330481103034',
                    name: '浙江省/嘉兴市/海宁市/长安镇/海川社区',
                    treePath: '330000/330400/330481/330481103/330481103034',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103015',

                    label: '港湾社区',
                    parentId: '330481103',

                    children: null,

                    code: '330481103015',
                    name: '浙江省/嘉兴市/海宁市/长安镇/港湾社区',
                    treePath: '330000/330400/330481/330481103/330481103015',
                    longitude: '120.416371168',
                    latitude: '30.377689834',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103014',

                    label: '盐仓村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103014',
                    name: '浙江省/嘉兴市/海宁市/长安镇/盐仓村',
                    treePath: '330000/330400/330481/330481103/330481103014',
                    longitude: '120.42371219',
                    latitude: '30.394160304',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103013',

                    label: '红色村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103013',
                    name: '浙江省/嘉兴市/海宁市/长安镇/红色村',
                    treePath: '330000/330400/330481/330481103/330481103013',
                    longitude: '120.401784492',
                    latitude: '30.3883073860001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103030',

                    label: '老庄村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103030',
                    name: '浙江省/嘉兴市/海宁市/长安镇/老庄村',
                    treePath: '330000/330400/330481/330481103/330481103030',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103012',

                    label: '聆涛社区',
                    parentId: '330481103',

                    children: null,

                    code: '330481103012',
                    name: '浙江省/嘉兴市/海宁市/长安镇/聆涛社区',
                    treePath: '330000/330400/330481/330481103/330481103012',
                    longitude: '120.393706394',
                    latitude: '30.343513419',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103011',

                    label: '肖王村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103011',
                    name: '浙江省/嘉兴市/海宁市/长安镇/肖王村',
                    treePath: '330000/330400/330481/330481103/330481103011',
                    longitude: '120.455705796',
                    latitude: '30.4399666780001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103010',

                    label: '虹桥社区',
                    parentId: '330481103',

                    children: null,

                    code: '330481103010',
                    name: '浙江省/嘉兴市/海宁市/长安镇/虹桥社区',
                    treePath: '330000/330400/330481/330481103/330481103010',
                    longitude: '120.447612916',
                    latitude: '30.4574005470001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103009',

                    label: '虹金村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103009',
                    name: '浙江省/嘉兴市/海宁市/长安镇/虹金村',
                    treePath: '330000/330400/330481/330481103/330481103009',
                    longitude: '120.425606222',
                    latitude: '30.449499432',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103008',

                    label: '褚石村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103008',
                    name: '浙江省/嘉兴市/海宁市/长安镇/褚石村',
                    treePath: '330000/330400/330481/330481103/330481103008',
                    longitude: '120.429912872',
                    latitude: '30.420094428',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103007',

                    label: '辛江村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103007',
                    name: '浙江省/嘉兴市/海宁市/长安镇/辛江村',
                    treePath: '330000/330400/330481/330481103/330481103007',
                    longitude: '120.439103173',
                    latitude: '30.4666922330001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103006',

                    label: '金港村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103006',
                    name: '浙江省/嘉兴市/海宁市/长安镇/金港村',
                    treePath: '330000/330400/330481/330481103/330481103006',
                    longitude: '120.458629195',
                    latitude: '30.4123560950001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103031',

                    label: '长安镇本级社区',
                    parentId: '330481103',

                    children: null,

                    code: '330481103031',
                    name: '浙江省/嘉兴市/海宁市/长安镇/长安镇本级社区',
                    treePath: '330000/330400/330481/330481103/330481103031',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103005',

                    label: '长河社区',
                    parentId: '330481103',

                    children: null,

                    code: '330481103005',
                    name: '浙江省/嘉兴市/海宁市/长安镇/长河社区',
                    treePath: '330000/330400/330481/330481103/330481103005',
                    longitude: '120.443554761',
                    latitude: '30.4329002280001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103004',

                    label: '长郊社区',
                    parentId: '330481103',

                    children: null,

                    code: '330481103004',
                    name: '浙江省/嘉兴市/海宁市/长安镇/长郊社区',
                    treePath: '330000/330400/330481/330481103/330481103004',
                    longitude: '120.44125018',
                    latitude: '30.448719775',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103032',

                    label: '闻涛社区',
                    parentId: '330481103',

                    children: null,

                    code: '330481103032',
                    name: '浙江省/嘉兴市/海宁市/长安镇/闻涛社区',
                    treePath: '330000/330400/330481/330481103/330481103032',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103003',

                    label: '陆泽村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103003',
                    name: '浙江省/嘉兴市/海宁市/长安镇/陆泽村',
                    treePath: '330000/330400/330481/330481103/330481103003',
                    longitude: '120.431679024',
                    latitude: '30.491604556',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481103002',

                    label: '鹿耳村',
                    parentId: '330481103',

                    children: null,

                    code: '330481103002',
                    name: '浙江省/嘉兴市/海宁市/长安镇/鹿耳村',
                    treePath: '330000/330400/330481/330481103/330481103002',
                    longitude: '120.412479225',
                    latitude: '30.406063987',
                    level: 6,
                    source: '',
                  },
                ],

                code: '330481103',
                name: '浙江省/嘉兴市/海宁市/长安镇',
                treePath: '330000/330400/330481/330481103',
                longitude: '120.43783374165885',
                latitude: '30.44490768419835',
                level: 5,
              },
              {
                id: '330481001',

                label: '马桥街道',
                parentId: '330481',

                children: [
                  {
                    id: '330481001012',

                    label: '丰收社区',
                    parentId: '330481001',

                    children: null,

                    code: '330481001012',
                    name: '浙江省/嘉兴市/海宁市/马桥街道/丰收社区',
                    treePath: '330000/330400/330481/330481001/330481001012',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481001004',

                    label: '先锋社区',
                    parentId: '330481001',

                    children: null,

                    code: '330481001004',
                    name: '浙江省/嘉兴市/海宁市/马桥街道/先锋社区',
                    treePath: '330000/330400/330481/330481001/330481001004',
                    longitude: '120.682313255',
                    latitude: '30.478119539',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481001005',

                    label: '利众村',
                    parentId: '330481001',

                    children: null,

                    code: '330481001005',
                    name: '浙江省/嘉兴市/海宁市/马桥街道/利众村',
                    treePath: '330000/330400/330481/330481001/330481001005',
                    longitude: '120.727098054',
                    latitude: '30.45814883',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481001006',

                    label: '开元社区',
                    parentId: '330481001',

                    children: null,

                    code: '330481001006',
                    name: '浙江省/嘉兴市/海宁市/马桥街道/开元社区',
                    treePath: '330000/330400/330481/330481001/330481001006',
                    longitude: '120.664965932',
                    latitude: '30.495703188',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481001014',

                    label: '新丰社区',
                    parentId: '330481001',

                    children: null,

                    code: '330481001014',
                    name: '浙江省/嘉兴市/海宁市/马桥街道/新丰社区',
                    treePath: '330000/330400/330481/330481001/330481001014',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481001001',

                    label: '新场社区',
                    parentId: '330481001',

                    children: null,

                    code: '330481001001',
                    name: '浙江省/嘉兴市/海宁市/马桥街道/新场社区',
                    treePath: '330000/330400/330481/330481001/330481001001',
                    longitude: '120.687793954',
                    latitude: '30.46451073',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481001002',

                    label: '新塘村',
                    parentId: '330481001',

                    children: null,

                    code: '330481001002',
                    name: '浙江省/嘉兴市/海宁市/马桥街道/新塘村',
                    treePath: '330000/330400/330481/330481001/330481001002',
                    longitude: '120.705033704',
                    latitude: '30.44991615',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481001003',

                    label: '柏士社区',
                    parentId: '330481001',

                    children: null,

                    code: '330481001003',
                    name: '浙江省/嘉兴市/海宁市/马桥街道/柏士社区',
                    treePath: '330000/330400/330481/330481001/330481001003',
                    longitude: '120.659168913',
                    latitude: '30.4711848270001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481001007',

                    label: '桐溪社区',
                    parentId: '330481001',

                    children: null,

                    code: '330481001007',
                    name: '浙江省/嘉兴市/海宁市/马桥街道/桐溪社区',
                    treePath: '330000/330400/330481/330481001/330481001007',
                    longitude: '120.695157076',
                    latitude: '30.4813601770001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481001008',

                    label: '正阳村',
                    parentId: '330481001',

                    children: null,

                    code: '330481001008',
                    name: '浙江省/嘉兴市/海宁市/马桥街道/正阳村',
                    treePath: '330000/330400/330481/330481001/330481001008',
                    longitude: '120.695763544',
                    latitude: '30.452393177',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481001009',

                    label: '民胜村',
                    parentId: '330481001',

                    children: null,

                    code: '330481001009',
                    name: '浙江省/嘉兴市/海宁市/马桥街道/民胜村',
                    treePath: '330000/330400/330481/330481001/330481001009',
                    longitude: '120.730581143',
                    latitude: '30.4384720950001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481001013',

                    label: '湖塘社区',
                    parentId: '330481001',

                    children: null,

                    code: '330481001013',
                    name: '浙江省/嘉兴市/海宁市/马桥街道/湖塘社区',
                    treePath: '330000/330400/330481/330481001/330481001013',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481001010',

                    label: '经都社区',
                    parentId: '330481001',

                    children: null,

                    code: '330481001010',
                    name: '浙江省/嘉兴市/海宁市/马桥街道/经都社区',
                    treePath: '330000/330400/330481/330481001/330481001010',
                    longitude: '120.668343491',
                    latitude: '30.485507209',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481001011',

                    label: '马桥村',
                    parentId: '330481001',

                    children: null,

                    code: '330481001011',
                    name: '浙江省/嘉兴市/海宁市/马桥街道/马桥村',
                    treePath: '330000/330400/330481/330481001/330481001011',
                    longitude: '120.701608294',
                    latitude: '30.4678849480001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481001015',

                    label: '马桥街道本级社区',
                    parentId: '330481001',

                    children: null,

                    code: '330481001015',
                    name: '浙江省/嘉兴市/海宁市/马桥街道/马桥街道本级社区',
                    treePath: '330000/330400/330481/330481001/330481001015',

                    level: 6,
                    source: '',
                  },
                ],

                code: '330481001',
                name: '浙江省/嘉兴市/海宁市/马桥街道',
                treePath: '330000/330400/330481/330481001',
                longitude: '120.70465376581394',
                latitude: '30.464704083322726',
                level: 5,
              },
              {
                id: '330481108',

                label: '黄湾镇',
                parentId: '330481',

                children: [
                  {
                    id: '330481108006',

                    label: '五丰村',
                    parentId: '330481108',

                    children: null,

                    code: '330481108006',
                    name: '浙江省/嘉兴市/海宁市/黄湾镇/五丰村',
                    treePath: '330000/330400/330481/330481108/330481108006',
                    longitude: '120.802195883',
                    latitude: '30.3853170620001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481108011',

                    label: '凤凰社区',
                    parentId: '330481108',

                    children: null,

                    code: '330481108011',
                    name: '浙江省/嘉兴市/海宁市/黄湾镇/凤凰社区',
                    treePath: '330000/330400/330481/330481108/330481108011',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481108007',

                    label: '大临村',
                    parentId: '330481108',

                    children: null,

                    code: '330481108007',
                    name: '浙江省/嘉兴市/海宁市/黄湾镇/大临村',
                    treePath: '330000/330400/330481/330481108/330481108007',
                    longitude: '120.740545614',
                    latitude: '30.385315452',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481108008',

                    label: '尖山村',
                    parentId: '330481108',

                    children: null,

                    code: '330481108008',
                    name: '浙江省/嘉兴市/海宁市/黄湾镇/尖山村',
                    treePath: '330000/330400/330481/330481108/330481108008',
                    longitude: '120.786208186',
                    latitude: '30.355660028',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481108009',

                    label: '尖山社区',
                    parentId: '330481108',

                    children: null,

                    code: '330481108009',
                    name: '浙江省/嘉兴市/海宁市/黄湾镇/尖山社区',
                    treePath: '330000/330400/330481/330481108/330481108009',
                    longitude: '120.782375362',
                    latitude: '30.34377275',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481108010',

                    label: '金牛社区',
                    parentId: '330481108',

                    children: null,

                    code: '330481108010',
                    name: '浙江省/嘉兴市/海宁市/黄湾镇/金牛社区',
                    treePath: '330000/330400/330481/330481108/330481108010',

                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481108001',

                    label: '钱江村',
                    parentId: '330481108',

                    children: null,

                    code: '330481108001',
                    name: '浙江省/嘉兴市/海宁市/黄湾镇/钱江村',
                    treePath: '330000/330400/330481/330481108/330481108001',
                    longitude: '120.810421392',
                    latitude: '30.361598787',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481108002',

                    label: '闸口村',
                    parentId: '330481108',

                    children: null,

                    code: '330481108002',
                    name: '浙江省/嘉兴市/海宁市/黄湾镇/闸口村',
                    treePath: '330000/330400/330481/330481108/330481108002',
                    longitude: '120.753840098',
                    latitude: '30.3762361390001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481108003',

                    label: '黄山村',
                    parentId: '330481108',

                    children: null,

                    code: '330481108003',
                    name: '浙江省/嘉兴市/海宁市/黄湾镇/黄山村',
                    treePath: '330000/330400/330481/330481108/330481108003',
                    longitude: '120.778972954',
                    latitude: '30.3873439610001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481108004',

                    label: '黄湾村',
                    parentId: '330481108',

                    children: null,

                    code: '330481108004',
                    name: '浙江省/嘉兴市/海宁市/黄湾镇/黄湾村',
                    treePath: '330000/330400/330481/330481108/330481108004',
                    longitude: '120.79725668',
                    latitude: '30.3584512260001',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481108005',

                    label: '黄湾社区',
                    parentId: '330481108',

                    children: null,

                    code: '330481108005',
                    name: '浙江省/嘉兴市/海宁市/黄湾镇/黄湾社区',
                    treePath: '330000/330400/330481/330481108/330481108005',
                    longitude: '120.795740513',
                    latitude: '30.368510187',
                    level: 6,
                    source: '',
                  },
                  {
                    id: '330481108012',

                    label: '黄湾镇本级社区',
                    parentId: '330481108',

                    children: null,

                    code: '330481108012',
                    name: '浙江省/嘉兴市/海宁市/黄湾镇/黄湾镇本级社区',
                    treePath: '330000/330400/330481/330481108/330481108012',

                    level: 6,
                    source: '',
                  },
                ],

                code: '330481108',
                name: '浙江省/嘉兴市/海宁市/黄湾镇',
                treePath: '330000/330400/330481/330481108',
                longitude: '120.77975181827618',
                latitude: '30.377018800184178',
                level: 5,
              },
            ],

            code: '330481',
            name: '浙江省/嘉兴市/海宁市',
            treePath: '330000/330400/330481',

            level: 4,
          },
          {
            id: '330424',

            label: '海盐县',
            parentId: '330400',

            children: [
              {
                id: '330424103',

                label: '于城镇',
                parentId: '330424',

                children: null,

                code: '330424103',
                name: '浙江省/嘉兴市/海盐县/于城镇',
                treePath: '330000/330400/330424/330424103',

                level: 5,
              },
              {
                id: '330424003',

                label: '望海街道',
                parentId: '330424',

                children: null,

                code: '330424003',
                name: '浙江省/嘉兴市/海盐县/望海街道',
                treePath: '330000/330400/330424/330424003',

                level: 5,
              },
              {
                id: '330424001',

                label: '武原街道',
                parentId: '330424',

                children: null,

                code: '330424001',
                name: '浙江省/嘉兴市/海盐县/武原街道',
                treePath: '330000/330400/330424/330424001',

                level: 5,
              },
              {
                id: '330424101',

                label: '沈荡镇',
                parentId: '330424',

                children: null,

                code: '330424101',
                name: '浙江省/嘉兴市/海盐县/沈荡镇',
                treePath: '330000/330400/330424/330424101',

                level: 5,
              },
              {
                id: '330424105',

                label: '澉浦镇',
                parentId: '330424',

                children: null,

                code: '330424105',
                name: '浙江省/嘉兴市/海盐县/澉浦镇',
                treePath: '330000/330400/330424/330424105',

                level: 5,
              },
              {
                id: '330424102',

                label: '百步镇',
                parentId: '330424',

                children: null,

                code: '330424102',
                name: '浙江省/嘉兴市/海盐县/百步镇',
                treePath: '330000/330400/330424/330424102',

                level: 5,
              },
              {
                id: '330424002',

                label: '秦山街道',
                parentId: '330424',

                children: null,

                code: '330424002',
                name: '浙江省/嘉兴市/海盐县/秦山街道',
                treePath: '330000/330400/330424/330424002',

                level: 5,
              },
              {
                id: '330424004',

                label: '西塘桥街道',
                parentId: '330424',

                children: null,

                code: '330424004',
                name: '浙江省/嘉兴市/海盐县/西塘桥街道',
                treePath: '330000/330400/330424/330424004',

                level: 5,
              },
              {
                id: '330424106',

                label: '通元镇',
                parentId: '330424',

                children: null,

                code: '330424106',
                name: '浙江省/嘉兴市/海盐县/通元镇',
                treePath: '330000/330400/330424/330424106',

                level: 5,
              },
            ],

            code: '330424',
            name: '浙江省/嘉兴市/海盐县',
            treePath: '330000/330400/330424',

            level: 4,
          },
          {
            id: '330411',

            label: '秀洲区',
            parentId: '330400',

            children: [
              {
                id: '330411004',

                label: '嘉北街道',
                parentId: '330411',

                children: null,

                code: '330411004',
                name: '浙江省/嘉兴市/秀洲区/嘉北街道',
                treePath: '330000/330400/330411/330411004',

                level: 5,
              },
              {
                id: '330411005',

                label: '塘汇街道',
                parentId: '330411',

                children: null,

                code: '330411005',
                name: '浙江省/嘉兴市/秀洲区/塘汇街道',
                treePath: '330000/330400/330411/330411005',

                level: 5,
              },
              {
                id: '330411002',

                label: '新城街道',
                parentId: '330411',

                children: null,

                code: '330411002',
                name: '浙江省/嘉兴市/秀洲区/新城街道',
                treePath: '330000/330400/330411/330411002',

                level: 5,
              },
              {
                id: '330411104',

                label: '新塍镇',
                parentId: '330411',

                children: null,

                code: '330411104',
                name: '浙江省/嘉兴市/秀洲区/新塍镇',
                treePath: '330000/330400/330411/330411104',

                level: 5,
              },
              {
                id: '330411103',

                label: '油车港镇',
                parentId: '330411',

                children: null,

                code: '330411103',
                name: '浙江省/嘉兴市/秀洲区/油车港镇',
                treePath: '330000/330400/330411/330411103',

                level: 5,
              },
              {
                id: '330411106',

                label: '洪合镇',
                parentId: '330411',

                children: null,

                code: '330411106',
                name: '浙江省/嘉兴市/秀洲区/洪合镇',
                treePath: '330000/330400/330411/330411106',

                level: 5,
              },
              {
                id: '330411105',

                label: '王店镇',
                parentId: '330411',

                children: null,

                code: '330411105',
                name: '浙江省/嘉兴市/秀洲区/王店镇',
                treePath: '330000/330400/330411/330411105',

                level: 5,
              },
              {
                id: '330411101',

                label: '王江泾镇',
                parentId: '330411',

                children: null,

                code: '330411101',
                name: '浙江省/嘉兴市/秀洲区/王江泾镇',
                treePath: '330000/330400/330411/330411101',

                level: 5,
              },
              {
                id: '330411003',

                label: '高照街道',
                parentId: '330411',

                children: null,

                code: '330411003',
                name: '浙江省/嘉兴市/秀洲区/高照街道',
                treePath: '330000/330400/330411/330411003',

                level: 5,
              },
            ],

            code: '330411',
            name: '浙江省/嘉兴市/秀洲区',
            treePath: '330000/330400/330411',

            level: 4,
          },
        ],

        code: '330400',
        name: '浙江省/嘉兴市',
        treePath: '330000/330400',

        level: 3,
      },
      {
        id: '330200',

        label: '宁波市',
        parentId: '330000',

        children: [
          {
            id: '330281',

            label: '余姚市',
            parentId: '330200',

            children: [
              {
                id: '330281109',

                label: '丈亭镇',
                parentId: '330281',

                children: null,

                code: '330281109',
                name: '浙江省/宁波市/余姚市/丈亭镇',
                treePath: '330000/330200/330281/330281109',

                level: 5,
              },
              {
                id: '330281110',

                label: '三七市镇',
                parentId: '330281',

                children: null,

                code: '330281110',
                name: '浙江省/宁波市/余姚市/三七市镇',
                treePath: '330000/330200/330281/330281110',

                level: 5,
              },
              {
                id: '330281100',

                label: '临山镇',
                parentId: '330281',

                children: null,

                code: '330281100',
                name: '浙江省/宁波市/余姚市/临山镇',
                treePath: '330000/330200/330281/330281100',

                level: 5,
              },
              {
                id: '330281005',

                label: '低塘街道',
                parentId: '330281',

                children: null,

                code: '330281005',
                name: '浙江省/宁波市/余姚市/低塘街道',
                treePath: '330000/330200/330281/330281005',

                level: 5,
              },
              {
                id: '330281003',

                label: '兰江街道',
                parentId: '330281',

                children: null,

                code: '330281003',
                name: '浙江省/宁波市/余姚市/兰江街道',
                treePath: '330000/330200/330281/330281003',

                level: 5,
              },
              {
                id: '330281002',

                label: '凤山街道',
                parentId: '330281',

                children: null,

                code: '330281002',
                name: '浙江省/宁波市/余姚市/凤山街道',
                treePath: '330000/330200/330281/330281002',

                level: 5,
              },
              {
                id: '330281116',

                label: '四明山镇',
                parentId: '330281',

                children: null,

                code: '330281116',
                name: '浙江省/宁波市/余姚市/四明山镇',
                treePath: '330000/330200/330281/330281116',

                level: 5,
              },
              {
                id: '330281115',

                label: '大岚镇',
                parentId: '330281',

                children: null,

                code: '330281115',
                name: '浙江省/宁波市/余姚市/大岚镇',
                treePath: '330000/330200/330281/330281115',

                level: 5,
              },
              {
                id: '330281112',

                label: '大隐镇',
                parentId: '330281',

                children: null,

                code: '330281112',
                name: '浙江省/宁波市/余姚市/大隐镇',
                treePath: '330000/330200/330281/330281112',

                level: 5,
              },
              {
                id: '330281102',

                label: '小曹娥镇',
                parentId: '330281',

                children: null,

                code: '330281102',
                name: '浙江省/宁波市/余姚市/小曹娥镇',
                treePath: '330000/330200/330281/330281102',

                level: 5,
              },
              {
                id: '330281006',

                label: '朗霞街道',
                parentId: '330281',

                children: null,

                code: '330281006',
                name: '浙江省/宁波市/余姚市/朗霞街道',
                treePath: '330000/330200/330281/330281006',

                level: 5,
              },
              {
                id: '330281114',

                label: '梁弄镇',
                parentId: '330281',

                children: null,

                code: '330281114',
                name: '浙江省/宁波市/余姚市/梁弄镇',
                treePath: '330000/330200/330281/330281114',

                level: 5,
              },
              {
                id: '330281001',

                label: '梨洲街道',
                parentId: '330281',

                children: null,

                code: '330281001',
                name: '浙江省/宁波市/余姚市/梨洲街道',
                treePath: '330000/330200/330281/330281001',

                level: 5,
              },
              {
                id: '330281111',

                label: '河姆渡镇',
                parentId: '330281',

                children: null,

                code: '330281111',
                name: '浙江省/宁波市/余姚市/河姆渡镇',
                treePath: '330000/330200/330281/330281111',

                level: 5,
              },
              {
                id: '330281103',

                label: '泗门镇',
                parentId: '330281',

                children: null,

                code: '330281103',
                name: '浙江省/宁波市/余姚市/泗门镇',
                treePath: '330000/330200/330281/330281103',

                level: 5,
              },
              {
                id: '330281108',

                label: '牟山镇',
                parentId: '330281',

                children: null,

                code: '330281108',
                name: '浙江省/宁波市/余姚市/牟山镇',
                treePath: '330000/330200/330281/330281108',

                level: 5,
              },
              {
                id: '330281004',

                label: '阳明街道',
                parentId: '330281',

                children: null,

                code: '330281004',
                name: '浙江省/宁波市/余姚市/阳明街道',
                treePath: '330000/330200/330281/330281004',

                level: 5,
              },
              {
                id: '330281113',

                label: '陆埠镇',
                parentId: '330281',

                children: null,

                code: '330281113',
                name: '浙江省/宁波市/余姚市/陆埠镇',
                treePath: '330000/330200/330281/330281113',

                level: 5,
              },
              {
                id: '330281106',

                label: '马渚镇',
                parentId: '330281',

                children: null,

                code: '330281106',
                name: '浙江省/宁波市/余姚市/马渚镇',
                treePath: '330000/330200/330281/330281106',

                level: 5,
              },
              {
                id: '330281201',

                label: '鹿亭乡',
                parentId: '330281',

                children: null,

                code: '330281201',
                name: '浙江省/宁波市/余姚市/鹿亭乡',
                treePath: '330000/330200/330281/330281201',

                level: 5,
              },
              {
                id: '330281101',

                label: '黄家埠镇',
                parentId: '330281',

                children: null,

                code: '330281101',
                name: '浙江省/宁波市/余姚市/黄家埠镇',
                treePath: '330000/330200/330281/330281101',

                level: 5,
              },
            ],

            code: '330281',
            name: '浙江省/宁波市/余姚市',
            treePath: '330000/330200/330281',

            level: 4,
          },
          {
            id: '330206',

            label: '北仑区',
            parentId: '330200',

            children: [
              {
                id: '330206007',

                label: '大榭街道',
                parentId: '330206',

                children: null,

                code: '330206007',
                name: '浙江省/宁波市/北仑区/大榭街道',
                treePath: '330000/330200/330206/330206007',

                level: 5,
              },
              {
                id: '330206003',

                label: '大碶街道',
                parentId: '330206',

                children: null,

                code: '330206003',
                name: '浙江省/宁波市/北仑区/大碶街道',
                treePath: '330000/330200/330206/330206003',

                level: 5,
              },
              {
                id: '330206002',

                label: '小港街道',
                parentId: '330206',

                children: null,

                code: '330206002',
                name: '浙江省/宁波市/北仑区/小港街道',
                treePath: '330000/330200/330206/330206002',

                level: 5,
              },
              {
                id: '330206006',

                label: '戚家山街道',
                parentId: '330206',

                children: null,

                code: '330206006',
                name: '浙江省/宁波市/北仑区/戚家山街道',
                treePath: '330000/330200/330206/330206006',

                level: 5,
              },
              {
                id: '330206001',

                label: '新碶街道',
                parentId: '330206',

                children: null,

                code: '330206001',
                name: '浙江省/宁波市/北仑区/新碶街道',
                treePath: '330000/330200/330206/330206001',

                level: 5,
              },
              {
                id: '330206009',

                label: '春晓街道',
                parentId: '330206',

                children: null,

                code: '330206009',
                name: '浙江省/宁波市/北仑区/春晓街道',
                treePath: '330000/330200/330206/330206009',

                level: 5,
              },
              {
                id: '330206005',

                label: '柴桥街道',
                parentId: '330206',

                children: null,

                code: '330206005',
                name: '浙江省/宁波市/北仑区/柴桥街道',
                treePath: '330000/330200/330206/330206005',

                level: 5,
              },
              {
                id: '330206008',

                label: '梅山街道',
                parentId: '330206',

                children: null,

                code: '330206008',
                name: '浙江省/宁波市/北仑区/梅山街道',
                treePath: '330000/330200/330206/330206008',

                level: 5,
              },
              {
                id: '330206010',

                label: '白峰街道',
                parentId: '330206',

                children: null,

                code: '330206010',
                name: '浙江省/宁波市/北仑区/白峰街道',
                treePath: '330000/330200/330206/330206010',

                level: 5,
              },
              {
                id: '330206004',

                label: '霞浦街道',
                parentId: '330206',

                children: null,

                code: '330206004',
                name: '浙江省/宁波市/北仑区/霞浦街道',
                treePath: '330000/330200/330206/330206004',

                level: 5,
              },
            ],

            code: '330206',
            name: '浙江省/宁波市/北仑区',
            treePath: '330000/330200/330206',

            level: 4,
          },
          {
            id: '330213',

            label: '奉化区',
            parentId: '330200',

            children: [
              {
                id: '330213107',

                label: '大堰镇',
                parentId: '330213',

                children: null,

                code: '330213107',
                name: '浙江省/宁波市/奉化区/大堰镇',
                treePath: '330000/330200/330213/330213107',

                level: 5,
              },
              {
                id: '330213008',

                label: '尚田街道',
                parentId: '330213',

                children: null,

                code: '330213008',
                name: '浙江省/宁波市/奉化区/尚田街道',
                treePath: '330000/330200/330213/330213008',

                level: 5,
              },
              {
                id: '330213002',

                label: '岳林街道',
                parentId: '330213',

                children: null,

                code: '330213002',
                name: '浙江省/宁波市/奉化区/岳林街道',
                treePath: '330000/330200/330213/330213002',

                level: 5,
              },
              {
                id: '330213006',

                label: '方桥街道',
                parentId: '330213',

                children: null,

                code: '330213006',
                name: '浙江省/宁波市/奉化区/方桥街道',
                treePath: '330000/330200/330213/330213006',

                level: 5,
              },
              {
                id: '330213108',

                label: '松岙镇',
                parentId: '330213',

                children: null,

                code: '330213108',
                name: '浙江省/宁波市/奉化区/松岙镇',
                treePath: '330000/330200/330213/330213108',

                level: 5,
              },
              {
                id: '330213003',

                label: '江口街道',
                parentId: '330213',

                children: null,

                code: '330213003',
                name: '浙江省/宁波市/奉化区/江口街道',
                treePath: '330000/330200/330213/330213003',

                level: 5,
              },
              {
                id: '330213100',

                label: '溪口镇',
                parentId: '330213',

                children: null,

                code: '330213100',
                name: '浙江省/宁波市/奉化区/溪口镇',
                treePath: '330000/330200/330213/330213100',

                level: 5,
              },
              {
                id: '330213007',

                label: '莼湖街道',
                parentId: '330213',

                children: null,

                code: '330213007',
                name: '浙江省/宁波市/奉化区/莼湖街道',
                treePath: '330000/330200/330213/330213007',

                level: 5,
              },
              {
                id: '330213005',

                label: '萧王庙街道',
                parentId: '330213',

                children: null,

                code: '330213005',
                name: '浙江省/宁波市/奉化区/萧王庙街道',
                treePath: '330000/330200/330213/330213005',

                level: 5,
              },
              {
                id: '330213106',

                label: '裘村镇',
                parentId: '330213',

                children: null,

                code: '330213106',
                name: '浙江省/宁波市/奉化区/裘村镇',
                treePath: '330000/330200/330213/330213106',

                level: 5,
              },
              {
                id: '330213004',

                label: '西坞街道',
                parentId: '330213',

                children: null,

                code: '330213004',
                name: '浙江省/宁波市/奉化区/西坞街道',
                treePath: '330000/330200/330213/330213004',

                level: 5,
              },
              {
                id: '330213001',

                label: '锦屏街道',
                parentId: '330213',

                children: null,

                code: '330213001',
                name: '浙江省/宁波市/奉化区/锦屏街道',
                treePath: '330000/330200/330213/330213001',

                level: 5,
              },
            ],

            code: '330213',
            name: '浙江省/宁波市/奉化区',
            treePath: '330000/330200/330213',

            level: 4,
          },
          {
            id: '330226',

            label: '宁海县',
            parentId: '330200',

            children: [
              {
                id: '330226104',

                label: '一市镇',
                parentId: '330226',

                children: null,

                code: '330226104',
                name: '浙江省/宁波市/宁海县/一市镇',
                treePath: '330000/330200/330226/330226104',

                level: 5,
              },
              {
                id: '330226106',

                label: '前童镇',
                parentId: '330226',

                children: null,

                code: '330226106',
                name: '浙江省/宁波市/宁海县/前童镇',
                treePath: '330000/330200/330226/330226106',

                level: 5,
              },
              {
                id: '330226102',

                label: '力洋镇',
                parentId: '330226',

                children: null,

                code: '330226102',
                name: '浙江省/宁波市/宁海县/力洋镇',
                treePath: '330000/330200/330226/330226102',

                level: 5,
              },
              {
                id: '330226109',

                label: '大佳何镇',
                parentId: '330226',

                children: null,

                code: '330226109',
                name: '浙江省/宁波市/宁海县/大佳何镇',
                treePath: '330000/330200/330226/330226109',

                level: 5,
              },
              {
                id: '330226105',

                label: '岔路镇',
                parentId: '330226',

                children: null,

                code: '330226105',
                name: '浙江省/宁波市/宁海县/岔路镇',
                treePath: '330000/330200/330226/330226105',

                level: 5,
              },
              {
                id: '330226110',

                label: '强蛟镇',
                parentId: '330226',

                children: null,

                code: '330226110',
                name: '浙江省/宁波市/宁海县/强蛟镇',
                treePath: '330000/330200/330226/330226110',

                level: 5,
              },
              {
                id: '330226002',

                label: '桃源街道',
                parentId: '330226',

                children: null,

                code: '330226002',
                name: '浙江省/宁波市/宁海县/桃源街道',
                treePath: '330000/330200/330226/330226002',

                level: 5,
              },
              {
                id: '330226107',

                label: '桑洲镇',
                parentId: '330226',

                children: null,

                code: '330226107',
                name: '浙江省/宁波市/宁海县/桑洲镇',
                treePath: '330000/330200/330226/330226107',

                level: 5,
              },
              {
                id: '330226004',

                label: '桥头胡街道',
                parentId: '330226',

                children: null,

                code: '330226004',
                name: '浙江省/宁波市/宁海县/桥头胡街道',
                treePath: '330000/330200/330226/330226004',

                level: 5,
              },
              {
                id: '330226003',

                label: '梅林街道',
                parentId: '330226',

                children: null,

                code: '330226003',
                name: '浙江省/宁波市/宁海县/梅林街道',
                treePath: '330000/330200/330226/330226003',

                level: 5,
              },
              {
                id: '330226112',

                label: '深甽镇',
                parentId: '330226',

                children: null,

                code: '330226112',
                name: '浙江省/宁波市/宁海县/深甽镇',
                treePath: '330000/330200/330226/330226112',

                level: 5,
              },
              {
                id: '330226200',

                label: '胡陈乡',
                parentId: '330226',

                children: null,

                code: '330226200',
                name: '浙江省/宁波市/宁海县/胡陈乡',
                treePath: '330000/330200/330226/330226200',

                level: 5,
              },
              {
                id: '330226201',

                label: '茶院乡',
                parentId: '330226',

                children: null,

                code: '330226201',
                name: '浙江省/宁波市/宁海县/茶院乡',
                treePath: '330000/330200/330226/330226201',

                level: 5,
              },
              {
                id: '330226111',

                label: '西店镇',
                parentId: '330226',

                children: null,

                code: '330226111',
                name: '浙江省/宁波市/宁海县/西店镇',
                treePath: '330000/330200/330226/330226111',

                level: 5,
              },
              {
                id: '330226202',

                label: '越溪乡',
                parentId: '330226',

                children: null,

                code: '330226202',
                name: '浙江省/宁波市/宁海县/越溪乡',
                treePath: '330000/330200/330226/330226202',

                level: 5,
              },
              {
                id: '330226001',

                label: '跃龙街道',
                parentId: '330226',

                children: null,

                code: '330226001',
                name: '浙江省/宁波市/宁海县/跃龙街道',
                treePath: '330000/330200/330226/330226001',

                level: 5,
              },
              {
                id: '330226101',

                label: '长街镇',
                parentId: '330226',

                children: null,

                code: '330226101',
                name: '浙江省/宁波市/宁海县/长街镇',
                treePath: '330000/330200/330226/330226101',

                level: 5,
              },
              {
                id: '330226108',

                label: '黄坛镇',
                parentId: '330226',

                children: null,

                code: '330226108',
                name: '浙江省/宁波市/宁海县/黄坛镇',
                treePath: '330000/330200/330226/330226108',

                level: 5,
              },
            ],

            code: '330226',
            name: '浙江省/宁波市/宁海县',
            treePath: '330000/330200/330226',

            level: 4,
          },
          {
            id: '330282',

            label: '慈溪市',
            parentId: '330200',

            children: [
              {
                id: '330282110',

                label: '匡堰镇',
                parentId: '330282',

                children: null,

                code: '330282110',
                name: '浙江省/宁波市/慈溪市/匡堰镇',
                treePath: '330000/330200/330282/330282110',

                level: 5,
              },
              {
                id: '330282005',

                label: '古塘街道',
                parentId: '330282',

                children: null,

                code: '330282005',
                name: '浙江省/宁波市/慈溪市/古塘街道',
                treePath: '330000/330200/330282/330282005',

                level: 5,
              },
              {
                id: '330282121',

                label: '周巷镇',
                parentId: '330282',

                children: null,

                code: '330282121',
                name: '浙江省/宁波市/慈溪市/周巷镇',
                treePath: '330000/330200/330282/330282121',

                level: 5,
              },
              {
                id: '330282003',

                label: '坎墩街道',
                parentId: '330282',

                children: null,

                code: '330282003',
                name: '浙江省/宁波市/慈溪市/坎墩街道',
                treePath: '330000/330200/330282/330282003',

                level: 5,
              },
              {
                id: '330282002',

                label: '宗汉街道',
                parentId: '330282',

                children: null,

                code: '330282002',
                name: '浙江省/宁波市/慈溪市/宗汉街道',
                treePath: '330000/330200/330282/330282002',

                level: 5,
              },
              {
                id: '330282116',

                label: '崇寿镇',
                parentId: '330282',

                children: null,

                code: '330282116',
                name: '浙江省/宁波市/慈溪市/崇寿镇',
                treePath: '330000/330200/330282/330282116',

                level: 5,
              },
              {
                id: '330282118',

                label: '庵东镇',
                parentId: '330282',

                children: null,

                code: '330282118',
                name: '浙江省/宁波市/慈溪市/庵东镇',
                treePath: '330000/330200/330282/330282118',

                level: 5,
              },
              {
                id: '330282401',

                label: '慈溪市林场',
                parentId: '330282',

                children: null,

                code: '330282401',
                name: '浙江省/宁波市/慈溪市/慈溪市林场',
                treePath: '330000/330200/330282/330282401',

                level: 5,
              },
              {
                id: '330282104',

                label: '掌起镇',
                parentId: '330282',

                children: null,

                code: '330282104',
                name: '浙江省/宁波市/慈溪市/掌起镇',
                treePath: '330000/330200/330282/330282104',

                level: 5,
              },
              {
                id: '330282112',

                label: '新浦镇',
                parentId: '330282',

                children: null,

                code: '330282112',
                name: '浙江省/宁波市/慈溪市/新浦镇',
                treePath: '330000/330200/330282/330282112',

                level: 5,
              },
              {
                id: '330282109',

                label: '桥头镇',
                parentId: '330282',

                children: null,

                code: '330282109',
                name: '浙江省/宁波市/慈溪市/桥头镇',
                treePath: '330000/330200/330282/330282109',

                level: 5,
              },
              {
                id: '330282114',

                label: '横河镇',
                parentId: '330282',

                children: null,

                code: '330282114',
                name: '浙江省/宁波市/慈溪市/横河镇',
                treePath: '330000/330200/330282/330282114',

                level: 5,
              },
              {
                id: '330282001',

                label: '浒山街道',
                parentId: '330282',

                children: null,

                code: '330282001',
                name: '浙江省/宁波市/慈溪市/浒山街道',
                treePath: '330000/330200/330282/330282001',

                level: 5,
              },
              {
                id: '330282004',

                label: '白沙路街道',
                parentId: '330282',

                children: null,

                code: '330282004',
                name: '浙江省/宁波市/慈溪市/白沙路街道',
                treePath: '330000/330200/330282/330282004',

                level: 5,
              },
              {
                id: '330282113',

                label: '胜山镇',
                parentId: '330282',

                children: null,

                code: '330282113',
                name: '浙江省/宁波市/慈溪市/胜山镇',
                treePath: '330000/330200/330282/330282113',

                level: 5,
              },
              {
                id: '330282107',

                label: '观海卫镇',
                parentId: '330282',

                children: null,

                code: '330282107',
                name: '浙江省/宁波市/慈溪市/观海卫镇',
                treePath: '330000/330200/330282/330282107',

                level: 5,
              },
              {
                id: '330282111',

                label: '逍林镇',
                parentId: '330282',

                children: null,

                code: '330282111',
                name: '浙江省/宁波市/慈溪市/逍林镇',
                treePath: '330000/330200/330282/330282111',

                level: 5,
              },
              {
                id: '330282120',

                label: '长河镇',
                parentId: '330282',

                children: null,

                code: '330282120',
                name: '浙江省/宁波市/慈溪市/长河镇',
                treePath: '330000/330200/330282/330282120',

                level: 5,
              },
              {
                id: '330282108',

                label: '附海镇',
                parentId: '330282',

                children: null,

                code: '330282108',
                name: '浙江省/宁波市/慈溪市/附海镇',
                treePath: '330000/330200/330282/330282108',

                level: 5,
              },
              {
                id: '330282101',

                label: '龙山镇',
                parentId: '330282',

                children: null,

                code: '330282101',
                name: '浙江省/宁波市/慈溪市/龙山镇',
                treePath: '330000/330200/330282/330282101',

                level: 5,
              },
            ],

            code: '330282',
            name: '浙江省/宁波市/慈溪市',
            treePath: '330000/330200/330282',

            level: 4,
          },
          {
            id: '330205',

            label: '江北区',
            parentId: '330200',

            children: [
              {
                id: '330205008',

                label: '前江街道',
                parentId: '330205',

                children: null,

                code: '330205008',
                name: '浙江省/宁波市/江北区/前江街道',
                treePath: '330000/330200/330205/330205008',

                level: 5,
              },
              {
                id: '330205001',

                label: '外滩街道',
                parentId: '330205',

                children: null,

                code: '330205001',
                name: '浙江省/宁波市/江北区/外滩街道',
                treePath: '330000/330200/330205/330205001',

                level: 5,
              },
              {
                id: '330205003',

                label: '孔浦街道',
                parentId: '330205',

                children: null,

                code: '330205003',
                name: '浙江省/宁波市/江北区/孔浦街道',
                treePath: '330000/330200/330205/330205003',

                level: 5,
              },
              {
                id: '330205005',

                label: '庄桥街道',
                parentId: '330205',

                children: null,

                code: '330205005',
                name: '浙江省/宁波市/江北区/庄桥街道',
                treePath: '330000/330200/330205/330205005',

                level: 5,
              },
              {
                id: '330205103',

                label: '慈城镇',
                parentId: '330205',

                children: null,

                code: '330205103',
                name: '浙江省/宁波市/江北区/慈城镇',
                treePath: '330000/330200/330205/330205103',

                level: 5,
              },
              {
                id: '330205004',

                label: '文教街道',
                parentId: '330205',

                children: null,

                code: '330205004',
                name: '浙江省/宁波市/江北区/文教街道',
                treePath: '330000/330200/330205/330205004',

                level: 5,
              },
              {
                id: '330205007',

                label: '洪塘街道',
                parentId: '330205',

                children: null,

                code: '330205007',
                name: '浙江省/宁波市/江北区/洪塘街道',
                treePath: '330000/330200/330205/330205007',

                level: 5,
              },
              {
                id: '330205006',

                label: '甬江街道',
                parentId: '330205',

                children: null,

                code: '330205006',
                name: '浙江省/宁波市/江北区/甬江街道',
                treePath: '330000/330200/330205/330205006',

                level: 5,
              },
            ],

            code: '330205',
            name: '浙江省/宁波市/江北区',
            treePath: '330000/330200/330205',

            level: 4,
          },
          {
            id: '330203',

            label: '海曙区',
            parentId: '330200',

            children: [
              {
                id: '330203001',

                label: '南门街道',
                parentId: '330203',

                children: null,

                code: '330203001',
                name: '浙江省/宁波市/海曙区/南门街道',
                treePath: '330000/330200/330203/330203001',

                level: 5,
              },
              {
                id: '330203103',

                label: '古林镇',
                parentId: '330203',

                children: null,

                code: '330203103',
                name: '浙江省/宁波市/海曙区/古林镇',
                treePath: '330000/330200/330203/330203103',

                level: 5,
              },
              {
                id: '330203004',

                label: '月湖街道',
                parentId: '330203',

                children: null,

                code: '330203004',
                name: '浙江省/宁波市/海曙区/月湖街道',
                treePath: '330000/330200/330203/330203004',

                level: 5,
              },
              {
                id: '330203008',

                label: '望春街道',
                parentId: '330203',

                children: null,

                code: '330203008',
                name: '浙江省/宁波市/海曙区/望春街道',
                treePath: '330000/330200/330203/330203008',

                level: 5,
              },
              {
                id: '330203101',

                label: '横街镇',
                parentId: '330203',

                children: null,

                code: '330203101',
                name: '浙江省/宁波市/海曙区/横街镇',
                treePath: '330000/330200/330203/330203101',

                level: 5,
              },
              {
                id: '330203007',

                label: '段塘街道',
                parentId: '330203',

                children: null,

                code: '330203007',
                name: '浙江省/宁波市/海曙区/段塘街道',
                treePath: '330000/330200/330203/330203007',

                level: 5,
              },
              {
                id: '330203002',

                label: '江厦街道',
                parentId: '330203',

                children: null,

                code: '330203002',
                name: '浙江省/宁波市/海曙区/江厦街道',
                treePath: '330000/330200/330203/330203002',

                level: 5,
              },
              {
                id: '330203104',

                label: '洞桥镇',
                parentId: '330203',

                children: null,

                code: '330203104',
                name: '浙江省/宁波市/海曙区/洞桥镇',
                treePath: '330000/330200/330203/330203104',

                level: 5,
              },
              {
                id: '330203006',

                label: '白云街道',
                parentId: '330203',

                children: null,

                code: '330203006',
                name: '浙江省/宁波市/海曙区/白云街道',
                treePath: '330000/330200/330203/330203006',

                level: 5,
              },
              {
                id: '330203009',

                label: '石碶街道',
                parentId: '330203',

                children: null,

                code: '330203009',
                name: '浙江省/宁波市/海曙区/石碶街道',
                treePath: '330000/330200/330203/330203009',

                level: 5,
              },
              {
                id: '330203106',

                label: '章水镇',
                parentId: '330203',

                children: null,

                code: '330203106',
                name: '浙江省/宁波市/海曙区/章水镇',
                treePath: '330000/330200/330203/330203106',

                level: 5,
              },
              {
                id: '330203003',

                label: '西门街道',
                parentId: '330203',

                children: null,

                code: '330203003',
                name: '浙江省/宁波市/海曙区/西门街道',
                treePath: '330000/330200/330203/330203003',

                level: 5,
              },
              {
                id: '330203105',

                label: '鄞江镇',
                parentId: '330203',

                children: null,

                code: '330203105',
                name: '浙江省/宁波市/海曙区/鄞江镇',
                treePath: '330000/330200/330203/330203105',

                level: 5,
              },
              {
                id: '330203102',

                label: '集士港镇',
                parentId: '330203',

                children: null,

                code: '330203102',
                name: '浙江省/宁波市/海曙区/集士港镇',
                treePath: '330000/330200/330203/330203102',

                level: 5,
              },
              {
                id: '330203100',

                label: '高桥镇',
                parentId: '330203',

                children: null,

                code: '330203100',
                name: '浙江省/宁波市/海曙区/高桥镇',
                treePath: '330000/330200/330203/330203100',

                level: 5,
              },
              {
                id: '330203005',

                label: '鼓楼街道',
                parentId: '330203',

                children: null,

                code: '330203005',
                name: '浙江省/宁波市/海曙区/鼓楼街道',
                treePath: '330000/330200/330203/330203005',

                level: 5,
              },
              {
                id: '330203200',

                label: '龙观乡',
                parentId: '330203',

                children: null,

                code: '330203200',
                name: '浙江省/宁波市/海曙区/龙观乡',
                treePath: '330000/330200/330203/330203200',

                level: 5,
              },
            ],

            code: '330203',
            name: '浙江省/宁波市/海曙区',
            treePath: '330000/330200/330203',

            level: 4,
          },
          {
            id: '330225',

            label: '象山县',
            parentId: '330200',

            children: [
              {
                id: '330225200',

                label: '东陈乡',
                parentId: '330225',

                children: null,

                code: '330225200',
                name: '浙江省/宁波市/象山县/东陈乡',
                treePath: '330000/330200/330225/330225200',

                level: 5,
              },
              {
                id: '330225001',

                label: '丹东街道',
                parentId: '330225',

                children: null,

                code: '330225001',
                name: '浙江省/宁波市/象山县/丹东街道',
                treePath: '330000/330200/330225/330225001',

                level: 5,
              },
              {
                id: '330225002',

                label: '丹西街道',
                parentId: '330225',

                children: null,

                code: '330225002',
                name: '浙江省/宁波市/象山县/丹西街道',
                treePath: '330000/330200/330225/330225002',

                level: 5,
              },
              {
                id: '330225105',

                label: '墙头镇',
                parentId: '330225',

                children: null,

                code: '330225105',
                name: '浙江省/宁波市/象山县/墙头镇',
                treePath: '330000/330200/330225/330225105',

                level: 5,
              },
              {
                id: '330225109',

                label: '大徐镇',
                parentId: '330225',

                children: null,

                code: '330225109',
                name: '浙江省/宁波市/象山县/大徐镇',
                treePath: '330000/330200/330225/330225109',

                level: 5,
              },
              {
                id: '330225107',

                label: '定塘镇',
                parentId: '330225',

                children: null,

                code: '330225107',
                name: '浙江省/宁波市/象山县/定塘镇',
                treePath: '330000/330200/330225/330225107',

                level: 5,
              },
              {
                id: '330225110',

                label: '新桥镇',
                parentId: '330225',

                children: null,

                code: '330225110',
                name: '浙江省/宁波市/象山县/新桥镇',
                treePath: '330000/330200/330225/330225110',

                level: 5,
              },
              {
                id: '330225201',

                label: '晓塘乡',
                parentId: '330225',

                children: null,

                code: '330225201',
                name: '浙江省/宁波市/象山县/晓塘乡',
                treePath: '330000/330200/330225/330225201',

                level: 5,
              },
              {
                id: '330225106',

                label: '泗洲头镇',
                parentId: '330225',

                children: null,

                code: '330225106',
                name: '浙江省/宁波市/象山县/泗洲头镇',
                treePath: '330000/330200/330225/330225106',

                level: 5,
              },
              {
                id: '330225108',

                label: '涂茨镇',
                parentId: '330225',

                children: null,

                code: '330225108',
                name: '浙江省/宁波市/象山县/涂茨镇',
                treePath: '330000/330200/330225/330225108',

                level: 5,
              },
              {
                id: '330225003',

                label: '爵溪街道',
                parentId: '330225',

                children: null,

                code: '330225003',
                name: '浙江省/宁波市/象山县/爵溪街道',
                treePath: '330000/330200/330225/330225003',

                level: 5,
              },
              {
                id: '330225101',

                label: '石浦镇',
                parentId: '330225',

                children: null,

                code: '330225101',
                name: '浙江省/宁波市/象山县/石浦镇',
                treePath: '330000/330200/330225/330225101',

                level: 5,
              },
              {
                id: '330225203',

                label: '茅洋乡',
                parentId: '330225',

                children: null,

                code: '330225203',
                name: '浙江省/宁波市/象山县/茅洋乡',
                treePath: '330000/330200/330225/330225203',

                level: 5,
              },
              {
                id: '330225102',

                label: '西周镇',
                parentId: '330225',

                children: null,

                code: '330225102',
                name: '浙江省/宁波市/象山县/西周镇',
                treePath: '330000/330200/330225/330225102',

                level: 5,
              },
              {
                id: '330225104',

                label: '贤庠镇',
                parentId: '330225',

                children: null,

                code: '330225104',
                name: '浙江省/宁波市/象山县/贤庠镇',
                treePath: '330000/330200/330225/330225104',

                level: 5,
              },
              {
                id: '330225204',

                label: '高塘岛乡',
                parentId: '330225',

                children: null,

                code: '330225204',
                name: '浙江省/宁波市/象山县/高塘岛乡',
                treePath: '330000/330200/330225/330225204',

                level: 5,
              },
              {
                id: '330225103',

                label: '鹤浦镇',
                parentId: '330225',

                children: null,

                code: '330225103',
                name: '浙江省/宁波市/象山县/鹤浦镇',
                treePath: '330000/330200/330225/330225103',

                level: 5,
              },
              {
                id: '330225202',

                label: '黄避岙乡',
                parentId: '330225',

                children: null,

                code: '330225202',
                name: '浙江省/宁波市/象山县/黄避岙乡',
                treePath: '330000/330200/330225/330225202',

                level: 5,
              },
            ],

            code: '330225',
            name: '浙江省/宁波市/象山县',
            treePath: '330000/330200/330225',

            level: 4,
          },
          {
            id: '330212',

            label: '鄞州区',
            parentId: '330200',

            children: [
              {
                id: '330212003',

                label: '下应街道',
                parentId: '330212',

                children: null,

                code: '330212003',
                name: '浙江省/宁波市/鄞州区/下应街道',
                treePath: '330000/330200/330212/330212003',

                level: 5,
              },
              {
                id: '330212104',

                label: '东吴镇',
                parentId: '330212',

                children: null,

                code: '330212104',
                name: '浙江省/宁波市/鄞州区/东吴镇',
                treePath: '330000/330200/330212/330212104',

                level: 5,
              },
              {
                id: '330212014',

                label: '东柳街道',
                parentId: '330212',

                children: null,

                code: '330212014',
                name: '浙江省/宁波市/鄞州区/东柳街道',
                treePath: '330000/330200/330212/330212014',

                level: 5,
              },
              {
                id: '330212011',

                label: '东胜街道',
                parentId: '330212',

                children: null,

                code: '330212011',
                name: '浙江省/宁波市/鄞州区/东胜街道',
                treePath: '330000/330200/330212/330212011',

                level: 5,
              },
              {
                id: '330212015',

                label: '东郊街道',
                parentId: '330212',

                children: null,

                code: '330212015',
                name: '浙江省/宁波市/鄞州区/东郊街道',
                treePath: '330000/330200/330212/330212015',

                level: 5,
              },
              {
                id: '330212123',

                label: '东钱湖镇',
                parentId: '330212',

                children: null,

                code: '330212123',
                name: '浙江省/宁波市/鄞州区/东钱湖镇',
                treePath: '330000/330200/330212/330212123',

                level: 5,
              },
              {
                id: '330212007',

                label: '中河街道',
                parentId: '330212',

                children: null,

                code: '330212007',
                name: '浙江省/宁波市/鄞州区/中河街道',
                treePath: '330000/330200/330212/330212007',

                level: 5,
              },
              {
                id: '330212108',

                label: '云龙镇',
                parentId: '330212',

                children: null,

                code: '330212108',
                name: '浙江省/宁波市/鄞州区/云龙镇',
                treePath: '330000/330200/330212/330212108',

                level: 5,
              },
              {
                id: '330212105',

                label: '五乡镇',
                parentId: '330212',

                children: null,

                code: '330212105',
                name: '浙江省/宁波市/鄞州区/五乡镇',
                treePath: '330000/330200/330212/330212105',

                level: 5,
              },
              {
                id: '330212101',

                label: '咸祥镇',
                parentId: '330212',

                children: null,

                code: '330212101',
                name: '浙江省/宁波市/鄞州区/咸祥镇',
                treePath: '330000/330200/330212/330212101',

                level: 5,
              },
              {
                id: '330212102',

                label: '塘溪镇',
                parentId: '330212',

                children: null,

                code: '330212102',
                name: '浙江省/宁波市/鄞州区/塘溪镇',
                treePath: '330000/330200/330212/330212102',

                level: 5,
              },
              {
                id: '330212121',

                label: '姜山镇',
                parentId: '330212',

                children: null,

                code: '330212121',
                name: '浙江省/宁波市/鄞州区/姜山镇',
                treePath: '330000/330200/330212/330212121',

                level: 5,
              },
              {
                id: '330212017',

                label: '新明街道',
                parentId: '330212',

                children: null,

                code: '330212017',
                name: '浙江省/宁波市/鄞州区/新明街道',
                treePath: '330000/330200/330212/330212017',

                level: 5,
              },
              {
                id: '330212012',

                label: '明楼街道',
                parentId: '330212',

                children: null,

                code: '330212012',
                name: '浙江省/宁波市/鄞州区/明楼街道',
                treePath: '330000/330200/330212/330212012',

                level: 5,
              },
              {
                id: '330212008',

                label: '梅墟街道',
                parentId: '330212',

                children: null,

                code: '330212008',
                name: '浙江省/宁波市/鄞州区/梅墟街道',
                treePath: '330000/330200/330212/330212008',

                level: 5,
              },
              {
                id: '330212109',

                label: '横溪镇',
                parentId: '330212',

                children: null,

                code: '330212109',
                name: '浙江省/宁波市/鄞州区/横溪镇',
                treePath: '330000/330200/330212/330212109',

                level: 5,
              },
              {
                id: '330212009',

                label: '潘火街道',
                parentId: '330212',

                children: null,

                code: '330212009',
                name: '浙江省/宁波市/鄞州区/潘火街道',
                treePath: '330000/330200/330212/330212009',

                level: 5,
              },
              {
                id: '330212013',

                label: '白鹤街道',
                parentId: '330212',

                children: null,

                code: '330212013',
                name: '浙江省/宁波市/鄞州区/白鹤街道',
                treePath: '330000/330200/330212/330212013',

                level: 5,
              },
              {
                id: '330212010',

                label: '百丈街道',
                parentId: '330212',

                children: null,

                code: '330212010',
                name: '浙江省/宁波市/鄞州区/百丈街道',
                treePath: '330000/330200/330212/330212010',

                level: 5,
              },
              {
                id: '330212100',

                label: '瞻岐镇',
                parentId: '330212',

                children: null,

                code: '330212100',
                name: '浙江省/宁波市/鄞州区/瞻岐镇',
                treePath: '330000/330200/330212/330212100',

                level: 5,
              },
              {
                id: '330212016',

                label: '福明街道',
                parentId: '330212',

                children: null,

                code: '330212016',
                name: '浙江省/宁波市/鄞州区/福明街道',
                treePath: '330000/330200/330212/330212016',

                level: 5,
              },
              {
                id: '330212106',

                label: '邱隘镇',
                parentId: '330212',

                children: null,

                code: '330212106',
                name: '浙江省/宁波市/鄞州区/邱隘镇',
                treePath: '330000/330200/330212/330212106',

                level: 5,
              },
              {
                id: '330212004',

                label: '钟公庙街道',
                parentId: '330212',

                children: null,

                code: '330212004',
                name: '浙江省/宁波市/鄞州区/钟公庙街道',
                treePath: '330000/330200/330212/330212004',

                level: 5,
              },
              {
                id: '330212006',

                label: '首南街道',
                parentId: '330212',

                children: null,

                code: '330212006',
                name: '浙江省/宁波市/鄞州区/首南街道',
                treePath: '330000/330200/330212/330212006',

                level: 5,
              },
            ],

            code: '330212',
            name: '浙江省/宁波市/鄞州区',
            treePath: '330000/330200/330212',

            level: 4,
          },
          {
            id: '330211',

            label: '镇海区',
            parentId: '330200',

            children: [
              {
                id: '330211101',

                label: '九龙湖镇',
                parentId: '330211',

                children: null,

                code: '330211101',
                name: '浙江省/宁波市/镇海区/九龙湖镇',
                treePath: '330000/330200/330211/330211101',

                level: 5,
              },
              {
                id: '330211004',

                label: '庄市街道',
                parentId: '330211',

                children: null,

                code: '330211004',
                name: '浙江省/宁波市/镇海区/庄市街道',
                treePath: '330000/330200/330211/330211004',

                level: 5,
              },
              {
                id: '330211001',

                label: '招宝山街道',
                parentId: '330211',

                children: null,

                code: '330211001',
                name: '浙江省/宁波市/镇海区/招宝山街道',
                treePath: '330000/330200/330211/330211001',

                level: 5,
              },
              {
                id: '330211100',

                label: '澥浦镇',
                parentId: '330211',

                children: null,

                code: '330211100',
                name: '浙江省/宁波市/镇海区/澥浦镇',
                treePath: '330000/330200/330211/330211100',

                level: 5,
              },
              {
                id: '330211002',

                label: '蛟川街道',
                parentId: '330211',

                children: null,

                code: '330211002',
                name: '浙江省/宁波市/镇海区/蛟川街道',
                treePath: '330000/330200/330211/330211002',

                level: 5,
              },
              {
                id: '330211003',

                label: '骆驼街道',
                parentId: '330211',

                children: null,

                code: '330211003',
                name: '浙江省/宁波市/镇海区/骆驼街道',
                treePath: '330000/330200/330211/330211003',

                level: 5,
              },
            ],

            code: '330211',
            name: '浙江省/宁波市/镇海区',
            treePath: '330000/330200/330211',

            level: 4,
          },
        ],

        code: '330200',
        name: '浙江省/宁波市',
        treePath: '330000/330200',

        level: 3,
      },
      {
        id: '330100',

        label: '杭州市',
        parentId: '330000',

        children: [
          {
            id: '330102',

            label: '上城区',
            parentId: '330100',

            children: [
              {
                id: '330102013',

                label: '丁兰街道',
                parentId: '330102',

                children: null,

                code: '330102013',
                name: '浙江省/杭州市/上城区/丁兰街道',
                treePath: '330000/330100/330102/330102013',

                level: 5,
              },
              {
                id: '330102014',

                label: '九堡街道',
                parentId: '330102',

                children: null,

                code: '330102014',
                name: '浙江省/杭州市/上城区/九堡街道',
                treePath: '330000/330100/330102/330102014',

                level: 5,
              },
              {
                id: '330102005',

                label: '凯旋街道',
                parentId: '330102',

                children: null,

                code: '330102005',
                name: '浙江省/杭州市/上城区/凯旋街道',
                treePath: '330000/330100/330102/330102005',

                level: 5,
              },
              {
                id: '330102008',

                label: '南星街道',
                parentId: '330102',

                children: null,

                code: '330102008',
                name: '浙江省/杭州市/上城区/南星街道',
                treePath: '330000/330100/330102/330102008',

                level: 5,
              },
              {
                id: '330102015',

                label: '四季青街道',
                parentId: '330102',

                children: null,

                code: '330102015',
                name: '浙江省/杭州市/上城区/四季青街道',
                treePath: '330000/330100/330102/330102015',

                level: 5,
              },
              {
                id: '330102004',

                label: '小营街道',
                parentId: '330102',

                children: null,

                code: '330102004',
                name: '浙江省/杭州市/上城区/小营街道',
                treePath: '330000/330100/330102/330102004',

                level: 5,
              },
              {
                id: '330102011',

                label: '彭埠街道',
                parentId: '330102',

                children: null,

                code: '330102011',
                name: '浙江省/杭州市/上城区/彭埠街道',
                treePath: '330000/330100/330102/330102011',

                level: 5,
              },
              {
                id: '330102010',

                label: '望江街道',
                parentId: '330102',

                children: null,

                code: '330102010',
                name: '浙江省/杭州市/上城区/望江街道',
                treePath: '330000/330100/330102/330102010',

                level: 5,
              },
              {
                id: '330102001',

                label: '清波街道',
                parentId: '330102',

                children: null,

                code: '330102001',
                name: '浙江省/杭州市/上城区/清波街道',
                treePath: '330000/330100/330102/330102001',

                level: 5,
              },
              {
                id: '330102003',

                label: '湖滨街道',
                parentId: '330102',

                children: null,

                code: '330102003',
                name: '浙江省/杭州市/上城区/湖滨街道',
                treePath: '330000/330100/330102/330102003',

                level: 5,
              },
              {
                id: '330102012',

                label: '笕桥街道',
                parentId: '330102',

                children: null,

                code: '330102012',
                name: '浙江省/杭州市/上城区/笕桥街道',
                treePath: '330000/330100/330102/330102012',

                level: 5,
              },
              {
                id: '330102009',

                label: '紫阳街道',
                parentId: '330102',

                children: null,

                code: '330102009',
                name: '浙江省/杭州市/上城区/紫阳街道',
                treePath: '330000/330100/330102/330102009',

                level: 5,
              },
              {
                id: '330102006',

                label: '采荷街道',
                parentId: '330102',

                children: null,

                code: '330102006',
                name: '浙江省/杭州市/上城区/采荷街道',
                treePath: '330000/330100/330102/330102006',

                level: 5,
              },
              {
                id: '330102007',

                label: '闸弄口街道',
                parentId: '330102',

                children: null,

                code: '330102007',
                name: '浙江省/杭州市/上城区/闸弄口街道',
                treePath: '330000/330100/330102/330102007',

                level: 5,
              },
            ],

            code: '330102',
            name: '浙江省/杭州市/上城区',
            treePath: '330000/330100/330102',

            level: 4,
          },
          {
            id: '330112',

            label: '临安区',
            parentId: '330100',

            children: [
              {
                id: '330112105',

                label: '天目山镇',
                parentId: '330112',

                children: null,

                code: '330112105',
                name: '浙江省/杭州市/临安区/天目山镇',
                treePath: '330000/330100/330112/330112105',

                level: 5,
              },
              {
                id: '330112103',

                label: '太湖源镇',
                parentId: '330112',

                children: null,

                code: '330112103',
                name: '浙江省/杭州市/临安区/太湖源镇',
                treePath: '330000/330100/330112/330112103',

                level: 5,
              },
              {
                id: '330112106',

                label: '太阳镇',
                parentId: '330112',

                children: null,

                code: '330112106',
                name: '浙江省/杭州市/临安区/太阳镇',
                treePath: '330000/330100/330112/330112106',

                level: 5,
              },
              {
                id: '330112113',

                label: '岛石镇',
                parentId: '330112',

                children: null,

                code: '330112113',
                name: '浙江省/杭州市/临安区/岛石镇',
                treePath: '330000/330100/330112/330112113',

                level: 5,
              },
              {
                id: '330112104',

                label: '於潜镇',
                parentId: '330112',

                children: null,

                code: '330112104',
                name: '浙江省/杭州市/临安区/於潜镇',
                treePath: '330000/330100/330112/330112104',

                level: 5,
              },
              {
                id: '330112108',

                label: '昌化镇',
                parentId: '330112',

                children: null,

                code: '330112108',
                name: '浙江省/杭州市/临安区/昌化镇',
                treePath: '330000/330100/330112/330112108',

                level: 5,
              },
              {
                id: '330112115',

                label: '板桥镇',
                parentId: '330112',

                children: null,

                code: '330112115',
                name: '浙江省/杭州市/临安区/板桥镇',
                treePath: '330000/330100/330112/330112115',

                level: 5,
              },
              {
                id: '330112109',

                label: '河桥镇',
                parentId: '330112',

                children: null,

                code: '330112109',
                name: '浙江省/杭州市/临安区/河桥镇',
                treePath: '330000/330100/330112/330112109',

                level: 5,
              },
              {
                id: '330112112',

                label: '清凉峰镇',
                parentId: '330112',

                children: null,

                code: '330112112',
                name: '浙江省/杭州市/临安区/清凉峰镇',
                treePath: '330000/330100/330112/330112112',

                level: 5,
              },
              {
                id: '330112111',

                label: '湍口镇',
                parentId: '330112',

                children: null,

                code: '330112111',
                name: '浙江省/杭州市/临安区/湍口镇',
                treePath: '330000/330100/330112/330112111',

                level: 5,
              },
              {
                id: '330112107',

                label: '潜川镇',
                parentId: '330112',

                children: null,

                code: '330112107',
                name: '浙江省/杭州市/临安区/潜川镇',
                treePath: '330000/330100/330112/330112107',

                level: 5,
              },
              {
                id: '330112002',

                label: '玲珑街道',
                parentId: '330112',

                children: null,

                code: '330112002',
                name: '浙江省/杭州市/临安区/玲珑街道',
                treePath: '330000/330100/330112/330112002',

                level: 5,
              },
              {
                id: '330112005',

                label: '锦北街道',
                parentId: '330112',

                children: null,

                code: '330112005',
                name: '浙江省/杭州市/临安区/锦北街道',
                treePath: '330000/330100/330112/330112005',

                level: 5,
              },
              {
                id: '330112004',

                label: '锦南街道',
                parentId: '330112',

                children: null,

                code: '330112004',
                name: '浙江省/杭州市/临安区/锦南街道',
                treePath: '330000/330100/330112/330112004',

                level: 5,
              },
              {
                id: '330112001',

                label: '锦城街道',
                parentId: '330112',

                children: null,

                code: '330112001',
                name: '浙江省/杭州市/临安区/锦城街道',
                treePath: '330000/330100/330112/330112001',

                level: 5,
              },
              {
                id: '330112003',

                label: '青山湖街道',
                parentId: '330112',

                children: null,

                code: '330112003',
                name: '浙江省/杭州市/临安区/青山湖街道',
                treePath: '330000/330100/330112/330112003',

                level: 5,
              },
              {
                id: '330112102',

                label: '高虹镇',
                parentId: '330112',

                children: null,

                code: '330112102',
                name: '浙江省/杭州市/临安区/高虹镇',
                treePath: '330000/330100/330112/330112102',

                level: 5,
              },
              {
                id: '330112110',

                label: '龙岗镇',
                parentId: '330112',

                children: null,

                code: '330112110',
                name: '浙江省/杭州市/临安区/龙岗镇',
                treePath: '330000/330100/330112/330112110',

                level: 5,
              },
            ],

            code: '330112',
            name: '浙江省/杭州市/临安区',
            treePath: '330000/330100/330112',

            level: 4,
          },
          {
            id: '330113',

            label: '临平区',
            parentId: '330100',

            children: [
              {
                id: '330113003',

                label: '东湖街道',
                parentId: '330113',

                children: null,

                code: '330113003',
                name: '浙江省/杭州市/临平区/东湖街道',
                treePath: '330000/330100/330113/330113003',

                level: 5,
              },
              {
                id: '330113001',

                label: '临平街道',
                parentId: '330113',

                children: null,

                code: '330113001',
                name: '浙江省/杭州市/临平区/临平街道',
                treePath: '330000/330100/330113/330113001',

                level: 5,
              },
              {
                id: '330113006',

                label: '乔司街道',
                parentId: '330113',

                children: null,

                code: '330113006',
                name: '浙江省/杭州市/临平区/乔司街道',
                treePath: '330000/330100/330113/330113006',

                level: 5,
              },
              {
                id: '330113009',

                label: '南苑街道',
                parentId: '330113',

                children: null,

                code: '330113009',
                name: '浙江省/杭州市/临平区/南苑街道',
                treePath: '330000/330100/330113/330113009',

                level: 5,
              },
              {
                id: '330113102',

                label: '塘栖镇',
                parentId: '330113',

                children: null,

                code: '330113102',
                name: '浙江省/杭州市/临平区/塘栖镇',
                treePath: '330000/330100/330113/330113102',

                level: 5,
              },
              {
                id: '330113008',

                label: '崇贤街道',
                parentId: '330113',

                children: null,

                code: '330113008',
                name: '浙江省/杭州市/临平区/崇贤街道',
                treePath: '330000/330100/330113/330113008',

                level: 5,
              },
              {
                id: '330113004',

                label: '星桥街道',
                parentId: '330113',

                children: null,

                code: '330113004',
                name: '浙江省/杭州市/临平区/星桥街道',
                treePath: '330000/330100/330113/330113004',

                level: 5,
              },
              {
                id: '330113007',

                label: '运河街道',
                parentId: '330113',

                children: null,

                code: '330113007',
                name: '浙江省/杭州市/临平区/运河街道',
                treePath: '330000/330100/330113/330113007',

                level: 5,
              },
            ],

            code: '330113',
            name: '浙江省/杭州市/临平区',
            treePath: '330000/330100/330113',

            level: 4,
          },
          {
            id: '330110',

            label: '余杭区',
            parentId: '330100',

            children: [
              {
                id: '330110011',

                label: '中泰街道',
                parentId: '330110',

                children: null,

                code: '330110011',
                name: '浙江省/杭州市/余杭区/中泰街道',
                treePath: '330000/330100/330110/330110011',

                level: 5,
              },
              {
                id: '330110005',

                label: '五常街道',
                parentId: '330110',

                children: null,

                code: '330110005',
                name: '浙江省/杭州市/余杭区/五常街道',
                treePath: '330000/330100/330110/330110005',

                level: 5,
              },
              {
                id: '330110009',

                label: '仁和街道',
                parentId: '330110',

                children: null,

                code: '330110009',
                name: '浙江省/杭州市/余杭区/仁和街道',
                treePath: '330000/330100/330110/330110009',

                level: 5,
              },
              {
                id: '330110014',

                label: '仓前街道',
                parentId: '330110',

                children: null,

                code: '330110014',
                name: '浙江省/杭州市/余杭区/仓前街道',
                treePath: '330000/330100/330110/330110014',

                level: 5,
              },
              {
                id: '330110012',

                label: '余杭街道',
                parentId: '330110',

                children: null,

                code: '330110012',
                name: '浙江省/杭州市/余杭区/余杭街道',
                treePath: '330000/330100/330110/330110012',

                level: 5,
              },
              {
                id: '330110109',

                label: '径山镇',
                parentId: '330110',

                children: null,

                code: '330110109',
                name: '浙江省/杭州市/余杭区/径山镇',
                treePath: '330000/330100/330110/330110109',

                level: 5,
              },
              {
                id: '330110110',

                label: '瓶窑镇',
                parentId: '330110',

                children: null,

                code: '330110110',
                name: '浙江省/杭州市/余杭区/瓶窑镇',
                treePath: '330000/330100/330110/330110110',

                level: 5,
              },
              {
                id: '330110112',

                label: '百丈镇',
                parentId: '330110',

                children: null,

                code: '330110112',
                name: '浙江省/杭州市/余杭区/百丈镇',
                treePath: '330000/330100/330110/330110112',

                level: 5,
              },
              {
                id: '330110013',

                label: '良渚街道',
                parentId: '330110',

                children: null,

                code: '330110013',
                name: '浙江省/杭州市/余杭区/良渚街道',
                treePath: '330000/330100/330110/330110013',

                level: 5,
              },
              {
                id: '330110010',

                label: '闲林街道',
                parentId: '330110',

                children: null,

                code: '330110010',
                name: '浙江省/杭州市/余杭区/闲林街道',
                treePath: '330000/330100/330110/330110010',

                level: 5,
              },
              {
                id: '330110111',

                label: '鸬鸟镇',
                parentId: '330110',

                children: null,

                code: '330110111',
                name: '浙江省/杭州市/余杭区/鸬鸟镇',
                treePath: '330000/330100/330110/330110111',

                level: 5,
              },
              {
                id: '330110113',

                label: '黄湖镇',
                parentId: '330110',

                children: null,

                code: '330110113',
                name: '浙江省/杭州市/余杭区/黄湖镇',
                treePath: '330000/330100/330110/330110113',

                level: 5,
              },
            ],

            code: '330110',
            name: '浙江省/杭州市/余杭区',
            treePath: '330000/330100/330110',

            level: 4,
          },
          {
            id: '330111',

            label: '富阳区',
            parentId: '330100',

            children: [
              {
                id: '330111100',

                label: '万市镇',
                parentId: '330111',

                children: null,

                code: '330111100',
                name: '浙江省/杭州市/富阳区/万市镇',
                treePath: '330000/330100/330111/330111100',

                level: 5,
              },
              {
                id: '330111201',

                label: '上官乡',
                parentId: '330111',

                children: null,

                code: '330111201',
                name: '浙江省/杭州市/富阳区/上官乡',
                treePath: '330000/330100/330111/330111201',

                level: 5,
              },
              {
                id: '330111003',

                label: '东洲街道',
                parentId: '330111',

                children: null,

                code: '330111003',
                name: '浙江省/杭州市/富阳区/东洲街道',
                treePath: '330000/330100/330111/330111003',

                level: 5,
              },
              {
                id: '330111114',

                label: '受降镇',
                parentId: '330111',

                children: null,

                code: '330111114',
                name: '浙江省/杭州市/富阳区/受降镇',
                treePath: '330000/330100/330111/330111114',

                level: 5,
              },
              {
                id: '330111110',

                label: '场口镇',
                parentId: '330111',

                children: null,

                code: '330111110',
                name: '浙江省/杭州市/富阳区/场口镇',
                treePath: '330000/330100/330111/330111110',

                level: 5,
              },
              {
                id: '330111106',

                label: '大源镇',
                parentId: '330111',

                children: null,

                code: '330111106',
                name: '浙江省/杭州市/富阳区/大源镇',
                treePath: '330000/330100/330111/330111106',

                level: 5,
              },
              {
                id: '330111001',

                label: '富春街道',
                parentId: '330111',

                children: null,

                code: '330111001',
                name: '浙江省/杭州市/富阳区/富春街道',
                treePath: '330000/330100/330111/330111001',

                level: 5,
              },
              {
                id: '330111111',

                label: '常安镇',
                parentId: '330111',

                children: null,

                code: '330111111',
                name: '浙江省/杭州市/富阳区/常安镇',
                treePath: '330000/330100/330111/330111111',

                level: 5,
              },
              {
                id: '330111109',

                label: '常绿镇',
                parentId: '330111',

                children: null,

                code: '330111109',
                name: '浙江省/杭州市/富阳区/常绿镇',
                treePath: '330000/330100/330111/330111109',

                level: 5,
              },
              {
                id: '330111200',

                label: '新桐乡',
                parentId: '330111',

                children: null,

                code: '330111200',
                name: '浙江省/杭州市/富阳区/新桐乡',
                treePath: '330000/330100/330111/330111200',

                level: 5,
              },
              {
                id: '330111102',

                label: '新登镇',
                parentId: '330111',

                children: null,

                code: '330111102',
                name: '浙江省/杭州市/富阳区/新登镇',
                treePath: '330000/330100/330111/330111102',

                level: 5,
              },
              {
                id: '330111205',

                label: '春建乡',
                parentId: '330111',

                children: null,

                code: '330111205',
                name: '浙江省/杭州市/富阳区/春建乡',
                treePath: '330000/330100/330111/330111205',

                level: 5,
              },
              {
                id: '330111002',

                label: '春江街道',
                parentId: '330111',

                children: null,

                code: '330111002',
                name: '浙江省/杭州市/富阳区/春江街道',
                treePath: '330000/330100/330111/330111002',

                level: 5,
              },
              {
                id: '330111105',

                label: '永昌镇',
                parentId: '330111',

                children: null,

                code: '330111105',
                name: '浙江省/杭州市/富阳区/永昌镇',
                treePath: '330000/330100/330111/330111105',

                level: 5,
              },
              {
                id: '330111101',

                label: '洞桥镇',
                parentId: '330111',

                children: null,

                code: '330111101',
                name: '浙江省/杭州市/富阳区/洞桥镇',
                treePath: '330000/330100/330111/330111101',

                level: 5,
              },
              {
                id: '330111103',

                label: '渌渚镇',
                parentId: '330111',

                children: null,

                code: '330111103',
                name: '浙江省/杭州市/富阳区/渌渚镇',
                treePath: '330000/330100/330111/330111103',

                level: 5,
              },
              {
                id: '330111202',

                label: '渔山乡',
                parentId: '330111',

                children: null,

                code: '330111202',
                name: '浙江省/杭州市/富阳区/渔山乡',
                treePath: '330000/330100/330111/330111202',

                level: 5,
              },
              {
                id: '330111204',

                label: '湖源乡',
                parentId: '330111',

                children: null,

                code: '330111204',
                name: '浙江省/杭州市/富阳区/湖源乡',
                treePath: '330000/330100/330111/330111204',

                level: 5,
              },
              {
                id: '330111107',

                label: '灵桥镇',
                parentId: '330111',

                children: null,

                code: '330111107',
                name: '浙江省/杭州市/富阳区/灵桥镇',
                treePath: '330000/330100/330111/330111107',

                level: 5,
              },
              {
                id: '330111203',

                label: '环山乡',
                parentId: '330111',

                children: null,

                code: '330111203',
                name: '浙江省/杭州市/富阳区/环山乡',
                treePath: '330000/330100/330111/330111203',

                level: 5,
              },
              {
                id: '330111104',

                label: '胥口镇',
                parentId: '330111',

                children: null,

                code: '330111104',
                name: '浙江省/杭州市/富阳区/胥口镇',
                treePath: '330000/330100/330111/330111104',

                level: 5,
              },
              {
                id: '330111108',

                label: '里山镇',
                parentId: '330111',

                children: null,

                code: '330111108',
                name: '浙江省/杭州市/富阳区/里山镇',
                treePath: '330000/330100/330111/330111108',

                level: 5,
              },
              {
                id: '330111113',

                label: '高桥镇',
                parentId: '330111',

                children: null,

                code: '330111113',
                name: '浙江省/杭州市/富阳区/高桥镇',
                treePath: '330000/330100/330111/330111113',

                level: 5,
              },
              {
                id: '330111004',

                label: '鹿山街道',
                parentId: '330111',

                children: null,

                code: '330111004',
                name: '浙江省/杭州市/富阳区/鹿山街道',
                treePath: '330000/330100/330111/330111004',

                level: 5,
              },
              {
                id: '330111112',

                label: '龙门镇',
                parentId: '330111',

                children: null,

                code: '330111112',
                name: '浙江省/杭州市/富阳区/龙门镇',
                treePath: '330000/330100/330111/330111112',

                level: 5,
              },
            ],

            code: '330111',
            name: '浙江省/杭州市/富阳区',
            treePath: '330000/330100/330111',

            level: 4,
          },
          {
            id: '330182',

            label: '建德市',
            parentId: '330100',

            children: [
              {
                id: '330182108',

                label: '三都镇',
                parentId: '330182',

                children: null,

                code: '330182108',
                name: '浙江省/杭州市/建德市/三都镇',
                treePath: '330000/330100/330182/330182108',

                level: 5,
              },
              {
                id: '330182106',

                label: '下涯镇',
                parentId: '330182',

                children: null,

                code: '330182106',
                name: '浙江省/杭州市/建德市/下涯镇',
                treePath: '330000/330100/330182/330182106',

                level: 5,
              },
              {
                id: '330182102',

                label: '乾潭镇',
                parentId: '330182',

                children: null,

                code: '330182102',
                name: '浙江省/杭州市/建德市/乾潭镇',
                treePath: '330000/330100/330182/330182102',

                level: 5,
              },
              {
                id: '330182112',

                label: '大同镇',
                parentId: '330182',

                children: null,

                code: '330182112',
                name: '浙江省/杭州市/建德市/大同镇',
                treePath: '330000/330100/330182/330182112',

                level: 5,
              },
              {
                id: '330182111',

                label: '大慈岩镇',
                parentId: '330182',

                children: null,

                code: '330182111',
                name: '浙江省/杭州市/建德市/大慈岩镇',
                treePath: '330000/330100/330182/330182111',

                level: 5,
              },
              {
                id: '330182107',

                label: '大洋镇',
                parentId: '330182',

                children: null,

                code: '330182107',
                name: '浙江省/杭州市/建德市/大洋镇',
                treePath: '330000/330100/330182/330182107',

                level: 5,
              },
              {
                id: '330182109',

                label: '寿昌镇',
                parentId: '330182',

                children: null,

                code: '330182109',
                name: '浙江省/杭州市/建德市/寿昌镇',
                treePath: '330000/330100/330182/330182109',

                level: 5,
              },
              {
                id: '330182001',

                label: '新安江街道',
                parentId: '330182',

                children: null,

                code: '330182001',
                name: '浙江省/杭州市/建德市/新安江街道',
                treePath: '330000/330100/330182/330182001',

                level: 5,
              },
              {
                id: '330182003',

                label: '更楼街道',
                parentId: '330182',

                children: null,

                code: '330182003',
                name: '浙江省/杭州市/建德市/更楼街道',
                treePath: '330000/330100/330182/330182003',

                level: 5,
              },
              {
                id: '330182113',

                label: '李家镇',
                parentId: '330182',

                children: null,

                code: '330182113',
                name: '浙江省/杭州市/建德市/李家镇',
                treePath: '330000/330100/330182/330182113',

                level: 5,
              },
              {
                id: '330182105',

                label: '杨村桥镇',
                parentId: '330182',

                children: null,

                code: '330182105',
                name: '浙江省/杭州市/建德市/杨村桥镇',
                treePath: '330000/330100/330182/330182105',

                level: 5,
              },
              {
                id: '330182104',

                label: '梅城镇',
                parentId: '330182',

                children: null,

                code: '330182104',
                name: '浙江省/杭州市/建德市/梅城镇',
                treePath: '330000/330100/330182/330182104',

                level: 5,
              },
              {
                id: '330182002',

                label: '洋溪街道',
                parentId: '330182',

                children: null,

                code: '330182002',
                name: '浙江省/杭州市/建德市/洋溪街道',
                treePath: '330000/330100/330182/330182002',

                level: 5,
              },
              {
                id: '330182110',

                label: '航头镇',
                parentId: '330182',

                children: null,

                code: '330182110',
                name: '浙江省/杭州市/建德市/航头镇',
                treePath: '330000/330100/330182/330182110',

                level: 5,
              },
              {
                id: '330182101',

                label: '莲花镇',
                parentId: '330182',

                children: null,

                code: '330182101',
                name: '浙江省/杭州市/建德市/莲花镇',
                treePath: '330000/330100/330182/330182101',

                level: 5,
              },
              {
                id: '330182202',

                label: '钦堂乡',
                parentId: '330182',

                children: null,

                code: '330182202',
                name: '浙江省/杭州市/建德市/钦堂乡',
                treePath: '330000/330100/330182/330182202',

                level: 5,
              },
            ],

            code: '330182',
            name: '浙江省/杭州市/建德市',
            treePath: '330000/330100/330182',

            level: 4,
          },
          {
            id: '330105',

            label: '拱墅区',
            parentId: '330100',

            children: [
              {
                id: '330105008',

                label: '上塘街道',
                parentId: '330105',

                children: null,

                code: '330105008',
                name: '浙江省/杭州市/拱墅区/上塘街道',
                treePath: '330000/330100/330105/330105008',

                level: 5,
              },
              {
                id: '330105014',

                label: '东新街道',
                parentId: '330105',

                children: null,

                code: '330105014',
                name: '浙江省/杭州市/拱墅区/东新街道',
                treePath: '330000/330100/330105/330105014',

                level: 5,
              },
              {
                id: '330105011',

                label: '半山街道',
                parentId: '330105',

                children: null,

                code: '330105011',
                name: '浙江省/杭州市/拱墅区/半山街道',
                treePath: '330000/330100/330105/330105011',

                level: 5,
              },
              {
                id: '330105004',

                label: '和睦街道',
                parentId: '330105',

                children: null,

                code: '330105004',
                name: '浙江省/杭州市/拱墅区/和睦街道',
                treePath: '330000/330100/330105/330105004',

                level: 5,
              },
              {
                id: '330105007',

                label: '大关街道',
                parentId: '330105',

                children: null,

                code: '330105007',
                name: '浙江省/杭州市/拱墅区/大关街道',
                treePath: '330000/330100/330105/330105007',

                level: 5,
              },
              {
                id: '330105012',

                label: '天水街道',
                parentId: '330105',

                children: null,

                code: '330105012',
                name: '浙江省/杭州市/拱墅区/天水街道',
                treePath: '330000/330100/330105/330105012',

                level: 5,
              },
              {
                id: '330105003',

                label: '小河街道',
                parentId: '330105',

                children: null,

                code: '330105003',
                name: '浙江省/杭州市/拱墅区/小河街道',
                treePath: '330000/330100/330105/330105003',

                level: 5,
              },
              {
                id: '330105010',

                label: '康桥街道',
                parentId: '330105',

                children: null,

                code: '330105010',
                name: '浙江省/杭州市/拱墅区/康桥街道',
                treePath: '330000/330100/330105/330105010',

                level: 5,
              },
              {
                id: '330105005',

                label: '拱宸桥街道',
                parentId: '330105',

                children: null,

                code: '330105005',
                name: '浙江省/杭州市/拱墅区/拱宸桥街道',
                treePath: '330000/330100/330105/330105005',

                level: 5,
              },
              {
                id: '330105015',

                label: '文晖街道',
                parentId: '330105',

                children: null,

                code: '330105015',
                name: '浙江省/杭州市/拱墅区/文晖街道',
                treePath: '330000/330100/330105/330105015',

                level: 5,
              },
              {
                id: '330105013',

                label: '朝晖街道',
                parentId: '330105',

                children: null,

                code: '330105013',
                name: '浙江省/杭州市/拱墅区/朝晖街道',
                treePath: '330000/330100/330105/330105013',

                level: 5,
              },
              {
                id: '330105016',

                label: '武林街道',
                parentId: '330105',

                children: null,

                code: '330105016',
                name: '浙江省/杭州市/拱墅区/武林街道',
                treePath: '330000/330100/330105/330105016',

                level: 5,
              },
              {
                id: '330105002',

                label: '湖墅街道',
                parentId: '330105',

                children: null,

                code: '330105002',
                name: '浙江省/杭州市/拱墅区/湖墅街道',
                treePath: '330000/330100/330105/330105002',

                level: 5,
              },
              {
                id: '330105017',

                label: '潮鸣街道',
                parentId: '330105',

                children: null,

                code: '330105017',
                name: '浙江省/杭州市/拱墅区/潮鸣街道',
                treePath: '330000/330100/330105/330105017',

                level: 5,
              },
              {
                id: '330105019',

                label: '石桥街道',
                parentId: '330105',

                children: null,

                code: '330105019',
                name: '浙江省/杭州市/拱墅区/石桥街道',
                treePath: '330000/330100/330105/330105019',

                level: 5,
              },
              {
                id: '330105009',

                label: '祥符街道',
                parentId: '330105',

                children: null,

                code: '330105009',
                name: '浙江省/杭州市/拱墅区/祥符街道',
                treePath: '330000/330100/330105/330105009',

                level: 5,
              },
              {
                id: '330105001',

                label: '米市巷街道',
                parentId: '330105',

                children: null,

                code: '330105001',
                name: '浙江省/杭州市/拱墅区/米市巷街道',
                treePath: '330000/330100/330105/330105001',

                level: 5,
              },
              {
                id: '330105018',

                label: '长庆街道',
                parentId: '330105',

                children: null,

                code: '330105018',
                name: '浙江省/杭州市/拱墅区/长庆街道',
                treePath: '330000/330100/330105/330105018',

                level: 5,
              },
            ],

            code: '330105',
            name: '浙江省/杭州市/拱墅区',
            treePath: '330000/330100/330105',

            level: 4,
          },
          {
            id: '330122',

            label: '桐庐县',
            parentId: '330100',

            children: [
              {
                id: '330122004',

                label: '凤川街道',
                parentId: '330122',

                children: null,

                code: '330122004',
                name: '浙江省/杭州市/桐庐县/凤川街道',
                treePath: '330000/330100/330122/330122004',

                level: 5,
              },
              {
                id: '330122109',

                label: '分水镇',
                parentId: '330122',

                children: null,

                code: '330122109',
                name: '浙江省/杭州市/桐庐县/分水镇',
                treePath: '330000/330100/330122/330122109',

                level: 5,
              },
              {
                id: '330122210',

                label: '合村乡',
                parentId: '330122',

                children: null,

                code: '330122210',
                name: '浙江省/杭州市/桐庐县/合村乡',
                treePath: '330000/330100/330122/330122210',

                level: 5,
              },
              {
                id: '330122003',

                label: '城南街道',
                parentId: '330122',

                children: null,

                code: '330122003',
                name: '浙江省/杭州市/桐庐县/城南街道',
                treePath: '330000/330100/330122/330122003',

                level: 5,
              },
              {
                id: '330122101',

                label: '富春江镇',
                parentId: '330122',

                children: null,

                code: '330122101',
                name: '浙江省/杭州市/桐庐县/富春江镇',
                treePath: '330000/330100/330122/330122101',

                level: 5,
              },
              {
                id: '330122204',

                label: '新合乡',
                parentId: '330122',

                children: null,

                code: '330122204',
                name: '浙江省/杭州市/桐庐县/新合乡',
                treePath: '330000/330100/330122/330122204',

                level: 5,
              },
              {
                id: '330122002',

                label: '旧县街道',
                parentId: '330122',

                children: null,

                code: '330122002',
                name: '浙江省/杭州市/桐庐县/旧县街道',
                treePath: '330000/330100/330122/330122002',

                level: 5,
              },
              {
                id: '330122001',

                label: '桐君街道',
                parentId: '330122',

                children: null,

                code: '330122001',
                name: '浙江省/杭州市/桐庐县/桐君街道',
                treePath: '330000/330100/330122/330122001',

                level: 5,
              },
              {
                id: '330122102',

                label: '横村镇',
                parentId: '330122',

                children: null,

                code: '330122102',
                name: '浙江省/杭州市/桐庐县/横村镇',
                treePath: '330000/330100/330122/330122102',

                level: 5,
              },
              {
                id: '330122105',

                label: '江南镇',
                parentId: '330122',

                children: null,

                code: '330122105',
                name: '浙江省/杭州市/桐庐县/江南镇',
                treePath: '330000/330100/330122/330122105',

                level: 5,
              },
              {
                id: '330122110',

                label: '瑶琳镇',
                parentId: '330122',

                children: null,

                code: '330122110',
                name: '浙江省/杭州市/桐庐县/瑶琳镇',
                treePath: '330000/330100/330122/330122110',

                level: 5,
              },
              {
                id: '330122112',

                label: '百江镇',
                parentId: '330122',

                children: null,

                code: '330122112',
                name: '浙江省/杭州市/桐庐县/百江镇',
                treePath: '330000/330100/330122/330122112',

                level: 5,
              },
              {
                id: '330122201',

                label: '莪山畲族乡',
                parentId: '330122',

                children: null,

                code: '330122201',
                name: '浙江省/杭州市/桐庐县/莪山畲族乡',
                treePath: '330000/330100/330122/330122201',

                level: 5,
              },
              {
                id: '330122202',

                label: '钟山乡',
                parentId: '330122',

                children: null,

                code: '330122202',
                name: '浙江省/杭州市/桐庐县/钟山乡',
                treePath: '330000/330100/330122/330122202',

                level: 5,
              },
            ],

            code: '330122',
            name: '浙江省/杭州市/桐庐县',
            treePath: '330000/330100/330122',

            level: 4,
          },
          {
            id: '330127',

            label: '淳安县',
            parentId: '330100',

            children: [
              {
                id: '330127109',

                label: '中洲镇',
                parentId: '330127',

                children: null,

                code: '330127109',
                name: '浙江省/杭州市/淳安县/中洲镇',
                treePath: '330000/330100/330127/330127109',

                level: 5,
              },
              {
                id: '330127103',

                label: '临岐镇',
                parentId: '330127',

                children: null,

                code: '330127103',
                name: '浙江省/杭州市/淳安县/临岐镇',
                treePath: '330000/330100/330127/330127103',

                level: 5,
              },
              {
                id: '330127112',

                label: '千岛湖镇',
                parentId: '330127',

                children: null,

                code: '330127112',
                name: '浙江省/杭州市/淳安县/千岛湖镇',
                treePath: '330000/330100/330127/330127112',

                level: 5,
              },
              {
                id: '330127110',

                label: '大墅镇',
                parentId: '330127',

                children: null,

                code: '330127110',
                name: '浙江省/杭州市/淳安县/大墅镇',
                treePath: '330000/330100/330127/330127110',

                level: 5,
              },
              {
                id: '330127106',

                label: '姜家镇',
                parentId: '330127',

                children: null,

                code: '330127106',
                name: '浙江省/杭州市/淳安县/姜家镇',
                treePath: '330000/330100/330127/330127106',

                level: 5,
              },
              {
                id: '330127104',

                label: '威坪镇',
                parentId: '330127',

                children: null,

                code: '330127104',
                name: '浙江省/杭州市/淳安县/威坪镇',
                treePath: '330000/330100/330127/330127104',

                level: 5,
              },
              {
                id: '330127216',

                label: '安阳乡',
                parentId: '330127',

                children: null,

                code: '330127216',
                name: '浙江省/杭州市/淳安县/安阳乡',
                treePath: '330000/330100/330127/330127216',

                level: 5,
              },
              {
                id: '330127210',

                label: '宋村乡',
                parentId: '330127',

                children: null,

                code: '330127210',
                name: '浙江省/杭州市/淳安县/宋村乡',
                treePath: '330000/330100/330127/330127210',

                level: 5,
              },
              {
                id: '330127202',

                label: '富文乡',
                parentId: '330127',

                children: null,

                code: '330127202',
                name: '浙江省/杭州市/淳安县/富文乡',
                treePath: '330000/330100/330127/330127202',

                level: 5,
              },
              {
                id: '330127205',

                label: '屏门乡',
                parentId: '330127',

                children: null,

                code: '330127205',
                name: '浙江省/杭州市/淳安县/屏门乡',
                treePath: '330000/330100/330127/330127205',

                level: 5,
              },
              {
                id: '330127203',

                label: '左口乡',
                parentId: '330127',

                children: null,

                code: '330127203',
                name: '浙江省/杭州市/淳安县/左口乡',
                treePath: '330000/330100/330127/330127203',

                level: 5,
              },
              {
                id: '330127101',

                label: '文昌镇',
                parentId: '330127',

                children: null,

                code: '330127101',
                name: '浙江省/杭州市/淳安县/文昌镇',
                treePath: '330000/330100/330127/330127101',

                level: 5,
              },
              {
                id: '330127111',

                label: '枫树岭镇',
                parentId: '330127',

                children: null,

                code: '330127111',
                name: '浙江省/杭州市/淳安县/枫树岭镇',
                treePath: '330000/330100/330127/330127111',

                level: 5,
              },
              {
                id: '330127107',

                label: '梓桐镇',
                parentId: '330127',

                children: null,

                code: '330127107',
                name: '浙江省/杭州市/淳安县/梓桐镇',
                treePath: '330000/330100/330127/330127107',

                level: 5,
              },
              {
                id: '330127108',

                label: '汾口镇',
                parentId: '330127',

                children: null,

                code: '330127108',
                name: '浙江省/杭州市/淳安县/汾口镇',
                treePath: '330000/330100/330127/330127108',

                level: 5,
              },
              {
                id: '330127212',

                label: '浪川乡',
                parentId: '330127',

                children: null,

                code: '330127212',
                name: '浙江省/杭州市/淳安县/浪川乡',
                treePath: '330000/330100/330127/330127212',

                level: 5,
              },
              {
                id: '330127208',

                label: '王阜乡',
                parentId: '330127',

                children: null,

                code: '330127208',
                name: '浙江省/杭州市/淳安县/王阜乡',
                treePath: '330000/330100/330127/330127208',

                level: 5,
              },
              {
                id: '330127206',

                label: '瑶山乡',
                parentId: '330127',

                children: null,

                code: '330127206',
                name: '浙江省/杭州市/淳安县/瑶山乡',
                treePath: '330000/330100/330127/330127206',

                level: 5,
              },
              {
                id: '330127214',

                label: '界首乡',
                parentId: '330127',

                children: null,

                code: '330127214',
                name: '浙江省/杭州市/淳安县/界首乡',
                treePath: '330000/330100/330127/330127214',

                level: 5,
              },
              {
                id: '330127102',

                label: '石林镇',
                parentId: '330127',

                children: null,

                code: '330127102',
                name: '浙江省/杭州市/淳安县/石林镇',
                treePath: '330000/330100/330127/330127102',

                level: 5,
              },
              {
                id: '330127200',

                label: '里商乡',
                parentId: '330127',

                children: null,

                code: '330127200',
                name: '浙江省/杭州市/淳安县/里商乡',
                treePath: '330000/330100/330127/330127200',

                level: 5,
              },
              {
                id: '330127201',

                label: '金峰乡',
                parentId: '330127',

                children: null,

                code: '330127201',
                name: '浙江省/杭州市/淳安县/金峰乡',
                treePath: '330000/330100/330127/330127201',

                level: 5,
              },
              {
                id: '330127211',

                label: '鸠坑乡',
                parentId: '330127',

                children: null,

                code: '330127211',
                name: '浙江省/杭州市/淳安县/鸠坑乡',
                treePath: '330000/330100/330127/330127211',

                level: 5,
              },
            ],

            code: '330127',
            name: '浙江省/杭州市/淳安县',
            treePath: '330000/330100/330127',

            level: 4,
          },
          {
            id: '330108',

            label: '滨江区',
            parentId: '330100',

            children: [
              {
                id: '330108002',

                label: '浦沿街道',
                parentId: '330108',

                children: null,

                code: '330108002',
                name: '浙江省/杭州市/滨江区/浦沿街道',
                treePath: '330000/330100/330108/330108002',

                level: 5,
              },
              {
                id: '330108001',

                label: '西兴街道',
                parentId: '330108',

                children: null,

                code: '330108001',
                name: '浙江省/杭州市/滨江区/西兴街道',
                treePath: '330000/330100/330108/330108001',

                level: 5,
              },
              {
                id: '330108003',

                label: '长河街道',
                parentId: '330108',

                children: null,

                code: '330108003',
                name: '浙江省/杭州市/滨江区/长河街道',
                treePath: '330000/330100/330108/330108003',

                level: 5,
              },
            ],

            code: '330108',
            name: '浙江省/杭州市/滨江区',
            treePath: '330000/330100/330108',

            level: 4,
          },
          {
            id: '330109',

            label: '萧山区',
            parentId: '330100',

            children: [
              {
                id: '330109105',

                label: '临浦镇',
                parentId: '330109',

                children: null,

                code: '330109105',
                name: '浙江省/杭州市/萧山区/临浦镇',
                treePath: '330000/330100/330109/330109105',

                level: 5,
              },
              {
                id: '330109106',

                label: '义桥镇',
                parentId: '330109',

                children: null,

                code: '330109106',
                name: '浙江省/杭州市/萧山区/义桥镇',
                treePath: '330000/330100/330109/330109106',

                level: 5,
              },
              {
                id: '330109120',

                label: '党湾镇',
                parentId: '330109',

                children: null,

                code: '330109120',
                name: '浙江省/杭州市/萧山区/党湾镇',
                treePath: '330000/330100/330109/330109120',

                level: 5,
              },
              {
                id: '330109002',

                label: '北干街道',
                parentId: '330109',

                children: null,

                code: '330109002',
                name: '浙江省/杭州市/萧山区/北干街道',
                treePath: '330000/330100/330109/330109002',

                level: 5,
              },
              {
                id: '330109006',

                label: '南阳街道',
                parentId: '330109',

                children: null,

                code: '330109006',
                name: '浙江省/杭州市/萧山区/南阳街道',
                treePath: '330000/330100/330109/330109006',

                level: 5,
              },
              {
                id: '330109001',

                label: '城厢街道',
                parentId: '330109',

                children: null,

                code: '330109001',
                name: '浙江省/杭州市/萧山区/城厢街道',
                treePath: '330000/330100/330109/330109001',

                level: 5,
              },
              {
                id: '330109014',

                label: '宁围街道',
                parentId: '330109',

                children: null,

                code: '330109014',
                name: '浙江省/杭州市/萧山区/宁围街道',
                treePath: '330000/330100/330109/330109014',

                level: 5,
              },
              {
                id: '330109102',

                label: '戴村镇',
                parentId: '330109',

                children: null,

                code: '330109102',
                name: '浙江省/杭州市/萧山区/戴村镇',
                treePath: '330000/330100/330109/330109102',

                level: 5,
              },
              {
                id: '330109107',

                label: '所前镇',
                parentId: '330109',

                children: null,

                code: '330109107',
                name: '浙江省/杭州市/萧山区/所前镇',
                treePath: '330000/330100/330109/330109107',

                level: 5,
              },
              {
                id: '330109004',

                label: '新塘街道',
                parentId: '330109',

                children: null,

                code: '330109004',
                name: '浙江省/杭州市/萧山区/新塘街道',
                treePath: '330000/330100/330109/330109004',

                level: 5,
              },
              {
                id: '330109012',

                label: '新街街道',
                parentId: '330109',

                children: null,

                code: '330109012',
                name: '浙江省/杭州市/萧山区/新街街道',
                treePath: '330000/330100/330109/330109012',

                level: 5,
              },
              {
                id: '330109100',

                label: '楼塔镇',
                parentId: '330109',

                children: null,

                code: '330109100',
                name: '浙江省/杭州市/萧山区/楼塔镇',
                treePath: '330000/330100/330109/330109100',

                level: 5,
              },
              {
                id: '330109101',

                label: '河上镇',
                parentId: '330109',

                children: null,

                code: '330109101',
                name: '浙江省/杭州市/萧山区/河上镇',
                treePath: '330000/330100/330109/330109101',

                level: 5,
              },
              {
                id: '330109103',

                label: '浦阳镇',
                parentId: '330109',

                children: null,

                code: '330109103',
                name: '浙江省/杭州市/萧山区/浦阳镇',
                treePath: '330000/330100/330109/330109103',

                level: 5,
              },
              {
                id: '330109113',

                label: '瓜沥镇',
                parentId: '330109',

                children: null,

                code: '330109113',
                name: '浙江省/杭州市/萧山区/瓜沥镇',
                treePath: '330000/330100/330109/330109113',

                level: 5,
              },
              {
                id: '330109015',

                label: '盈丰街道',
                parentId: '330109',

                children: null,

                code: '330109015',
                name: '浙江省/杭州市/萧山区/盈丰街道',
                treePath: '330000/330100/330109/330109015',

                level: 5,
              },
              {
                id: '330109115',

                label: '益农镇',
                parentId: '330109',

                children: null,

                code: '330109115',
                name: '浙江省/杭州市/萧山区/益农镇',
                treePath: '330000/330100/330109/330109115',

                level: 5,
              },
              {
                id: '330109003',

                label: '蜀山街道',
                parentId: '330109',

                children: null,

                code: '330109003',
                name: '浙江省/杭州市/萧山区/蜀山街道',
                treePath: '330000/330100/330109/330109003',

                level: 5,
              },
              {
                id: '330109108',

                label: '衙前镇',
                parentId: '330109',

                children: null,

                code: '330109108',
                name: '浙江省/杭州市/萧山区/衙前镇',
                treePath: '330000/330100/330109/330109108',

                level: 5,
              },
              {
                id: '330109104',

                label: '进化镇',
                parentId: '330109',

                children: null,

                code: '330109104',
                name: '浙江省/杭州市/萧山区/进化镇',
                treePath: '330000/330100/330109/330109104',

                level: 5,
              },
              {
                id: '330109013',

                label: '闻堰街道',
                parentId: '330109',

                children: null,

                code: '330109013',
                name: '浙江省/杭州市/萧山区/闻堰街道',
                treePath: '330000/330100/330109/330109013',

                level: 5,
              },
              {
                id: '330109005',

                label: '靖江街道',
                parentId: '330109',

                children: null,

                code: '330109005',
                name: '浙江省/杭州市/萧山区/靖江街道',
                treePath: '330000/330100/330109/330109005',

                level: 5,
              },
            ],

            code: '330109',
            name: '浙江省/杭州市/萧山区',
            treePath: '330000/330100/330109',

            level: 4,
          },
          {
            id: '330106',

            label: '西湖区',
            parentId: '330100',

            children: [
              {
                id: '330106109',

                label: '三墩镇',
                parentId: '330106',

                children: null,

                code: '330106109',
                name: '浙江省/杭州市/西湖区/三墩镇',
                treePath: '330000/330100/330106/330106109',

                level: 5,
              },
              {
                id: '330106002',

                label: '北山街道',
                parentId: '330106',

                children: null,

                code: '330106002',
                name: '浙江省/杭州市/西湖区/北山街道',
                treePath: '330000/330100/330106/330106002',

                level: 5,
              },
              {
                id: '330106110',

                label: '双浦镇',
                parentId: '330106',

                children: null,

                code: '330106110',
                name: '浙江省/杭州市/西湖区/双浦镇',
                treePath: '330000/330100/330106/330106110',

                level: 5,
              },
              {
                id: '330106014',

                label: '古荡街道',
                parentId: '330106',

                children: null,

                code: '330106014',
                name: '浙江省/杭州市/西湖区/古荡街道',
                treePath: '330000/330100/330106/330106014',

                level: 5,
              },
              {
                id: '330106006',

                label: '文新街道',
                parentId: '330106',

                children: null,

                code: '330106006',
                name: '浙江省/杭州市/西湖区/文新街道',
                treePath: '330000/330100/330106/330106006',

                level: 5,
              },
              {
                id: '330106003',

                label: '灵隐街道',
                parentId: '330106',

                children: null,

                code: '330106003',
                name: '浙江省/杭州市/西湖区/灵隐街道',
                treePath: '330000/330100/330106/330106003',

                level: 5,
              },
              {
                id: '330106013',

                label: '留下街道',
                parentId: '330106',

                children: null,

                code: '330106013',
                name: '浙江省/杭州市/西湖区/留下街道',
                treePath: '330000/330100/330106/330106013',

                level: 5,
              },
              {
                id: '330106005',

                label: '翠苑街道',
                parentId: '330106',

                children: null,

                code: '330106005',
                name: '浙江省/杭州市/西湖区/翠苑街道',
                treePath: '330000/330100/330106/330106005',

                level: 5,
              },
              {
                id: '330106012',

                label: '蒋村街道',
                parentId: '330106',

                children: null,

                code: '330106012',
                name: '浙江省/杭州市/西湖区/蒋村街道',
                treePath: '330000/330100/330106/330106012',

                level: 5,
              },
              {
                id: '330106015',

                label: '西湖街道',
                parentId: '330106',

                children: null,

                code: '330106015',
                name: '浙江省/杭州市/西湖区/西湖街道',
                treePath: '330000/330100/330106/330106015',

                level: 5,
              },
              {
                id: '330106004',

                label: '西溪街道',
                parentId: '330106',

                children: null,

                code: '330106004',
                name: '浙江省/杭州市/西湖区/西溪街道',
                treePath: '330000/330100/330106/330106004',

                level: 5,
              },
              {
                id: '330106011',

                label: '转塘街道',
                parentId: '330106',

                children: null,

                code: '330106011',
                name: '浙江省/杭州市/西湖区/转塘街道',
                treePath: '330000/330100/330106/330106011',

                level: 5,
              },
            ],

            code: '330106',
            name: '浙江省/杭州市/西湖区',
            treePath: '330000/330100/330106',

            level: 4,
          },
          {
            id: '330114',

            label: '钱塘区',
            parentId: '330100',

            children: [
              {
                id: '330114013',

                label: '下沙街道',
                parentId: '330114',

                children: null,

                code: '330114013',
                name: '浙江省/杭州市/钱塘区/下沙街道',
                treePath: '330000/330100/330114/330114013',

                level: 5,
              },
              {
                id: '330114011',

                label: '临江街道',
                parentId: '330114',

                children: null,

                code: '330114011',
                name: '浙江省/杭州市/钱塘区/临江街道',
                treePath: '330000/330100/330114/330114011',

                level: 5,
              },
              {
                id: '330114007',

                label: '义蓬街道',
                parentId: '330114',

                children: null,

                code: '330114007',
                name: '浙江省/杭州市/钱塘区/义蓬街道',
                treePath: '330000/330100/330114/330114007',

                level: 5,
              },
              {
                id: '330114010',

                label: '前进街道',
                parentId: '330114',

                children: null,

                code: '330114010',
                name: '浙江省/杭州市/钱塘区/前进街道',
                treePath: '330000/330100/330114/330114010',

                level: 5,
              },
              {
                id: '330114008',

                label: '新湾街道',
                parentId: '330114',

                children: null,

                code: '330114008',
                name: '浙江省/杭州市/钱塘区/新湾街道',
                treePath: '330000/330100/330114/330114008',

                level: 5,
              },
              {
                id: '330114009',

                label: '河庄街道',
                parentId: '330114',

                children: null,

                code: '330114009',
                name: '浙江省/杭州市/钱塘区/河庄街道',
                treePath: '330000/330100/330114/330114009',

                level: 5,
              },
              {
                id: '330114012',

                label: '白杨街道',
                parentId: '330114',

                children: null,

                code: '330114012',
                name: '浙江省/杭州市/钱塘区/白杨街道',
                treePath: '330000/330100/330114/330114012',

                level: 5,
              },
            ],

            code: '330114',
            name: '浙江省/杭州市/钱塘区',
            treePath: '330000/330100/330114',

            level: 4,
          },
        ],

        code: '330100',
        name: '浙江省/杭州市',
        treePath: '330000/330100',

        level: 3,
      },
      {
        id: '330300',

        label: '温州市',
        parentId: '330000',

        children: [
          {
            id: '330382',

            label: '乐清市',
            parentId: '330300',

            children: [
              {
                id: '330382008',

                label: '乐成街道',
                parentId: '330382',

                children: null,

                code: '330382008',
                name: '浙江省/温州市/乐清市/乐成街道',
                treePath: '330000/330300/330382/330382008',

                level: 5,
              },
              {
                id: '330382128',

                label: '仙溪镇',
                parentId: '330382',

                children: null,

                code: '330382128',
                name: '浙江省/温州市/乐清市/仙溪镇',
                treePath: '330000/330300/330382/330382128',

                level: 5,
              },
              {
                id: '330382122',

                label: '北白象镇',
                parentId: '330382',

                children: null,

                code: '330382122',
                name: '浙江省/温州市/乐清市/北白象镇',
                treePath: '330000/330300/330382/330382122',

                level: 5,
              },
              {
                id: '330382132',

                label: '南塘镇',
                parentId: '330382',

                children: null,

                code: '330382132',
                name: '浙江省/温州市/乐清市/南塘镇',
                treePath: '330000/330300/330382/330382132',

                level: 5,
              },
              {
                id: '330382131',

                label: '南岳镇',
                parentId: '330382',

                children: null,

                code: '330382131',
                name: '浙江省/温州市/乐清市/南岳镇',
                treePath: '330000/330300/330382/330382131',

                level: 5,
              },
              {
                id: '330382001',

                label: '城东街道',
                parentId: '330382',

                children: null,

                code: '330382001',
                name: '浙江省/温州市/乐清市/城东街道',
                treePath: '330000/330300/330382/330382001',

                level: 5,
              },
              {
                id: '330382002',

                label: '城南街道',
                parentId: '330382',

                children: null,

                code: '330382002',
                name: '浙江省/温州市/乐清市/城南街道',
                treePath: '330000/330300/330382/330382002',

                level: 5,
              },
              {
                id: '330382127',

                label: '大荆镇',
                parentId: '330382',

                children: null,

                code: '330382127',
                name: '浙江省/温州市/乐清市/大荆镇',
                treePath: '330000/330300/330382/330382127',

                level: 5,
              },
              {
                id: '330382007',

                label: '天成街道',
                parentId: '330382',

                children: null,

                code: '330382007',
                name: '浙江省/温州市/乐清市/天成街道',
                treePath: '330000/330300/330382/330382007',

                level: 5,
              },
              {
                id: '330382200',

                label: '岭底乡',
                parentId: '330382',

                children: null,

                code: '330382200',
                name: '浙江省/温州市/乐清市/岭底乡',
                treePath: '330000/330300/330382/330382200',

                level: 5,
              },
              {
                id: '330382201',

                label: '智仁乡',
                parentId: '330382',

                children: null,

                code: '330382201',
                name: '浙江省/温州市/乐清市/智仁乡',
                treePath: '330000/330300/330382/330382201',

                level: 5,
              },
              {
                id: '330382121',

                label: '柳市镇',
                parentId: '330382',

                children: null,

                code: '330382121',
                name: '浙江省/温州市/乐清市/柳市镇',
                treePath: '330000/330300/330382/330382121',

                level: 5,
              },
              {
                id: '330382124',

                label: '淡溪镇',
                parentId: '330382',

                children: null,

                code: '330382124',
                name: '浙江省/温州市/乐清市/淡溪镇',
                treePath: '330000/330300/330382/330382124',

                level: 5,
              },
              {
                id: '330382125',

                label: '清江镇',
                parentId: '330382',

                children: null,

                code: '330382125',
                name: '浙江省/温州市/乐清市/清江镇',
                treePath: '330000/330300/330382/330382125',

                level: 5,
              },
              {
                id: '330382133',

                label: '湖雾镇',
                parentId: '330382',

                children: null,

                code: '330382133',
                name: '浙江省/温州市/乐清市/湖雾镇',
                treePath: '330000/330300/330382/330382133',

                level: 5,
              },
              {
                id: '330382005',

                label: '白石街道',
                parentId: '330382',

                children: null,

                code: '330382005',
                name: '浙江省/温州市/乐清市/白石街道',
                treePath: '330000/330300/330382/330382005',

                level: 5,
              },
              {
                id: '330382003',

                label: '盐盆街道',
                parentId: '330382',

                children: null,

                code: '330382003',
                name: '浙江省/温州市/乐清市/盐盆街道',
                treePath: '330000/330300/330382/330382003',

                level: 5,
              },
              {
                id: '330382006',

                label: '石帆街道',
                parentId: '330382',

                children: null,

                code: '330382006',
                name: '浙江省/温州市/乐清市/石帆街道',
                treePath: '330000/330300/330382/330382006',

                level: 5,
              },
              {
                id: '330382129',

                label: '磐石镇',
                parentId: '330382',

                children: null,

                code: '330382129',
                name: '浙江省/温州市/乐清市/磐石镇',
                treePath: '330000/330300/330382/330382129',

                level: 5,
              },
              {
                id: '330382004',

                label: '翁垟街道',
                parentId: '330382',

                children: null,

                code: '330382004',
                name: '浙江省/温州市/乐清市/翁垟街道',
                treePath: '330000/330300/330382/330382004',

                level: 5,
              },
              {
                id: '330382126',

                label: '芙蓉镇',
                parentId: '330382',

                children: null,

                code: '330382126',
                name: '浙江省/温州市/乐清市/芙蓉镇',
                treePath: '330000/330300/330382/330382126',

                level: 5,
              },
              {
                id: '330382130',

                label: '蒲岐镇',
                parentId: '330382',

                children: null,

                code: '330382130',
                name: '浙江省/温州市/乐清市/蒲岐镇',
                treePath: '330000/330300/330382/330382130',

                level: 5,
              },
              {
                id: '330382123',

                label: '虹桥镇',
                parentId: '330382',

                children: null,

                code: '330382123',
                name: '浙江省/温州市/乐清市/虹桥镇',
                treePath: '330000/330300/330382/330382123',

                level: 5,
              },
              {
                id: '330382219',

                label: '镇安乡',
                parentId: '330382',

                children: null,

                code: '330382219',
                name: '浙江省/温州市/乐清市/镇安乡',
                treePath: '330000/330300/330382/330382219',

                level: 5,
              },
              {
                id: '330382104',

                label: '雁荡镇',
                parentId: '330382',

                children: null,

                code: '330382104',
                name: '浙江省/温州市/乐清市/雁荡镇',
                treePath: '330000/330300/330382/330382104',

                level: 5,
              },
              {
                id: '330382202',

                label: '龙西乡',
                parentId: '330382',

                children: null,

                code: '330382202',
                name: '浙江省/温州市/乐清市/龙西乡',
                treePath: '330000/330300/330382/330382202',

                level: 5,
              },
            ],

            code: '330382',
            name: '浙江省/温州市/乐清市',
            treePath: '330000/330300/330382',

            level: 4,
          },
          {
            id: '330326',

            label: '平阳县',
            parentId: '330300',

            children: [
              {
                id: '330326112',

                label: '万全镇',
                parentId: '330326',

                children: null,

                code: '330326112',
                name: '浙江省/温州市/平阳县/万全镇',
                treePath: '330000/330300/330326/330326112',

                level: 5,
              },
              {
                id: '330326109',

                label: '南雁镇',
                parentId: '330326',

                children: null,

                code: '330326109',
                name: '浙江省/温州市/平阳县/南雁镇',
                treePath: '330000/330300/330326/330326109',

                level: 5,
              },
              {
                id: '330326107',

                label: '山门镇',
                parentId: '330326',

                children: null,

                code: '330326107',
                name: '浙江省/温州市/平阳县/山门镇',
                treePath: '330000/330300/330326/330326107',

                level: 5,
              },
              {
                id: '330326100',

                label: '昆阳镇',
                parentId: '330326',

                children: null,

                code: '330326100',
                name: '浙江省/温州市/平阳县/昆阳镇',
                treePath: '330000/330300/330326/330326100',

                level: 5,
              },
              {
                id: '330326102',

                label: '水头镇',
                parentId: '330326',

                children: null,

                code: '330326102',
                name: '浙江省/温州市/平阳县/水头镇',
                treePath: '330000/330300/330326/330326102',

                level: 5,
              },
              {
                id: '330326105',

                label: '腾蛟镇',
                parentId: '330326',

                children: null,

                code: '330326105',
                name: '浙江省/温州市/平阳县/腾蛟镇',
                treePath: '330000/330300/330326/330326105',

                level: 5,
              },
              {
                id: '330326103',

                label: '萧江镇',
                parentId: '330326',

                children: null,

                code: '330326103',
                name: '浙江省/温州市/平阳县/萧江镇',
                treePath: '330000/330300/330326/330326103',

                level: 5,
              },
              {
                id: '330326214',

                label: '青街畲族乡',
                parentId: '330326',

                children: null,

                code: '330326214',
                name: '浙江省/温州市/平阳县/青街畲族乡',
                treePath: '330000/330300/330326/330326214',

                level: 5,
              },
              {
                id: '330326108',

                label: '顺溪镇',
                parentId: '330326',

                children: null,

                code: '330326108',
                name: '浙江省/温州市/平阳县/顺溪镇',
                treePath: '330000/330300/330326/330326108',

                level: 5,
              },
              {
                id: '330326101',

                label: '鳌江镇',
                parentId: '330326',

                children: null,

                code: '330326101',
                name: '浙江省/温州市/平阳县/鳌江镇',
                treePath: '330000/330300/330326/330326101',

                level: 5,
              },
            ],

            code: '330326',
            name: '浙江省/温州市/平阳县',
            treePath: '330000/330300/330326',

            level: 4,
          },
          {
            id: '330328',

            label: '文成县',
            parentId: '330300',

            children: [
              {
                id: '330328111',

                label: '南田镇',
                parentId: '330328',

                children: null,

                code: '330328111',
                name: '浙江省/温州市/文成县/南田镇',
                treePath: '330000/330300/330328/330328111',

                level: 5,
              },
              {
                id: '330328217',

                label: '周山畲族乡',
                parentId: '330328',

                children: null,

                code: '330328217',
                name: '浙江省/温州市/文成县/周山畲族乡',
                treePath: '330000/330300/330328/330328217',

                level: 5,
              },
              {
                id: '330328115',

                label: '大峃镇',
                parentId: '330328',

                children: null,

                code: '330328115',
                name: '浙江省/温州市/文成县/大峃镇',
                treePath: '330000/330300/330328/330328115',

                level: 5,
              },
              {
                id: '330328114',

                label: '峃口镇',
                parentId: '330328',

                children: null,

                code: '330328114',
                name: '浙江省/温州市/文成县/峃口镇',
                treePath: '330000/330300/330328/330328114',

                level: 5,
              },
              {
                id: '330328106',

                label: '巨屿镇',
                parentId: '330328',

                children: null,

                code: '330328106',
                name: '浙江省/温州市/文成县/巨屿镇',
                treePath: '330000/330300/330328/330328106',

                level: 5,
              },
              {
                id: '330328110',

                label: '玉壶镇',
                parentId: '330328',

                children: null,

                code: '330328110',
                name: '浙江省/温州市/文成县/玉壶镇',
                treePath: '330000/330300/330328/330328110',

                level: 5,
              },
              {
                id: '330328109',

                label: '珊溪镇',
                parentId: '330328',

                children: null,

                code: '330328109',
                name: '浙江省/温州市/文成县/珊溪镇',
                treePath: '330000/330300/330328/330328109',

                level: 5,
              },
              {
                id: '330328101',

                label: '百丈漈镇',
                parentId: '330328',

                children: null,

                code: '330328101',
                name: '浙江省/温州市/文成县/百丈漈镇',
                treePath: '330000/330300/330328/330328101',

                level: 5,
              },
              {
                id: '330328113',

                label: '西坑畲族镇',
                parentId: '330328',

                children: null,

                code: '330328113',
                name: '浙江省/温州市/文成县/西坑畲族镇',
                treePath: '330000/330300/330328/330328113',

                level: 5,
              },
              {
                id: '330328112',

                label: '黄坦镇',
                parentId: '330328',

                children: null,

                code: '330328112',
                name: '浙江省/温州市/文成县/黄坦镇',
                treePath: '330000/330300/330328/330328112',

                level: 5,
              },
            ],

            code: '330328',
            name: '浙江省/温州市/文成县',
            treePath: '330000/330300/330328',

            level: 4,
          },
          {
            id: '330324',

            label: '永嘉县',
            parentId: '330300',

            children: [
              {
                id: '330324007',

                label: '三江街道',
                parentId: '330324',

                children: null,

                code: '330324007',
                name: '浙江省/温州市/永嘉县/三江街道',
                treePath: '330000/330300/330324/330324007',

                level: 5,
              },
              {
                id: '330324002',

                label: '东城街道',
                parentId: '330324',

                children: null,

                code: '330324002',
                name: '浙江省/温州市/永嘉县/东城街道',
                treePath: '330000/330300/330324/330324002',

                level: 5,
              },
              {
                id: '330324001',

                label: '乌牛街道',
                parentId: '330324',

                children: null,

                code: '330324001',
                name: '浙江省/温州市/永嘉县/乌牛街道',
                treePath: '330000/330300/330324/330324001',

                level: 5,
              },
              {
                id: '330324003',

                label: '北城街道',
                parentId: '330324',

                children: null,

                code: '330324003',
                name: '浙江省/温州市/永嘉县/北城街道',
                treePath: '330000/330300/330324/330324003',

                level: 5,
              },
              {
                id: '330324004',

                label: '南城街道',
                parentId: '330324',

                children: null,

                code: '330324004',
                name: '浙江省/温州市/永嘉县/南城街道',
                treePath: '330000/330300/330324/330324004',

                level: 5,
              },
              {
                id: '330324105',

                label: '大若岩镇',
                parentId: '330324',

                children: null,

                code: '330324105',
                name: '浙江省/温州市/永嘉县/大若岩镇',
                treePath: '330000/330300/330324/330324105',

                level: 5,
              },
              {
                id: '330324116',

                label: '岩坦镇',
                parentId: '330324',

                children: null,

                code: '330324116',
                name: '浙江省/温州市/永嘉县/岩坦镇',
                treePath: '330000/330300/330324/330324116',

                level: 5,
              },
              {
                id: '330324115',

                label: '岩头镇',
                parentId: '330324',

                children: null,

                code: '330324115',
                name: '浙江省/温州市/永嘉县/岩头镇',
                treePath: '330000/330300/330324/330324115',

                level: 5,
              },
              {
                id: '330324114',

                label: '巽宅镇',
                parentId: '330324',

                children: null,

                code: '330324114',
                name: '浙江省/温州市/永嘉县/巽宅镇',
                treePath: '330000/330300/330324/330324114',

                level: 5,
              },
              {
                id: '330324109',

                label: '枫林镇',
                parentId: '330324',

                children: null,

                code: '330324109',
                name: '浙江省/温州市/永嘉县/枫林镇',
                treePath: '330000/330300/330324/330324109',

                level: 5,
              },
              {
                id: '330324112',

                label: '桥下镇',
                parentId: '330324',

                children: null,

                code: '330324112',
                name: '浙江省/温州市/永嘉县/桥下镇',
                treePath: '330000/330300/330324/330324112',

                level: 5,
              },
              {
                id: '330324102',

                label: '桥头镇',
                parentId: '330324',

                children: null,

                code: '330324102',
                name: '浙江省/温州市/永嘉县/桥头镇',
                treePath: '330000/330300/330324/330324102',

                level: 5,
              },
              {
                id: '330324117',

                label: '沙头镇',
                parentId: '330324',

                children: null,

                code: '330324117',
                name: '浙江省/温州市/永嘉县/沙头镇',
                treePath: '330000/330300/330324/330324117',

                level: 5,
              },
              {
                id: '330324009',

                label: '瓯北街道',
                parentId: '330324',

                children: null,

                code: '330324009',
                name: '浙江省/温州市/永嘉县/瓯北街道',
                treePath: '330000/330300/330324/330324009',

                level: 5,
              },
              {
                id: '330324113',

                label: '碧莲镇',
                parentId: '330324',

                children: null,

                code: '330324113',
                name: '浙江省/温州市/永嘉县/碧莲镇',
                treePath: '330000/330300/330324/330324113',

                level: 5,
              },
              {
                id: '330324118',

                label: '鹤盛镇',
                parentId: '330324',

                children: null,

                code: '330324118',
                name: '浙江省/温州市/永嘉县/鹤盛镇',
                treePath: '330000/330300/330324/330324118',

                level: 5,
              },
              {
                id: '330324008',

                label: '黄田街道',
                parentId: '330324',

                children: null,

                code: '330324008',
                name: '浙江省/温州市/永嘉县/黄田街道',
                treePath: '330000/330300/330324/330324008',

                level: 5,
              },
            ],

            code: '330324',
            name: '浙江省/温州市/永嘉县',
            treePath: '330000/330300/330324',

            level: 4,
          },
          {
            id: '330329',

            label: '泰顺县',
            parentId: '330300',

            children: [
              {
                id: '330329118',

                label: '三魁镇',
                parentId: '330329',

                children: null,

                code: '330329118',
                name: '浙江省/温州市/泰顺县/三魁镇',
                treePath: '330000/330300/330329/330329118',

                level: 5,
              },
              {
                id: '330329117',

                label: '仕阳镇',
                parentId: '330329',

                children: null,

                code: '330329117',
                name: '浙江省/温州市/泰顺县/仕阳镇',
                treePath: '330000/330300/330329/330329117',

                level: 5,
              },
              {
                id: '330329112',

                label: '司前畲族镇',
                parentId: '330329',

                children: null,

                code: '330329112',
                name: '浙江省/温州市/泰顺县/司前畲族镇',
                treePath: '330000/330300/330329/330329112',

                level: 5,
              },
              {
                id: '330329115',

                label: '彭溪镇',
                parentId: '330329',

                children: null,

                code: '330329115',
                name: '浙江省/温州市/泰顺县/彭溪镇',
                treePath: '330000/330300/330329/330329115',

                level: 5,
              },
              {
                id: '330329114',

                label: '泗溪镇',
                parentId: '330329',

                children: null,

                code: '330329114',
                name: '浙江省/温州市/泰顺县/泗溪镇',
                treePath: '330000/330300/330329/330329114',

                level: 5,
              },
              {
                id: '330329102',

                label: '百丈镇',
                parentId: '330329',

                children: null,

                code: '330329102',
                name: '浙江省/温州市/泰顺县/百丈镇',
                treePath: '330000/330300/330329/330329102',

                level: 5,
              },
              {
                id: '330329204',

                label: '竹里畲族乡',
                parentId: '330329',

                children: null,

                code: '330329204',
                name: '浙江省/温州市/泰顺县/竹里畲族乡',
                treePath: '330000/330300/330329/330329204',

                level: 5,
              },
              {
                id: '330329113',

                label: '筱村镇',
                parentId: '330329',

                children: null,

                code: '330329113',
                name: '浙江省/温州市/泰顺县/筱村镇',
                treePath: '330000/330300/330329/330329113',

                level: 5,
              },
              {
                id: '330329111',

                label: '罗阳镇',
                parentId: '330329',

                children: null,

                code: '330329111',
                name: '浙江省/温州市/泰顺县/罗阳镇',
                treePath: '330000/330300/330329/330329111',

                level: 5,
              },
              {
                id: '330329116',

                label: '雅阳镇',
                parentId: '330329',

                children: null,

                code: '330329116',
                name: '浙江省/温州市/泰顺县/雅阳镇',
                treePath: '330000/330300/330329/330329116',

                level: 5,
              },
            ],

            code: '330329',
            name: '浙江省/温州市/泰顺县',
            treePath: '330000/330300/330329',

            level: 4,
          },
          {
            id: '330305',

            label: '洞头区',
            parentId: '330300',

            children: [
              {
                id: '330305002',

                label: '东屏街道',
                parentId: '330305',

                children: null,

                code: '330305002',
                name: '浙江省/温州市/洞头区/东屏街道',
                treePath: '330000/330300/330305/330305002',

                level: 5,
              },
              {
                id: '330305003',

                label: '元觉街道',
                parentId: '330305',

                children: null,

                code: '330305003',
                name: '浙江省/温州市/洞头区/元觉街道',
                treePath: '330000/330300/330305/330305003',

                level: 5,
              },
              {
                id: '330305001',

                label: '北岙街道',
                parentId: '330305',

                children: null,

                code: '330305001',
                name: '浙江省/温州市/洞头区/北岙街道',
                treePath: '330000/330300/330305/330305001',

                level: 5,
              },
              {
                id: '330305100',

                label: '大门镇',
                parentId: '330305',

                children: null,

                code: '330305100',
                name: '浙江省/温州市/洞头区/大门镇',
                treePath: '330000/330300/330305/330305100',

                level: 5,
              },
              {
                id: '330305012',

                label: '昆鹏街道',
                parentId: '330305',

                children: null,

                code: '330305012',
                name: '浙江省/温州市/洞头区/昆鹏街道',
                treePath: '330000/330300/330305/330305012',

                level: 5,
              },
              {
                id: '330305011',

                label: '灵昆街道',
                parentId: '330305',

                children: null,

                code: '330305011',
                name: '浙江省/温州市/洞头区/灵昆街道',
                treePath: '330000/330300/330305/330305011',

                level: 5,
              },
              {
                id: '330305004',

                label: '霓屿街道',
                parentId: '330305',

                children: null,

                code: '330305004',
                name: '浙江省/温州市/洞头区/霓屿街道',
                treePath: '330000/330300/330305/330305004',

                level: 5,
              },
              {
                id: '330305200',

                label: '鹿西乡',
                parentId: '330305',

                children: null,

                code: '330305200',
                name: '浙江省/温州市/洞头区/鹿西乡',
                treePath: '330000/330300/330305/330305200',

                level: 5,
              },
            ],

            code: '330305',
            name: '浙江省/温州市/洞头区',
            treePath: '330000/330300/330305',

            level: 4,
          },
          {
            id: '330381',

            label: '瑞安市',
            parentId: '330300',

            children: [
              {
                id: '330381002',

                label: '上望街道',
                parentId: '330381',

                children: null,

                code: '330381002',
                name: '浙江省/温州市/瑞安市/上望街道',
                treePath: '330000/330300/330381/330381002',

                level: 5,
              },
              {
                id: '330381003',

                label: '东山街道',
                parentId: '330381',

                children: null,

                code: '330381003',
                name: '浙江省/温州市/瑞安市/东山街道',
                treePath: '330000/330300/330381/330381003',

                level: 5,
              },
              {
                id: '330381012',

                label: '云周街道',
                parentId: '330381',

                children: null,

                code: '330381012',
                name: '浙江省/温州市/瑞安市/云周街道',
                treePath: '330000/330300/330381/330381012',

                level: 5,
              },
              {
                id: '330381010',

                label: '仙降街道',
                parentId: '330381',

                children: null,

                code: '330381010',
                name: '浙江省/温州市/瑞安市/仙降街道',
                treePath: '330000/330300/330381/330381010',

                level: 5,
              },
              {
                id: '330381201',

                label: '北麂乡',
                parentId: '330381',

                children: null,

                code: '330381201',
                name: '浙江省/温州市/瑞安市/北麂乡',
                treePath: '330000/330300/330381/330381201',

                level: 5,
              },
              {
                id: '330381008',

                label: '南滨街道',
                parentId: '330381',

                children: null,

                code: '330381008',
                name: '浙江省/温州市/瑞安市/南滨街道',
                treePath: '330000/330300/330381/330381008',

                level: 5,
              },
              {
                id: '330381101',

                label: '塘下镇',
                parentId: '330381',

                children: null,

                code: '330381101',
                name: '浙江省/温州市/瑞安市/塘下镇',
                treePath: '330000/330300/330381/330381101',

                level: 5,
              },
              {
                id: '330381001',

                label: '安阳街道',
                parentId: '330381',

                children: null,

                code: '330381001',
                name: '浙江省/温州市/瑞安市/安阳街道',
                treePath: '330000/330300/330381/330381001',

                level: 5,
              },
              {
                id: '330381132',

                label: '平阳坑镇',
                parentId: '330381',

                children: null,

                code: '330381132',
                name: '浙江省/温州市/瑞安市/平阳坑镇',
                treePath: '330000/330300/330381/330381132',

                level: 5,
              },
              {
                id: '330381130',

                label: '曹村镇',
                parentId: '330381',

                children: null,

                code: '330381130',
                name: '浙江省/温州市/瑞安市/曹村镇',
                treePath: '330000/330300/330381/330381130',

                level: 5,
              },
              {
                id: '330381131',

                label: '林川镇',
                parentId: '330381',

                children: null,

                code: '330381131',
                name: '浙江省/温州市/瑞安市/林川镇',
                treePath: '330000/330300/330381/330381131',

                level: 5,
              },
              {
                id: '330381129',

                label: '桐浦镇',
                parentId: '330381',

                children: null,

                code: '330381129',
                name: '浙江省/温州市/瑞安市/桐浦镇',
                treePath: '330000/330300/330381/330381129',

                level: 5,
              },
              {
                id: '330381007',

                label: '汀田街道',
                parentId: '330381',

                children: null,

                code: '330381007',
                name: '浙江省/温州市/瑞安市/汀田街道',
                treePath: '330000/330300/330381/330381007',

                level: 5,
              },
              {
                id: '330381126',

                label: '湖岭镇',
                parentId: '330381',

                children: null,

                code: '330381126',
                name: '浙江省/温州市/瑞安市/湖岭镇',
                treePath: '330000/330300/330381/330381126',

                level: 5,
              },
              {
                id: '330381011',

                label: '潘岱街道',
                parentId: '330381',

                children: null,

                code: '330381011',
                name: '浙江省/温州市/瑞安市/潘岱街道',
                treePath: '330000/330300/330381/330381011',

                level: 5,
              },
              {
                id: '330381004',

                label: '玉海街道',
                parentId: '330381',

                children: null,

                code: '330381004',
                name: '浙江省/温州市/瑞安市/玉海街道',
                treePath: '330000/330300/330381/330381004',

                level: 5,
              },
              {
                id: '330381202',

                label: '芳庄乡',
                parentId: '330381',

                children: null,

                code: '330381202',
                name: '浙江省/温州市/瑞安市/芳庄乡',
                treePath: '330000/330300/330381/330381202',

                level: 5,
              },
              {
                id: '330381006',

                label: '莘塍街道',
                parentId: '330381',

                children: null,

                code: '330381006',
                name: '浙江省/温州市/瑞安市/莘塍街道',
                treePath: '330000/330300/330381/330381006',

                level: 5,
              },
              {
                id: '330381005',

                label: '锦湖街道',
                parentId: '330381',

                children: null,

                code: '330381005',
                name: '浙江省/温州市/瑞安市/锦湖街道',
                treePath: '330000/330300/330381/330381005',

                level: 5,
              },
              {
                id: '330381125',

                label: '陶山镇',
                parentId: '330381',

                children: null,

                code: '330381125',
                name: '浙江省/温州市/瑞安市/陶山镇',
                treePath: '330000/330300/330381/330381125',

                level: 5,
              },
              {
                id: '330381009',

                label: '飞云街道',
                parentId: '330381',

                children: null,

                code: '330381009',
                name: '浙江省/温州市/瑞安市/飞云街道',
                treePath: '330000/330300/330381/330381009',

                level: 5,
              },
              {
                id: '330381127',

                label: '马屿镇',
                parentId: '330381',

                children: null,

                code: '330381127',
                name: '浙江省/温州市/瑞安市/马屿镇',
                treePath: '330000/330300/330381/330381127',

                level: 5,
              },
              {
                id: '330381128',

                label: '高楼镇',
                parentId: '330381',

                children: null,

                code: '330381128',
                name: '浙江省/温州市/瑞安市/高楼镇',
                treePath: '330000/330300/330381/330381128',

                level: 5,
              },
            ],

            code: '330381',
            name: '浙江省/温州市/瑞安市',
            treePath: '330000/330300/330381',

            level: 4,
          },
          {
            id: '330304',

            label: '瓯海区',
            parentId: '330300',

            children: [
              {
                id: '330304007',

                label: '三垟街道',
                parentId: '330304',

                children: null,

                code: '330304007',
                name: '浙江省/温州市/瓯海区/三垟街道',
                treePath: '330000/330300/330304/330304007',

                level: 5,
              },
              {
                id: '330304011',

                label: '丽岙街道',
                parentId: '330304',

                children: null,

                code: '330304011',
                name: '浙江省/温州市/瓯海区/丽岙街道',
                treePath: '330000/330300/330304/330304011',

                level: 5,
              },
              {
                id: '330304012',

                label: '仙岩街道',
                parentId: '330304',

                children: null,

                code: '330304012',
                name: '浙江省/温州市/瓯海区/仙岩街道',
                treePath: '330000/330300/330304/330304012',

                level: 5,
              },
              {
                id: '330304004',

                label: '南白象街道',
                parentId: '330304',

                children: null,

                code: '330304004',
                name: '浙江省/温州市/瓯海区/南白象街道',
                treePath: '330000/330300/330304/330304004',

                level: 5,
              },
              {
                id: '330304006',

                label: '娄桥街道',
                parentId: '330304',

                children: null,

                code: '330304006',
                name: '浙江省/温州市/瓯海区/娄桥街道',
                treePath: '330000/330300/330304/330304006',

                level: 5,
              },
              {
                id: '330304005',

                label: '新桥街道',
                parentId: '330304',

                children: null,

                code: '330304005',
                name: '浙江省/温州市/瓯海区/新桥街道',
                treePath: '330000/330300/330304/330304005',

                level: 5,
              },
              {
                id: '330304001',

                label: '景山街道',
                parentId: '330304',

                children: null,

                code: '330304001',
                name: '浙江省/温州市/瓯海区/景山街道',
                treePath: '330000/330300/330304/330304001',

                level: 5,
              },
              {
                id: '330304002',

                label: '梧田街道',
                parentId: '330304',

                children: null,

                code: '330304002',
                name: '浙江省/温州市/瓯海区/梧田街道',
                treePath: '330000/330300/330304/330304002',

                level: 5,
              },
              {
                id: '330304108',

                label: '泽雅镇',
                parentId: '330304',

                children: null,

                code: '330304108',
                name: '浙江省/温州市/瓯海区/泽雅镇',
                treePath: '330000/330300/330304/330304108',

                level: 5,
              },
              {
                id: '330304010',

                label: '潘桥街道',
                parentId: '330304',

                children: null,

                code: '330304010',
                name: '浙江省/温州市/瓯海区/潘桥街道',
                treePath: '330000/330300/330304/330304010',

                level: 5,
              },
              {
                id: '330304008',

                label: '瞿溪街道',
                parentId: '330304',

                children: null,

                code: '330304008',
                name: '浙江省/温州市/瓯海区/瞿溪街道',
                treePath: '330000/330300/330304/330304008',

                level: 5,
              },
              {
                id: '330304003',

                label: '茶山街道',
                parentId: '330304',

                children: null,

                code: '330304003',
                name: '浙江省/温州市/瓯海区/茶山街道',
                treePath: '330000/330300/330304/330304003',

                level: 5,
              },
              {
                id: '330304013',

                label: '郭溪街道',
                parentId: '330304',

                children: null,

                code: '330304013',
                name: '浙江省/温州市/瓯海区/郭溪街道',
                treePath: '330000/330300/330304/330304013',

                level: 5,
              },
            ],

            code: '330304',
            name: '浙江省/温州市/瓯海区',
            treePath: '330000/330300/330304',

            level: 4,
          },
          {
            id: '330327',

            label: '苍南县',
            parentId: '330300',

            children: [
              {
                id: '330327216',

                label: '凤阳畲族乡',
                parentId: '330327',

                children: null,

                code: '330327216',
                name: '浙江省/温州市/苍南县/凤阳畲族乡',
                treePath: '330000/330300/330327/330327216',

                level: 5,
              },
              {
                id: '330327103',

                label: '宜山镇',
                parentId: '330327',

                children: null,

                code: '330327103',
                name: '浙江省/温州市/苍南县/宜山镇',
                treePath: '330000/330300/330327/330327103',

                level: 5,
              },
              {
                id: '330327218',

                label: '岱岭畲族乡',
                parentId: '330327',

                children: null,

                code: '330327218',
                name: '浙江省/温州市/苍南县/岱岭畲族乡',
                treePath: '330000/330300/330327/330327218',

                level: 5,
              },
              {
                id: '330327128',

                label: '桥墩镇',
                parentId: '330327',

                children: null,

                code: '330327128',
                name: '浙江省/温州市/苍南县/桥墩镇',
                treePath: '330000/330300/330327/330327128',

                level: 5,
              },
              {
                id: '330327122',

                label: '灵溪镇',
                parentId: '330327',

                children: null,

                code: '330327122',
                name: '浙江省/温州市/苍南县/灵溪镇',
                treePath: '330000/330300/330327/330327122',

                level: 5,
              },
              {
                id: '330327127',

                label: '矾山镇',
                parentId: '330327',

                children: null,

                code: '330327127',
                name: '浙江省/温州市/苍南县/矾山镇',
                treePath: '330000/330300/330327/330327127',

                level: 5,
              },
              {
                id: '330327112',

                label: '藻溪镇',
                parentId: '330327',

                children: null,

                code: '330327112',
                name: '浙江省/温州市/苍南县/藻溪镇',
                treePath: '330000/330300/330327/330327112',

                level: 5,
              },
              {
                id: '330327129',

                label: '赤溪镇',
                parentId: '330327',

                children: null,

                code: '330327129',
                name: '浙江省/温州市/苍南县/赤溪镇',
                treePath: '330000/330300/330327/330327129',

                level: 5,
              },
              {
                id: '330327124',

                label: '金乡镇',
                parentId: '330327',

                children: null,

                code: '330327124',
                name: '浙江省/温州市/苍南县/金乡镇',
                treePath: '330000/330300/330327/330327124',

                level: 5,
              },
              {
                id: '330327125',

                label: '钱库镇',
                parentId: '330327',

                children: null,

                code: '330327125',
                name: '浙江省/温州市/苍南县/钱库镇',
                treePath: '330000/330300/330327/330327125',

                level: 5,
              },
              {
                id: '330327126',

                label: '马站镇',
                parentId: '330327',

                children: null,

                code: '330327126',
                name: '浙江省/温州市/苍南县/马站镇',
                treePath: '330000/330300/330327/330327126',

                level: 5,
              },
            ],

            code: '330327',
            name: '浙江省/温州市/苍南县',
            treePath: '330000/330300/330327',

            level: 4,
          },
          {
            id: '330302',

            label: '鹿城区',
            parentId: '330300',

            children: [
              {
                id: '330302024',

                label: '七都街道',
                parentId: '330302',

                children: null,

                code: '330302024',
                name: '浙江省/温州市/鹿城区/七都街道',
                treePath: '330000/330300/330302/330302024',

                level: 5,
              },
              {
                id: '330302018',

                label: '五马街道',
                parentId: '330302',

                children: null,

                code: '330302018',
                name: '浙江省/温州市/鹿城区/五马街道',
                treePath: '330000/330300/330302/330302018',

                level: 5,
              },
              {
                id: '330302023',

                label: '仰义街道',
                parentId: '330302',

                children: null,

                code: '330302023',
                name: '浙江省/温州市/鹿城区/仰义街道',
                treePath: '330000/330300/330302/330302023',

                level: 5,
              },
              {
                id: '330302021',

                label: '南汇街道',
                parentId: '330302',

                children: null,

                code: '330302021',
                name: '浙江省/温州市/鹿城区/南汇街道',
                treePath: '330000/330300/330302/330302021',

                level: 5,
              },
              {
                id: '330302022',

                label: '双屿街道',
                parentId: '330302',

                children: null,

                code: '330302022',
                name: '浙江省/温州市/鹿城区/双屿街道',
                treePath: '330000/330300/330302/330302022',

                level: 5,
              },
              {
                id: '330302014',

                label: '松台街道',
                parentId: '330302',

                children: null,

                code: '330302014',
                name: '浙江省/温州市/鹿城区/松台街道',
                treePath: '330000/330300/330302/330302014',

                level: 5,
              },
              {
                id: '330302002',

                label: '滨江街道',
                parentId: '330302',

                children: null,

                code: '330302002',
                name: '浙江省/温州市/鹿城区/滨江街道',
                treePath: '330000/330300/330302/330302002',

                level: 5,
              },
              {
                id: '330302100',

                label: '藤桥镇',
                parentId: '330302',

                children: null,

                code: '330302100',
                name: '浙江省/温州市/鹿城区/藤桥镇',
                treePath: '330000/330300/330302/330302100',

                level: 5,
              },
            ],

            code: '330302',
            name: '浙江省/温州市/鹿城区',
            treePath: '330000/330300/330302',

            level: 4,
          },
          {
            id: '330383',

            label: '龙港市',
            parentId: '330300',

            children: [
              {
                id: '330383000',

                label: '龙港市',
                parentId: '330383',

                children: null,

                code: '330383000',
                name: '浙江省/温州市/龙港市/龙港市',
                treePath: '330000/330300/330383/330383000',

                level: 5,
              },
            ],

            code: '330383',
            name: '浙江省/温州市/龙港市',
            treePath: '330000/330300/330383',

            level: 4,
          },
          {
            id: '330303',

            label: '龙湾区',
            parentId: '330300',

            children: [
              {
                id: '330303009',

                label: '天河街道',
                parentId: '330303',

                children: null,

                code: '330303009',
                name: '浙江省/温州市/龙湾区/天河街道',
                treePath: '330000/330300/330303/330303009',

                level: 5,
              },
              {
                id: '330303011',

                label: '星海街道',
                parentId: '330303',

                children: null,

                code: '330303011',
                name: '浙江省/温州市/龙湾区/星海街道',
                treePath: '330000/330300/330303/330303011',

                level: 5,
              },
              {
                id: '330303001',

                label: '永中街道',
                parentId: '330303',

                children: null,

                code: '330303001',
                name: '浙江省/温州市/龙湾区/永中街道',
                treePath: '330000/330300/330303/330303001',

                level: 5,
              },
              {
                id: '330303004',

                label: '永兴街道',
                parentId: '330303',

                children: null,

                code: '330303004',
                name: '浙江省/温州市/龙湾区/永兴街道',
                treePath: '330000/330300/330303/330303004',

                level: 5,
              },
              {
                id: '330303008',

                label: '沙城街道',
                parentId: '330303',

                children: null,

                code: '330303008',
                name: '浙江省/温州市/龙湾区/沙城街道',
                treePath: '330000/330300/330303/330303008',

                level: 5,
              },
              {
                id: '330303005',

                label: '海城街道',
                parentId: '330303',

                children: null,

                code: '330303005',
                name: '浙江省/温州市/龙湾区/海城街道',
                treePath: '330000/330300/330303/330303005',

                level: 5,
              },
              {
                id: '330303003',

                label: '海滨街道',
                parentId: '330303',

                children: null,

                code: '330303003',
                name: '浙江省/温州市/龙湾区/海滨街道',
                treePath: '330000/330300/330303/330303003',

                level: 5,
              },
              {
                id: '330303006',

                label: '状元街道',
                parentId: '330303',

                children: null,

                code: '330303006',
                name: '浙江省/温州市/龙湾区/状元街道',
                treePath: '330000/330300/330303/330303006',

                level: 5,
              },
              {
                id: '330303007',

                label: '瑶溪街道',
                parentId: '330303',

                children: null,

                code: '330303007',
                name: '浙江省/温州市/龙湾区/瑶溪街道',
                treePath: '330000/330300/330303/330303007',

                level: 5,
              },
              {
                id: '330303002',

                label: '蒲州街道',
                parentId: '330303',

                children: null,

                code: '330303002',
                name: '浙江省/温州市/龙湾区/蒲州街道',
                treePath: '330000/330300/330303/330303002',

                level: 5,
              },
            ],

            code: '330303',
            name: '浙江省/温州市/龙湾区',
            treePath: '330000/330300/330303',

            level: 4,
          },
        ],

        code: '330300',
        name: '浙江省/温州市',
        treePath: '330000/330300',

        level: 3,
      },
      {
        id: '330500',

        label: '湖州市',
        parentId: '330000',

        children: [
          {
            id: '330503',

            label: '南浔区',
            parentId: '330500',

            children: [
              {
                id: '330503107',

                label: '千金镇',
                parentId: '330503',

                children: null,

                code: '330503107',
                name: '浙江省/湖州市/南浔区/千金镇',
                treePath: '330000/330500/330503/330503107',

                level: 5,
              },
              {
                id: '330503100',

                label: '南浔镇',
                parentId: '330503',

                children: null,

                code: '330503100',
                name: '浙江省/湖州市/南浔区/南浔镇',
                treePath: '330000/330500/330503/330503100',

                level: 5,
              },
              {
                id: '330503102',

                label: '双林镇',
                parentId: '330503',

                children: null,

                code: '330503102',
                name: '浙江省/湖州市/南浔区/双林镇',
                treePath: '330000/330500/330503/330503102',

                level: 5,
              },
              {
                id: '330503104',

                label: '和孚镇',
                parentId: '330503',

                children: null,

                code: '330503104',
                name: '浙江省/湖州市/南浔区/和孚镇',
                treePath: '330000/330500/330503/330503104',

                level: 5,
              },
              {
                id: '330503105',

                label: '善琏镇',
                parentId: '330503',

                children: null,

                code: '330503105',
                name: '浙江省/湖州市/南浔区/善琏镇',
                treePath: '330000/330500/330503/330503105',

                level: 5,
              },
              {
                id: '330503400',

                label: '开发区',
                parentId: '330503',

                children: null,

                code: '330503400',
                name: '浙江省/湖州市/南浔区/开发区',
                treePath: '330000/330500/330503/330503400',

                level: 5,
              },
              {
                id: '330503106',

                label: '旧馆镇',
                parentId: '330503',

                children: null,

                code: '330503106',
                name: '浙江省/湖州市/南浔区/旧馆镇',
                treePath: '330000/330500/330503/330503106',

                level: 5,
              },
              {
                id: '330503108',

                label: '石淙镇',
                parentId: '330503',

                children: null,

                code: '330503108',
                name: '浙江省/湖州市/南浔区/石淙镇',
                treePath: '330000/330500/330503/330503108',

                level: 5,
              },
              {
                id: '330503101',

                label: '练市镇',
                parentId: '330503',

                children: null,

                code: '330503101',
                name: '浙江省/湖州市/南浔区/练市镇',
                treePath: '330000/330500/330503/330503101',

                level: 5,
              },
              {
                id: '330503103',

                label: '菱湖镇',
                parentId: '330503',

                children: null,

                code: '330503103',
                name: '浙江省/湖州市/南浔区/菱湖镇',
                treePath: '330000/330500/330503/330503103',

                level: 5,
              },
            ],

            code: '330503',
            name: '浙江省/湖州市/南浔区',
            treePath: '330000/330500/330503',

            level: 4,
          },
          {
            id: '330502',

            label: '吴兴区',
            parentId: '330500',

            children: [
              {
                id: '330502103',

                label: '东林镇',
                parentId: '330502',

                children: null,

                code: '330502103',
                name: '浙江省/湖州市/吴兴区/东林镇',
                treePath: '330000/330500/330502/330502103',

                level: 5,
              },
              {
                id: '330502008',

                label: '仁皇山街道',
                parentId: '330502',

                children: null,

                code: '330502008',
                name: '浙江省/湖州市/吴兴区/仁皇山街道',
                treePath: '330000/330500/330502/330502008',

                level: 5,
              },
              {
                id: '330502101',

                label: '八里店镇',
                parentId: '330502',

                children: null,

                code: '330502101',
                name: '浙江省/湖州市/吴兴区/八里店镇',
                treePath: '330000/330500/330502/330502101',

                level: 5,
              },
              {
                id: '330502006',

                label: '凤凰街道',
                parentId: '330502',

                children: null,

                code: '330502006',
                name: '浙江省/湖州市/吴兴区/凤凰街道',
                treePath: '330000/330500/330502/330502006',

                level: 5,
              },
              {
                id: '330502104',

                label: '埭溪镇',
                parentId: '330502',

                children: null,

                code: '330502104',
                name: '浙江省/湖州市/吴兴区/埭溪镇',
                treePath: '330000/330500/330502/330502104',

                level: 5,
              },
              {
                id: '330502102',

                label: '妙西镇',
                parentId: '330502',

                children: null,

                code: '330502102',
                name: '浙江省/湖州市/吴兴区/妙西镇',
                treePath: '330000/330500/330502/330502102',

                level: 5,
              },
              {
                id: '330502007',

                label: '康山街道',
                parentId: '330502',

                children: null,

                code: '330502007',
                name: '浙江省/湖州市/吴兴区/康山街道',
                treePath: '330000/330500/330502/330502007',

                level: 5,
              },
              {
                id: '330502001',

                label: '月河街道',
                parentId: '330502',

                children: null,

                code: '330502001',
                name: '浙江省/湖州市/吴兴区/月河街道',
                treePath: '330000/330500/330502/330502001',

                level: 5,
              },
              {
                id: '330502002',

                label: '朝阳街道',
                parentId: '330502',

                children: null,

                code: '330502002',
                name: '浙江省/湖州市/吴兴区/朝阳街道',
                treePath: '330000/330500/330502/330502002',

                level: 5,
              },
              {
                id: '330502011',

                label: '杨家埠街道',
                parentId: '330502',

                children: null,

                code: '330502011',
                name: '浙江省/湖州市/吴兴区/杨家埠街道',
                treePath: '330000/330500/330502/330502011',

                level: 5,
              },
              {
                id: '330502013',

                label: '湖东街道',
                parentId: '330502',

                children: null,

                code: '330502013',
                name: '浙江省/湖州市/吴兴区/湖东街道',
                treePath: '330000/330500/330502/330502013',

                level: 5,
              },
              {
                id: '330502009',

                label: '滨湖街道',
                parentId: '330502',

                children: null,

                code: '330502009',
                name: '浙江省/湖州市/吴兴区/滨湖街道',
                treePath: '330000/330500/330502/330502009',

                level: 5,
              },
              {
                id: '330502003',

                label: '爱山街道',
                parentId: '330502',

                children: null,

                code: '330502003',
                name: '浙江省/湖州市/吴兴区/爱山街道',
                treePath: '330000/330500/330502/330502003',

                level: 5,
              },
              {
                id: '330502012',

                label: '环渚街道',
                parentId: '330502',

                children: null,

                code: '330502012',
                name: '浙江省/湖州市/吴兴区/环渚街道',
                treePath: '330000/330500/330502/330502012',

                level: 5,
              },
              {
                id: '330502100',

                label: '织里镇',
                parentId: '330502',

                children: null,

                code: '330502100',
                name: '浙江省/湖州市/吴兴区/织里镇',
                treePath: '330000/330500/330502/330502100',

                level: 5,
              },
              {
                id: '330502200',

                label: '道场乡',
                parentId: '330502',

                children: null,

                code: '330502200',
                name: '浙江省/湖州市/吴兴区/道场乡',
                treePath: '330000/330500/330502/330502200',

                level: 5,
              },
              {
                id: '330502004',

                label: '飞英街道',
                parentId: '330502',

                children: null,

                code: '330502004',
                name: '浙江省/湖州市/吴兴区/飞英街道',
                treePath: '330000/330500/330502/330502004',

                level: 5,
              },
              {
                id: '330502005',

                label: '龙泉街道',
                parentId: '330502',

                children: null,

                code: '330502005',
                name: '浙江省/湖州市/吴兴区/龙泉街道',
                treePath: '330000/330500/330502/330502005',

                level: 5,
              },
              {
                id: '330502010',

                label: '龙溪街道',
                parentId: '330502',

                children: null,

                code: '330502010',
                name: '浙江省/湖州市/吴兴区/龙溪街道',
                treePath: '330000/330500/330502/330502010',

                level: 5,
              },
            ],

            code: '330502',
            name: '浙江省/湖州市/吴兴区',
            treePath: '330000/330500/330502',

            level: 4,
          },
          {
            id: '330523',

            label: '安吉县',
            parentId: '330500',

            children: [
              {
                id: '330523205',

                label: '上墅乡',
                parentId: '330523',

                children: null,

                code: '330523205',
                name: '浙江省/湖州市/安吉县/上墅乡',
                treePath: '330000/330500/330523/330523205',

                level: 5,
              },
              {
                id: '330523111',

                label: '天子湖镇',
                parentId: '330523',

                children: null,

                code: '330523111',
                name: '浙江省/湖州市/安吉县/天子湖镇',
                treePath: '330000/330500/330523/330523111',

                level: 5,
              },
              {
                id: '330523108',

                label: '天荒坪镇',
                parentId: '330523',

                children: null,

                code: '330523108',
                name: '浙江省/湖州市/安吉县/天荒坪镇',
                treePath: '330000/330500/330523/330523108',

                level: 5,
              },
              {
                id: '330523105',

                label: '孝丰镇',
                parentId: '330523',

                children: null,

                code: '330523105',
                name: '浙江省/湖州市/安吉县/孝丰镇',
                treePath: '330000/330500/330523/330523105',

                level: 5,
              },
              {
                id: '330523004',

                label: '孝源街道',
                parentId: '330523',

                children: null,

                code: '330523004',
                name: '浙江省/湖州市/安吉县/孝源街道',
                treePath: '330000/330500/330523/330523004',

                level: 5,
              },
              {
                id: '330523206',

                label: '山川乡',
                parentId: '330523',

                children: null,

                code: '330523206',
                name: '浙江省/湖州市/安吉县/山川乡',
                treePath: '330000/330500/330523/330523206',

                level: 5,
              },
              {
                id: '330523106',

                label: '报福镇',
                parentId: '330523',

                children: null,

                code: '330523106',
                name: '浙江省/湖州市/安吉县/报福镇',
                treePath: '330000/330500/330523/330523106',

                level: 5,
              },
              {
                id: '330523104',

                label: '杭垓镇',
                parentId: '330523',

                children: null,

                code: '330523104',
                name: '浙江省/湖州市/安吉县/杭垓镇',
                treePath: '330000/330500/330523/330523104',

                level: 5,
              },
              {
                id: '330523101',

                label: '梅溪镇',
                parentId: '330523',

                children: null,

                code: '330523101',
                name: '浙江省/湖州市/安吉县/梅溪镇',
                treePath: '330000/330500/330523/330523101',

                level: 5,
              },
              {
                id: '330523201',

                label: '溪龙乡',
                parentId: '330523',

                children: null,

                code: '330523201',
                name: '浙江省/湖州市/安吉县/溪龙乡',
                treePath: '330000/330500/330523/330523201',

                level: 5,
              },
              {
                id: '330523107',

                label: '章村镇',
                parentId: '330523',

                children: null,

                code: '330523107',
                name: '浙江省/湖州市/安吉县/章村镇',
                treePath: '330000/330500/330523/330523107',

                level: 5,
              },
              {
                id: '330523001',

                label: '递铺街道',
                parentId: '330523',

                children: null,

                code: '330523001',
                name: '浙江省/湖州市/安吉县/递铺街道',
                treePath: '330000/330500/330523/330523001',

                level: 5,
              },
              {
                id: '330523103',

                label: '鄣吴镇',
                parentId: '330523',

                children: null,

                code: '330523103',
                name: '浙江省/湖州市/安吉县/鄣吴镇',
                treePath: '330000/330500/330523/330523103',

                level: 5,
              },
            ],

            code: '330523',
            name: '浙江省/湖州市/安吉县',
            treePath: '330000/330500/330523',

            level: 4,
          },
          {
            id: '330521',

            label: '德清县',
            parentId: '330500',

            children: [
              {
                id: '330521202',

                label: '下渚湖街道',
                parentId: '330521',

                children: null,

                code: '330521202',
                name: '浙江省/湖州市/德清县/下渚湖街道',
                treePath: '330000/330500/330521/330521202',

                level: 5,
              },
              {
                id: '330521101',

                label: '乾元镇',
                parentId: '330521',

                children: null,

                code: '330521101',
                name: '浙江省/湖州市/德清县/乾元镇',
                treePath: '330000/330500/330521/330521101',

                level: 5,
              },
              {
                id: '330521115',

                label: '新安镇',
                parentId: '330521',

                children: null,

                code: '330521115',
                name: '浙江省/湖州市/德清县/新安镇',
                treePath: '330000/330500/330521/330521115',

                level: 5,
              },
              {
                id: '330521114',

                label: '新市镇',
                parentId: '330521',

                children: null,

                code: '330521114',
                name: '浙江省/湖州市/德清县/新市镇',
                treePath: '330000/330500/330521/330521114',

                level: 5,
              },
              {
                id: '330521002',

                label: '武康街道',
                parentId: '330521',

                children: null,

                code: '330521002',
                name: '浙江省/湖州市/德清县/武康街道',
                treePath: '330000/330500/330521/330521002',

                level: 5,
              },
              {
                id: '330521103',

                label: '洛舍镇',
                parentId: '330521',

                children: null,

                code: '330521103',
                name: '浙江省/湖州市/德清县/洛舍镇',
                treePath: '330000/330500/330521/330521103',

                level: 5,
              },
              {
                id: '330521116',

                label: '禹越镇',
                parentId: '330521',

                children: null,

                code: '330521116',
                name: '浙江省/湖州市/德清县/禹越镇',
                treePath: '330000/330500/330521/330521116',

                level: 5,
              },
              {
                id: '330521003',

                label: '舞阳街道',
                parentId: '330521',

                children: null,

                code: '330521003',
                name: '浙江省/湖州市/德清县/舞阳街道',
                treePath: '330000/330500/330521/330521003',

                level: 5,
              },
              {
                id: '330521117',

                label: '莫干山镇',
                parentId: '330521',

                children: null,

                code: '330521117',
                name: '浙江省/湖州市/德清县/莫干山镇',
                treePath: '330000/330500/330521/330521117',

                level: 5,
              },
              {
                id: '330521113',

                label: '钟管镇',
                parentId: '330521',

                children: null,

                code: '330521113',
                name: '浙江省/湖州市/德清县/钟管镇',
                treePath: '330000/330500/330521/330521113',

                level: 5,
              },
              {
                id: '330521004',

                label: '阜溪街道',
                parentId: '330521',

                children: null,

                code: '330521004',
                name: '浙江省/湖州市/德清县/阜溪街道',
                treePath: '330000/330500/330521/330521004',

                level: 5,
              },
              {
                id: '330521110',

                label: '雷甸镇',
                parentId: '330521',

                children: null,

                code: '330521110',
                name: '浙江省/湖州市/德清县/雷甸镇',
                treePath: '330000/330500/330521/330521110',

                level: 5,
              },
            ],

            code: '330521',
            name: '浙江省/湖州市/德清县',
            treePath: '330000/330500/330521',

            level: 4,
          },
          {
            id: '330522',

            label: '长兴县',
            parentId: '330500',

            children: [
              {
                id: '330522202',

                label: '吕山乡',
                parentId: '330522',

                children: null,

                code: '330522202',
                name: '浙江省/湖州市/长兴县/吕山乡',
                treePath: '330000/330500/330522/330522202',

                level: 5,
              },
              {
                id: '330522107',

                label: '和平镇',
                parentId: '330522',

                children: null,

                code: '330522107',
                name: '浙江省/湖州市/长兴县/和平镇',
                treePath: '330000/330500/330522/330522107',

                level: 5,
              },
              {
                id: '330522003',

                label: '太湖街道',
                parentId: '330522',

                children: null,

                code: '330522003',
                name: '浙江省/湖州市/长兴县/太湖街道',
                treePath: '330000/330500/330522/330522003',

                level: 5,
              },
              {
                id: '330522103',

                label: '夹浦镇',
                parentId: '330522',

                children: null,

                code: '330522103',
                name: '浙江省/湖州市/长兴县/夹浦镇',
                treePath: '330000/330500/330522/330522103',

                level: 5,
              },
              {
                id: '330522108',

                label: '小浦镇',
                parentId: '330522',

                children: null,

                code: '330522108',
                name: '浙江省/湖州市/长兴县/小浦镇',
                treePath: '330000/330500/330522/330522108',

                level: 5,
              },
              {
                id: '330522102',

                label: '李家巷镇',
                parentId: '330522',

                children: null,

                code: '330522102',
                name: '浙江省/湖州市/长兴县/李家巷镇',
                treePath: '330000/330500/330522/330522102',

                level: 5,
              },
              {
                id: '330522104',

                label: '林城镇',
                parentId: '330522',

                children: null,

                code: '330522104',
                name: '浙江省/湖州市/长兴县/林城镇',
                treePath: '330000/330500/330522/330522104',

                level: 5,
              },
              {
                id: '330522200',

                label: '水口乡',
                parentId: '330522',

                children: null,

                code: '330522200',
                name: '浙江省/湖州市/长兴县/水口乡',
                treePath: '330000/330500/330522/330522200',

                level: 5,
              },
              {
                id: '330522105',

                label: '泗安镇',
                parentId: '330522',

                children: null,

                code: '330522105',
                name: '浙江省/湖州市/长兴县/泗安镇',
                treePath: '330000/330500/330522/330522105',

                level: 5,
              },
              {
                id: '330522101',

                label: '洪桥镇',
                parentId: '330522',

                children: null,

                code: '330522101',
                name: '浙江省/湖州市/长兴县/洪桥镇',
                treePath: '330000/330500/330522/330522101',

                level: 5,
              },
              {
                id: '330522109',

                label: '煤山镇',
                parentId: '330522',

                children: null,

                code: '330522109',
                name: '浙江省/湖州市/长兴县/煤山镇',
                treePath: '330000/330500/330522/330522109',

                level: 5,
              },
              {
                id: '330522002',

                label: '画溪街道',
                parentId: '330522',

                children: null,

                code: '330522002',
                name: '浙江省/湖州市/长兴县/画溪街道',
                treePath: '330000/330500/330522/330522002',

                level: 5,
              },
              {
                id: '330522106',

                label: '虹星桥镇',
                parentId: '330522',

                children: null,

                code: '330522106',
                name: '浙江省/湖州市/长兴县/虹星桥镇',
                treePath: '330000/330500/330522/330522106',

                level: 5,
              },
              {
                id: '330522001',

                label: '雉城街道',
                parentId: '330522',

                children: null,

                code: '330522001',
                name: '浙江省/湖州市/长兴县/雉城街道',
                treePath: '330000/330500/330522/330522001',

                level: 5,
              },
              {
                id: '330522004',

                label: '龙山街道',
                parentId: '330522',

                children: null,

                code: '330522004',
                name: '浙江省/湖州市/长兴县/龙山街道',
                treePath: '330000/330500/330522/330522004',

                level: 5,
              },
            ],

            code: '330522',
            name: '浙江省/湖州市/长兴县',
            treePath: '330000/330500/330522',

            level: 4,
          },
        ],

        code: '330500',
        name: '浙江省/湖州市',
        treePath: '330000/330500',

        level: 3,
      },
    ],
    code: '330000',
    name: '浙江省',
    level: 2,
  },
]
